{"Open chat in a new window":"Otevřít chat v novém okně","Open chat":"Otevřít chat","Close chat":"Zavřít chat","Use current theme colors":"Použít aktuální barvy motivu","Not found":"Nenalezeno","Video":"Video","Web":"Web","<h3>Important notes</h3>":"<h3>Důležité poznámky</h3>","Chat":"Chat","Last activity":"Poslední aktivita","Use chat":"Použití chatu","If enabled, there will be a chat next to the video.":"Pokud je to povoleno, vedle videa se zobrazí chat.","Share chat link":"Sdílet odkaz na chat","Read-only":"Pouze pro čtení","Link copied":"Odkaz zkopírován","Error":"Chyba","Terms & Conditions":"Podmínky a pravidla","Show the scrollbar":"Zobrazit posuvník","Transparent background (for stream integration, with OBS for example)":"Průhledné pozadí (pro integraci streamu, například s OBS)","Copy":"Kopírovat","Copied":"Zkopírováno","Open":"Otevřít","Generate an iframe to embed the chat in a website":"Vytvoření iframe pro vložení chatu do webové stránky","Chat for live stream:":"Chat pro živý stream:","Room name":"Název místnosti","Room description":"Popis místnosti","Connect using XMPP":"Připojení pomocí XMPP","You can connect to the room using an external XMPP account, and your favorite XMPP client.":"K místnosti se můžete připojit pomocí externího účtu XMPP a svého oblíbeného klienta XMPP.","You can find the plugin documentation here: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Peertube Plugin Livechat documentation </a>.":"Dokumentaci pluginu naleznete zde: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Dokumentace k zásuvnému modulu Peertube Livechat </a>.","Before asking for help, please use the diagnostic tool: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Launch diagnostic</a> (if this button is not opening a new window, please try to refresh the page).":"Než požádáte o pomoc, použijte prosím diagnostický nástroj: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Spustit diagnostiku</a> (pokud toto tlačítko neotevře nové okno, zkuste stránku obnovit).","<h3>Chat</h3>":"<h3>Chat</h3>","Online help":"Online nápověda","Tips for streamers: To embed the chat in your video stream using OBS for example, generate a read-only link and use it as a browser source.":"Tipy pro streamery: Chcete-li například vložit chat do svého videostreamu pomocí OBS, vygenerujte odkaz pouze pro čtení a použijte jej jako zdroj v prohlížeči.","Channel":"Kanál","Label for the connection button":"Popisek pro tlačítko připojení","Use an OpenID Connect provider":"Použití poskytovatele služby OpenID Connect","Discovery URL":"Discovery URL","Automatically open the chat":"Automatické otevření chatu","Peertube theme":"Motiv Peertube","ConverseJS Cyberpunk theme":"Motiv ConverseJS Cyberpunk","Client ID":"Client ID","Client secret":"Client secret","Use Google":"Použít Google","<strong>Callback/Redirect URI:</strong> If you want to configure authorized redirection URI on the external Application, please add this url:":"<strong>URI zpětného volání/přesměrování:</strong> Pokud chcete nakonfigurovat URI autorizovaného přesměrování na externí aplikaci, přidejte tuto adresu URL:","If checked, the chat will be enabled for all lives.":"Pokud je zaškrtnuto, bude chat povolen pro všechny živé přenosy.","If checked, all live videos will have a checkbox in their properties for enabling the web chat.":"Pokud je zaškrtnuto, budou mít všechna živá videa ve svých vlastnostech zaškrtávací políčko pro povolení webového chatu.","If checked, the chat will be enabled for all video that are not lives.":"Pokud je zaškrtnuto, bude chat povolen pro všechna videa, která nejsou živá.","Legacy Sepia avatars (those included in previous plugin versions)":"Starší avatary Sepia (ty, které byly součástí předchozích verzí zásuvného modulu)","<h3>Chat behaviour</h3>":"<h3>Chování na chatu</h3>","When watching a video, the chatbox will automatically open.":"Při sledování videa se automaticky otevře okno chatu.","Show for the video owner":"Zobrazit majiteli videa","Show for everyone":"Zobrazit pro každého","Activate chat for all lives":"Aktivace chatu pro všechny živé přenosy","If checked, anonymous Peertube users won't see the chat. This feature is still experimental. If you enabled it, it is highly recommended to also check \"Don't publish chat information\". Otherwise, some third party tools could try to open the chat, and have unpredictable behaviours.":"Pokud je zaškrtnuto, anonymní uživatelé Peertube chat neuvidí. Tato funkce je stále experimentální. Pokud jste ji povolili, důrazně doporučujeme zaškrtnout také možnost \"Nezveřejňovat informace o chatu\". V opačném případě by se některé nástroje třetích stran mohly pokusit chat otevřít a chovat se nepředvídatelně.","<h3>Theming</h3>":"<h3>Témata</h3>","Default ConverseJS theme":"Výchozí motiv ConverseJS","None":"Žádné","ConverseJS theme":"Motiv ConverseJS","Please choose the converseJS theme you want to use.":"Vyberte si motiv converseJS, který chcete použít.","Activate chat for these videos":"Aktivovat chat pro tato videa","Fenecs (Mobilizon mascot)":"Fenek (maskot Mobilizon)","<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">List rooms</a>":"<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">Seznam místností</a>","Room type":"Typ místnosti","List existing rooms":"Seznam stávajících místností","By checking this setting, your instance will not publish chat information on the fediverse. Remote Peertube instances will not be aware that they are chat rooms associated to your videos.<br> <b>Please note</b>: if you already had chats in progress, it is possible that the information has already been published. You will have to wait for the next video update before the information is unpublished. Also, if you disable this setting, you'll have to wait for the videos to be updated before the information are published again. This update happens among others when a live event resumes or stops.<br> <b>Please note</b>: this setting only affects the publication of information via the ActivityPub protocol. It will not prevent a remote application from otherwise detecting the presence of chats, and trying to connect to it.":"Zaškrtnutím tohoto nastavení vaše instance nebude publikovat informace o chatu na fediverse. Vzdálené instance Peertube nebudou vědět, že se jedná o chatovací místnosti spojené s vašimi videi.<br> <b>Upozornění</b>: pokud jste již chatovali, je možné, že informace již byly zveřejněny. Než bude zveřejnění informací zrušeno, budete muset počkat na další aktualizaci videa. Pokud toto nastavení zakážete, budete muset počkat, až budou videa aktualizována, než budou informace znovu zveřejněno. K této aktualizaci dojde mimo jiné, když se živý přenos obnoví nebo zastaví.<br> <b>Upozornění</b>: toto nastavení ovlivňuje pouze zveřejňování informací prostřednictvím protokolu ActivityPub. Nezabrání vzdálené aplikaci, aby jinak zjistila přítomnost chatů a pokusila se k ní připojit.","<h4>OpenID Connect</h4>":"<h4>Připojení OpenID</h4>","Sepia (Peertube mascot)":"Sépie (maskot Peertube)","Abstract":"Abstrakt","<h3>External authentication</h3> For users that have no Peertube account, you can enable various authentication modes based on remote authentication providers.":"<h3>Externí ověřování</h3> Pro uživatele, kteří nemají účet na Peertube, můžete povolit různé režimy ověřování na základě poskytovatelů vzdáleného ověřování.","This label will be displayed to users, as the button label to authenticate with this OIDC provider.":"Tento popisek se zobrazí uživatelům jako popisek tlačítka pro ověření u tohoto poskytovatele OIDC.","Show for nobody":"Zobrazit pro nikoho","Show for the video owner and instance's moderators":"Zobrazit pro majitele videa a moderátory instance","Users can activate the chat for their lives":"Uživatelé si mohou aktivovat chat pro své živé přenosy","Don't display remote chats":"Nezobrazovat vzdálené chaty","By checking this setting, your instance will never display chats from remote videos.":"Pokud toto nastavení zaškrtnete, vaše instance nebude nikdy zobrazovat chaty ze vzdálených videí.","Use Facebook":"Použít Facebook","Show the «open in new window» button":"Zobrazit tlačítko \"otevřít v novém okně\"","There will be a button for opening the web chat in a new window.":"K dispozici bude tlačítko pro otevření webového chatu v novém okně.","<span class=\"peertube-plugin-livechat-warning\"> You have enabled the setting «Users can activate the chat for their lives». It is redundant with the «Activate chat for all lives» setting. </span>":"<span class=\"peertube-plugin-livechat-warning\"> Povolili jste nastavení «Uživatelé mohou aktivovat chat pro svůj živé přenosy». S nastavením «Aktivovat chat pro všechny živé přenosy» je redundantní. </span>","Activate chat for all non-lives":"Aktivace chatu pro všechny neživé přenosy","Videos UUIDs for which we want a web chat. Can be non-live videos. One per line. <br /> You can add comments: everything after the # character will be stripped off, and empty lines ignored.<br /> Don't add private videos, the UUIDs will be sent to the frontend.":"Videa UUID, pro která chceme webový chat. Mohou to být neživá videa. Jeden na řádek. <br /> Můžete přidávat komentáře: vše za znakem # bude odstraněno a prázdné řádky budou ignorovány.<br /> Nepřidávejte soukromá videa, UUID budou odeslána do frontendu.","Avatar set":"Sada Avatarů","You can choose from several different sets the default avatars that will be used for chat users. Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Settings</a>.":"Můžete si vybrat z několika různých sad výchozích avatarů, které budou použity pro uživatele chatu. Podívejte se prosím na dokumentaci: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Nastavení</a>.","Enabling this adds a \"login with Facebook\" button. You have to configure a Facebook OAuth application.":"Povolením této funkce se přidá tlačítko \"přihlásit se pomocí Facebooku\". Musíte nakonfigurovat aplikaci Facebook OAuth.","Show the «share chat link» button":"Zobrazení tlačítka \"sdílet odkaz na chat\"","There will be a button for sharing a chat url (could be used for OBS integration, for example).":"K dispozici bude tlačítko pro sdílení url adresy chatu (lze použít například pro integraci OBS).","Hide the chat for anonymous users":"Skrytí chatu pro anonymní uživatele","Ban anonymous user's IP when user is banned from a chatroom":"Zakázat IP adresu anonymního uživatele, když je uživatel vykázán z chatovací místnosti","By enabling this option, each time an anonymous user is banned from a chatroom, it's IP will also be banned from the chat server. Warning: if your instance is open to registration, any user could create a trapped-room, invite users to join, and automatically ban all anonymous user's IPs. The banned IP list is not stored, it will be cleared on server restart, or when you change some plugin's settings. The banned IP are logged in the Prosody server log files, so server's administrators can eventually use some external tools (like fail2ban) to ban IPs more widely.":"Povolením této možnosti bude při každém zákazu anonymního uživatele v chatovací místnosti jeho IP adresa rovněž zakázána na chatovacím serveru. Upozornění: Pokud je vaše instance otevřená pro registraci, může kterýkoli uživatel vytvořit místnost v pasti, pozvat uživatele, aby se k ní připojili, a automaticky zakázat všechny IP adresy anonymních uživatelů. Seznam zakázaných IP se neukládá, vymaže se při restartu serveru nebo při změně nastavení některého zásuvného modulu. Zakázané IP jsou zaznamenány v logovacích souborech serveru Prosody, takže správci serveru mohou případně použít některé externí nástroje (jako fail2ban) pro širší zakázání IP.","Cats":"Kočky","Birds":"Ptáci","These terms & conditions will be shown to all users when then join chatrooms. Streamers can also configure terms & conditions for their channels, that will be shown right after these global terms & conditions.":"Tyto podmínky se zobrazí všem uživatelům, když se připojí k chatovacím místnostem. Streameři mohou také nastavit podmínky pro své kanály, které se zobrazí hned po těchto globálních podmínkách.","You can configure an external OpenID Connect provider that could be used to log in to the chat. Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Settings</a>.":"Můžete nakonfigurovat externího poskytovatele OpenID Connect, který by mohl být použit k přihlášení do chatu. Podívejte se prosím na dokumentaci: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Nastavení</a>.","Don't publish chat information":"Nezveřejňujte informace z chatu","You can choose here to have separate rooms for each video, or to group them by channel.":"Zde si můžete vybrat, zda chcete mít pro každé video samostatnou místnost, nebo zda je chcete seskupit podle kanálů.","Each video has its own webchat room":"Každé video má vlastní webchatovou místnost","Webchat rooms are grouped by channel":"Místnosti webového chatu jsou seskupeny podle kanálů","<h3>Federation</h3> Following settings concern the federation with other Peertube instances, and other fediverse softwares.":"<h3>Federace</h3> Následující nastavení se týkají federace s jinými instancemi Peertube, a dalšími fediverzními softwary.","Enabling this adds a \"login with Google\" button. You have to configure a Google OAuth application.":"Povolením této funkce se přidá tlačítko \"Přihlásit se pomocí Google\". Musíte nakonfigurovat aplikaci Google OAuth.","If checked, room contents will be saved by default. Any user who joins a room will see what was written before they joins.<br> Please note that it is always possible to enable/disable the content archiving for a specific room, by editing its properties.":"Pokud je zaškrtnuto, obsah místnosti se ve výchozím nastavení uloží. Každý uživatel, který se připojí k místnosti, uvidí, co bylo napsáno před jeho připojením.<br> Vezměte prosím na vědomí, že je vždy možné obsah zapnout/vypnout. archivaci pro konkrétní místnost úpravou jejích vlastností.","Disable Websocket":"Zakázat Websocket","Prosody port":"Prosody port","Automatic color detection":"Automatická detekce barev","Try to autodetect colors from user's current theme.<br> When this setting is enabled, the plugin tries to auto-detect colors to apply to the chat theme.<br> If this is not correctly working for some of your Peertube theme, you can disable this option. You can report the bug on the official <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> issue tracker </a>. Don't forget to specify which theme is not working.":"Pokus o automatickou detekci barev podle aktuálního motivu uživatele.<br> Pokud je toto nastavení povoleno, zásuvný modul se pokusí automaticky detekovat barvy, které se použijí v tématu chatu.<br> Pokud to pro některé téma Peertube nefunguje správně, můžete tuto možnost zakázat. Chybu můžete nahlásit na oficiálním <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> sledovači problémů </a>. Nezapomeňte uvést, který motiv nefunguje.","With Peertube &gt;= 5.0.0, this plugin try to use Websocket connection for chatting. If the user's browser or connection is incompatible, the browser will automatically fall back on the BOSH protocol. <br> But in rare case, this can fail. For example, if you have a reverse proxy in front of Peertube that does not allow Websocket connection for plugins. In this case, you can check this setting to disable Websocket connections.":"S Peertube &gt;= 5.0.0, tento plugin se snaží používat Websocket připojení pro chatování. Pokud je prohlížeč nebo připojení uživatele nekompatibilní, prohlížeč automaticky přejde zpět na protokol BOSH. <br> Ve výjimečných případech však může dojít k selhání. Například pokud máte před Peertube reverzní proxy server, který nepovoluje Websocket připojení pro zásuvné moduly. V takovém případě můžete zaškrtnutím tohoto nastavení zakázat připojení Websocket.","Log rooms content by default":"Obsah přihlašovacích místností ve výchozím nastavení","Room logs expiration":"Vypršení platnosti protokolů místností","Use system Prosody":"Použití systému Prosody","This plugin uses the Prosody XMPP server to handle chat rooms.<br> This plugin comes with a Prosody AppImage, that will be used to run the service.":"Tento zásuvný modul používá k obsluze chatovacích místností server XMPP Prosody.<br> Tento zásuvný modul je dodáván s obrazem aplikace Prosody, který se používá ke spuštění služby.","Peertube url for API calls":"URL Peertube pro volání API","Additional styles to be added on the iframe style attribute. <br> Example: height:400px;":"Další styly, které mají být přidány do atributu stylu iframe. <br> Příklad: height:400px;","Warning: don't check this setting if you are not sure of what you are doing.<br> By checking this setting, your Peertube will use the Prosody server that comes with your system, and not the embedded AppImage.<br> Only use this if you encounter problems with the embedded Prosody.":"Upozornění: toto nastavení nezkoušejte, pokud si nejste jisti, co děláte.<br> Zaškrtnutím tohoto nastavení bude váš Peertube používat server Prosody, který je dodáván s vaším systémem, a ne vestavěný AppImage.<br> Toto nastavení použijte pouze v případě, že se setkáte s problémy s vestavěným serverem Prosody.","The port that will be used by the Prosody server.<br> Change it if this port is already in use on your server.<br> You can close this port on your firewall, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"Port, který bude používat server Prosody.<br> Změňte jej, pokud je tento port na vašem serveru již používán.<br> Tento port můžete na svém firewallu zavřít, nebude k němu přístup z vnějšího světa.<br> Poznámka: toto se může v blízké budoucnosti změnit, protože se plánuje přidání funkce pro aktivaci připojení zvenčí.","<h3>Chat server advanced settings</h3>":"<h3>Pokročilé nastavení serveru chatu</h3>","Prosody server":"Prosody server","Please let this setting empty if you don't know what you are doing.<br> In some rare cases, Prosody can't call Peertube's API from its public URI. You can use this field to customize Peertube's URI for Prosody modules (for example, with «http://localhost:9000» or «http://127.0.0.1:9000»).":"Pokud nevíte, co děláte, nechte prosím toto nastavení prázdné.<br> V některých vzácných případech nemůže Prosody volat rozhraní API Peertube z jeho veřejného URI. Toto pole můžete použít k přizpůsobení URI Peertube pro moduly Prosody (například pomocí „http://localhost:9000“ nebo „http://127.0.0.1:9000“).","Webchat iframe style attribute":"Atribut stylu iframe webového chatu","Enable connection to room using external XMPP accounts":"Povolení připojení k místnosti pomocí externích účtů XMPP","You can choose here how long the chatting room's content is kept by the server. The value can be: <ul> <li><b>60</b>: the content will be saved for 60 <b>seconds</b>. You can replace 60 by any integer value.</li> <li><b>1d</b>: the content will be saved for 1 <b>day</b>. You can replace 1 by any integer value.</li> <li><b>1w</b>: the content will be saved for 1 <b>week</b>. You can replace 1 by any integer value.</li> <li><b>1m</b>: the content will be saved for 1 <b>month</b>. You can replace 1 by any integer value.</li> <li><b>1y</b>: the content will be saved for 1 <b>year</b>. You can replace 1 by any integer value.</li> <li><b>never</b>: the content will never expire, and will be kept forever.</li> </ul>":"Zde můžete zvolit, jak dlouho bude obsah chatovací místnosti na serveru uchováván. Hodnota může být: <ul> <li><b>60</b>: obsah bude uložen po dobu 60 <b>sekund</b>. Hodnotu 60 můžete nahradit libovolnou celočíselnou hodnotou.</li> <li><b>1d</b>: obsah bude uložen po dobu 1 <b>dne</b>. Hodnotu 1 můžete nahradit libovolnou celočíselnou hodnotou.</li> <li><b>1w</b>: obsah bude uložen na 1 <b>týden</b>. Hodnotu 1 můžete nahradit libovolnou celočíselnou hodnotou.</li> <li><b>1m</b>: obsah bude uložen na 1 <b>měsíc</b>. 1 můžete nahradit libovolnou celočíselnou hodnotou.</li> <li><b>1y</b>: obsah bude uložen po dobu 1 <b>roku</b>. 1 můžete nahradit libovolnou celočíselnou hodnotou.</li> <li><b>nikdy</b>: obsah nikdy nevyprší a bude uchováván navždy.</li> </ul>","Enable client to server connections":"Povolení připojení klienta k serveru","Prosody client to server port":"Port klienta Prosody na server","Client to server network interfaces":"Síťová rozhraní mezi klientem a serverem","Prosody server to server port":"Server Prosody na port serveru","Server to server network interfaces":"Síťová rozhraní mezi servery","Enable XMPP clients to connect to the built-in Prosody server.<br> This option alone only allows connections from localhost clients.":"Povolení připojení klientů XMPP k vestavěnému serveru Prosody.<br> Pouze tato volba umožňuje připojení pouze klientům localhost.","The network interfaces to listen on for server to server connections.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>":"Síťová rozhraní, na kterých se má naslouchat pro připojení serveru k serveru.<br> Seznam IP adres pro naslouchání, oddělených čárkami (mezery budou odstraněny).<br> Můžete použít „*“ pro naslouchání na všech rozhraních IPv4 a „::“ pro všechna rozhraní IPv6.<br> Příklady: <ul> Příklady: <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>","If this field is empty, the plugin will generate and use self-signed certificates.<br> If you want to use other certificates, just specify here the folder where Prosody can find them. Note: the \"peertube\" user must have read access to this folder.":"Pokud je toto pole prázdné, zásuvný modul bude generovat a používat certifikáty podepsané vlastním podpisem.<br> Pokud chcete použít jiné certifikáty, stačí zde zadat složku, kde je Prosody najde. Poznámka: uživatel „peertube“ musí mít k této složce přístup pro čtení.","The port that will be used by the c2s module of the built-in Prosody server.<br> XMPP clients shall use this port to connect.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall for now, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"Port, který bude používat modul c2s integrovaného serveru Prosody.<br> Klienti XMPP budou pro připojení používat tento port.<br> Změňte jej, pokud je tento port na vašem serveru již používán.<br> Tento port můžete prozatím nechat na svém firewallu zavřený, nebude k němu přístup z vnějšího světa.<br> Poznámka: to se může v blízké budoucnosti změnit, protože se plánuje přidání funkce pro aktivaci připojení zvenčí.","Certificates folder":"Složka certifikátů","By enabling this option, it will be possible to connect to rooms using external XMPP accounts and XMPP clients.<br> <span class=\"peertube-plugin-livechat-warning\"> <b>Warning</b>, enabling this option can request extra server and DNS configuration. </span> Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/advanced/xmpp_clients/\" target=\"_blank\"> Enable external XMPP account connections. </a>":"Povolením této možnosti se bude možné připojit k místnostem pomocí externích účtů XMPP a klientů XMPP.<br> <span class=„peertube-plugin-livechat-warning“> <b>Upozornění</b>, povolení této možnosti může vyžadovat další konfiguraci serveru a DNS. </span> Podívejte se prosím do dokumentace: <a href=„https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/advanced/xmpp_clients/“ target=„_blank“>. Povolení externího připojení k účtu XMPP. </a>","The port that will be used for XMPP s2s (server to server) connections.<br> You should use the standard 5269 port. Otherwise you should <a href=\"https://prosody.im/doc/s2s\"> setup a specific DNS record </a>.":"Port, který bude použit pro připojení XMPP s2s (server to server).<br> Měli byste použít standardní port 5269. V opačném případě byste měli <a href=„https://prosody.im/doc/s2s“> nastavit konkrétní záznam DNS </a>.","External components":"Externí komponenty","The network interfaces to listen on for client to server connections.<br> This setting is provided for advanced users. Don't change this setting if you don't fully understand what it means.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>127.0.0.1, ::1, 172.18.0.42</li> </ul>":"Síťová rozhraní, na kterých bude naslouchat připojení klienta k serveru.<br> Toto nastavení je určeno pro pokročilé uživatele. Toto nastavení neměňte, pokud plně nerozumíte tomu, co znamená.<br> Seznam IP adres k poslechu, oddělené čárkou (mezery budou odstraněny).<br> Můžete použít «*» pro poslech na všech rozhraních IPv4 a «::» pro všechna IPv6.<br> Příklady: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>127.0.0.1, ::1, 172.18.0.42</li> </ul>","Enable custom Prosody external components":"Povolit vlastní externí součásti Prosody","The network interfaces to listen on for external components connections.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>":"Síťová rozhraní pro naslouchání připojení externích komponent.<br> Seznam IP adres k poslechu, oddělené čárkou (mezery budou odstraněny).<br> Můžete použít «*» pro poslech na všech rozhraních IPv4 a «::» pro všechna IPv6.<br> Příklady: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>","Prosody external components network interfaces":"Síťová rozhraní externích komponent Prosody","The port that will be used by XMPP components to connect to the Prosody server.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall if you don't allow access on interfaces other than localhost.":"Port, který budou komponenty XMPP používat pro připojení k serveru Prosody.<br> Změňte jej, pokud se tento port již na vašem serveru používá.<br> Pokud nepovolíte přístup jiným rozhraním než localhost, můžete tento port ponechat na vašem firewallu uzavřený.","Enable the use of external XMPP components.<br> This option alone only allows connections from localhost. You have to setup the listening interfaces and open the port on your firewall to make it available from remote servers.<br> This feature can, for example, be used to connect some bots to the chatting rooms.":"Povolte použití externích komponent XMPP.<br> Tato možnost sama o sobě umožňuje připojení pouze z localhost. Musíte nastavit naslouchací rozhraní a otevřít port na vašem firewallu, abyste jej zpřístupnili ze vzdálených serverů.<br> Tuto funkci lze například použít k připojení některých robotů k chatovacím místnostem.","Prosody external components port":"Port pro externí komponenty Prosody","The external components to declare: <ul> <li>One per line.</li> <li>Use the format «component_name:component_secret» (spaces will be trimmed).</li> <li>You can add comments: everything after the # character will be stripped off, and empty lines ignored.</li> <li>The name can only contain latin alphanumeric characters and dots.</li> <li> If the name contains only alphanumeric characters, it will be suffixed with the XMPP domain. For example, «bridge» will become «bridge.your_domain.tld». You can also specify a full domain name, but you have to make sure to configure your DNS correctly. </li> <li>Only use alphanumeric characters in the secret passphrase (use at least 15 characters).</li> </ul>":"Externí komponenty, které je třeba deklarovat: <ul> <li>Jedna na řádek.</li> <li>Použijte formát «název_komponenty:tajné_komponenty» (mezery budou oříznuty).</li> <li>Můžete přidávat komentáře: vše za znakem # bude odstraněno a prázdné řádky budou ignorovány.</li> <li>Název může obsahovat pouze latinské alfanumerické znaky a tečky.</li> <li> Pokud název obsahuje pouze alfanumerické znaky, bude doplněn o doménu XMPP. Například „most“ se změní na „most.vaše_doména.tld“. Můžete také zadat úplný název domény, ale musíte se ujistit, že jste správně nakonfigurovali DNS. </li> <li>V tajné přístupové frázi používejte pouze alfanumerické znaky (použijte alespoň 15 znaků).</li> </ul>","Here you can configure some advanced options for chatrooms associated to your live streams.":"Zde můžete nakonfigurovat některé pokročilé možnosti pro chatovací místnosti přidružené k živým přenosům.","Save":"Uložit","Cancel":"Zrušit","Disable the advanced channel configuration and the chatbot":"Zakázat pokročilou konfiguraci kanálu a chatbota","Successfully saved":"Úspěšně uloženo","Chatrooms":"Chatovací místnosti","<h3>Channel advanced configuration</h3> Following settings concern the advanced channel options: users will be able to add some customization on their channels, activate the moderation bot, ...":"<h3>Pokročilá konfigurace kanálu</h3> Následující nastavení se týkají pokročilých možností kanálu: uživatelé budou moci přidat některá přizpůsobení na svých kanálech, aktivovat moderačního bota, ...","Configure your live's chatrooms":"Konfigurace vašich chatovacích místností","<b class=\"peertube-plugin-livechat-experimental\">Experimental feature:</b> this feature is still experimental.":"<b class=\"peertube-plugin-livechat-experimental\">Experimentální funkce:</b> tato funkce je stále experimentální.","Please select bellow one of your channel, to setup its chatting options.":"Vyberte prosím níže jeden z vašich kanálů a nastavte jeho možnosti chatování.","Reason":"Důvod","Reason to display besides deleted messages":"Důvod zobrazení kromě smazaných zpráv","Also moderate messages from moderators":"Také moderovat zprávy od moderátorů","By default, moderator messages will not be affected by this feature. By checking this option, messages from moderators will also be deleted.":"Ve výchozím nastavení se tato funkce na zprávy moderátora nevztahuje. Zaškrtnutím této možnosti budou zprávy od moderátorů rovněž odstraněny.","Label":"Štítek","You can configure some words that will be automatically moderated by the bot (messages containing such words will be instantly deleted). You can also add an optional reason that will be displayed at the place of deleted messages. Several examples are provided on the documentation page.":"Můžete nastavit některá slova, která bude bot automaticky moderovat (zprávy obsahující tato slova budou okamžitě odstraněny). Můžete také přidat volitelný důvod, který se zobrazí na místě smazaných zpráv. Na stránce s dokumentací je uvedeno několik příkladů.","Label for this forbidden words rule":"Označení tohoto pravidla pro zakázaná slova","Timer":"Časovač","One message per line. If multiple messages, it will pick one randomly every X minutes.":"Jedna zpráva na řádek. Pokud je zpráv více, vybere se jedna náhodně každých X minut.","Send every X minutes":"Odeslat každých X minut","The bot will post the message every X minutes.":"Bot bude zprávu odesílat každých X minut.","You can setup here some options for this channel (moderation policies, ...).":"Zde můžete nastavit některé možnosti pro tento kanál (zásady moderování, ...).","Channel options":"Možnosti kanálů","Enable moderation bot":"Povolení moderačního bota","Moderation bot options":"Možnosti moderačního bota","Forbidden words or expressions":"Zakázaná slova nebo výrazy","One word or expression per line. If you put multiple words on one line, it will only match messages containing the whole sequence.":"Jedno slovo nebo výraz na řádek. Pokud na jeden řádek vložíte více slov, budou se porovnávat pouze zprávy obsahující celou sekvenci.","By checking this option, you can use regular expressions.":"Zaškrtnutím této možnosti můžete použít regulární výrazy.","Consider as regular expressions":"Považujte za regulární výrazy","You can configure several timers that will send messages at regular interval. These messages will be sent by the bot every X minutes. You can for example make the bot sent some sponsoring information every 5 minutes.":"Můžete nakonfigurovat několik časovačů, které budou odesílat zprávy v pravidelných intervalech. Tyto zprávy bude bot odesílat každých X minut. Můžete například nastavit, aby bot odesílal každých 5 minut nějaké informace o sponzorování.","Messages":"Zprávy","Slow mode default value: <ul> <li>0: slow mode disabled</li> <li>Any positive integer: users can send a message every X seconds (moderators are not limited)</li> </ul>":"Výchozí hodnota pomalého režimu: <ul> <li>0: pomalý režim vypnut</li> <li>Jakékoli kladné celé číslo: uživatelé mohou odeslat zprávu každých X sekund (moderátoři nejsou omezeni)</li> </ul>","You can add here some comments about this rule, to remember how and why you created it. These comments are purely indicative, and have no influence on the bot's behavior.":"Můžete sem přidat komentář k tomuto pravidlu, abyste si pamatovali, jak a proč jste ho vytvořili. Tyto komentáře jsou čistě orientační a nemají žádný vliv na chování bota.","Slow mode":"Pomalý režim","Comments":"Komentáře","The message to send.":"Zpráva k odeslání.","Message":"Zpráva","The command, without the starting \"!\". For example \"help\", \"sponsor\", ...":"Příkaz bez počátečního \"!\". Například \"help\", \"sponzor\", ...","For more information about how to configure this feature, please refer to the documentation by clicking on the help button.":"Další informace o konfiguraci této funkce naleznete v dokumentaci kliknutím na tlačítko nápovědy.","Command":"Příkaz","You can generate a link that will open the chat in full page, logged in with your Peertube account. This can be use, for example, to have a web dock in your OBS, so you can read and interact with the chat directly from OBS. Don't share this link to anyone, as it would allow them to connect as yourself. Please find bellow the list of authentication token you have already generated. You can create a new one, or revoke any previous token. Please note that these tokens have no expiration date.":"Můžete si vygenerovat odkaz, který otevře chat na celé stránce, přihlášený pomocí účtu Peertube. Toho lze využít například k tomu, abyste měli v OBS webový dok, takže můžete chat číst a komunikovat s ním přímo z OBS. Tento odkaz nikomu nesdělujte, protože by mu umožnil připojit se jako vy. Níže naleznete seznam již vygenerovaných autentizačních tokenů. Můžete si vytvořit nový nebo zrušit jakýkoli předchozí token. Upozorňujeme, že tyto tokeny nemají žádné datum platnosti.","Tasks":"Úkoly","Create new task list:":"Vytvořit nový seznam úkolů:","Create a new task":"Vytvořit nový úkol","Task name":"Název úkolu","Description":"Popis","Slow mode is enabled, users can send a message every %1$s seconds.":"Je povolen pomalý režim, uživatelé mohou odeslat zprávu každých %1$s sekund.","Are you sure you want to delete this task?":"Opravdu chcete tento úkol odstranit?","Value is of the wrong type.":"Hodnota je nesprávného typu.","Banned users and patterns":"Zakázaní uživatelé a vzory","Bot nickname":"Přezdívka Bota","This value is required.":"Tato hodnota je vyžadována.","There was an error during validation.":"Při ověřování došlo k chybě.","Too many entries":"Příliš mnoho položek","Log in using an external account":"Přihlášení pomocí externího účtu","Your Peertube instance URL":"URL adresa vaší instance Peertube","Log in using an account on another Peertube instance:":"Přihlaste se pomocí účtu na jiné instanci Peertube:","This video is not available on this Peertube instance.":"Toto video není na této instanci Peertube k dispozici.","Searching the video on the Peertube instance...":"Hledání videa na Peertube instanci...","Invalid Peertube URL.":"Neplatná URL adresa Peertube.","The livechat plugin is not installed on this Peertube instance.":"Zásuvný modul livechat není v této instanci Peertube nainstalován.","In some cases, the video can still be retrieved if you connect to the remote instance.":"V některých případech lze video načíst i po připojení ke vzdálené instanci.","Try anyway to open the video on the Peertube instance":"Přesto zkuste otevřít video na instanci Peertube","Authentication failed":"Ověření se nezdařilo","Error when saving the task list":"Chyba při ukládání seznamu úkolů","Task list name":"Název seznamu úkolů","Delete task":"Smazat úkol","Please choose a task list":"Vyberte seznam úkolů","Password token":"Token s heslem","Date":"Datum","Create a new token":"Vytvořit nový token","Revoke the token":"Odvolání tokenu","File size is too big (max size: %s).":"Velikost souboru je příliš velká (maximální velikost: %s).","Once you have chosen a task list, a new task will be created. To see the task, open the task application using the top menu. More information in the livechat plugin documentation.":"Po výběru seznamu úkolů se vytvoří nový úkol. Chcete-li úkol zobrazit, otevřete aplikaci úkolů pomocí horního menu. Více informací naleznete v dokumentaci k zásuvnému modulu livechat.","Value is in the wrong format.":"Hodnota je v nesprávném formátu.","File":"Soubor","If imported data are okay, don't forgot to save the form.":"Pokud jsou importovaná data v pořádku, nezapomeňte formulář uložit.","Are you sure you want to revoke this token?":"Opravdu chcete tento token odvolat?","<h3>Authentication</h3>":"<h3>Autentifikace</h3>","Disable livechat tokens":"Zakázat tokeny livechatu","Value is not in authorized range.":"Hodnota není v povoleném rozsahu.","Duplicate value":"Duplicitní hodnota","Delete task list":"Smazat seznam úkolů","Are you sure you want to delete this task list?":"Opravdu chcete tento seznam úkolů smazat?","There is no task list for now, please first create one":"Zatím neexistuje žádný seznam úkolů, nejprve si ho vytvořte","Become moderator":"Staňte se moderátorem","Channel emojis":"Emotikony kanálu","You can configure custom emojis for your channel. These emojis will be available in the emoji picker. Users can also use them by with their short name (for example by writing \":shortname:\").":"Pro svůj kanál můžete nakonfigurovat vlastní emotikony. Tyto emotikony budou k dispozici ve výběru emotikonů. Uživatelé je mohou používat také pomocí jejich krátkého názvu (například napsáním \":shortname:\").","Short name":"Zkrácený název","You can use emojis in the chat using \":shortname:\". The short name can start and/or end by a colon (:), and only contain alphanumerical characters, underscores and hyphens. It is strongly recommended to start them by a colon, so that users can use autocompletion (by typing \":\" then press TAB).":"V chatu můžete používat emotikony pomocí \":shortname:\". Krátký název může začínat a/nebo končit dvojtečkou (:) a může obsahovat pouze alfanumerické znaky, podtržítka a pomlčky. Důrazně doporučujeme začínat je dvojtečkou, aby uživatelé mohli používat automatické doplňování (zadáním \":\" a následným stisknutím klávesy TAB).","The emoji file.":"Soubor emotikonů.","Import":"Import","Add an entry":"Přidat položku","Remove this entry":"Odebrat tuto položku","Are you sure you want to remove this entry?":"Opravdu chcete tuto položku odstranit?","An error occured while loading data.":"Při načítání dat došlo k chybě.","Embed":"Vložit","This link will open the chat within the Peertube interface.":"Tento odkaz otevře chat v rozhraní Peertube.","Dock":"Dock","Token generated from the web interface":"Token generovaný z webového rozhraní","Your browser has blocked the opening on the remote instance, please try to open manually this link:":"Váš prohlížeč zablokoval otevření ve vzdálené instanci, zkuste prosím otevřít tento odkaz ručně:","Value too long":"Hodnota je příliš dlouhá","Export":"Export","Invalid value.":"Neplatná hodnota.","This chatroom does not exist, or is not accessible to you.":"Tato chatovací místnost neexistuje nebo k ní nemáte přístup.","Here you can configure Prosody <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a> module. You can create multiple configuration files bellow, and change their order. Don't hesitate to share your configurations with the community (for example by adding some examples in the plugin documentation).":"Zde můžete konfigurovat modul Prosody <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a>. Níže můžete vytvořit více konfiguračních souborů a měnit jejich pořadí. Neváhejte se o své konfigurace podělit s komunitou (například přidáním příkladů do dokumentace zásuvného modulu).","Anonymize moderation actions default value for new rooms. When this is enabled, moderation actions will be anonymized, to avoid disclosing who is banning/kicking/… occupants.":"Anonymizovat výchozí hodnotu moderačních akcí pro nové místnosti. Pokud je tato možnost povolena, budou moderátorské akce anonymizovány, aby se zabránilo prozrazení toho, kdo banuje/vyhazuje/... obyvatele.","You can enable <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a> on your Prosody server. For more information, please check <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/mod_firewall/\" target=\"_blank\">the documentation</a>.":"Na serveru Prosody můžete povolit <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a>. Další informace naleznete <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/mod_firewall/\" target=\"_blank\">v dokumentaci</a>.","Only registered users can send messages.":"Zprávy mohou posílat pouze registrovaní uživatelé.","Mute anonymous users":"Ztlumit anonymní uživatele","Moderation delay":"Zpoždění moderování","Moderation delay default value: <ul> <li>0: moderation delay disabled</li> <li>Any positive integer: messages will be delayed for X seconds for non-moderator participants, allowing moderators to delete message before any user can read it.</li> </ul>":"Výchozí hodnota zpoždění moderování: <ul> <li>0: zpoždění moderace vypnuto</li> <li>Ljakékoli kladné celé číslo: zprávy budou pro účastníky, kteří nejsou moderátory, zpožděny o X sekund, což moderátorům umožní smazat zprávu dříve, než si ji přečte kterýkoli uživatel.</li> </ul>","Emoji only mode is enabled, you can only use emoji in your messages.":"Pokud je povolen režim pouze emoji, můžete ve zprávách používat pouze emoji.","Emojis only mode":"Režim pouze pro emoji","You can enable an \"Emojy only mode\" in your chatrooms. When this mode is enabled, participants can only send emojis (standard, or channel custom emojis). Moderators are not affected by this limitation.":"V chatovacích místnostech můžete povolit režim \"Pouze emoji\". Když je tento režim povolen, mohou účastníci posílat pouze emoji (standardní nebo vlastní emoji kanálu). Moderátorů se toto omezení netýká.","Anonymize moderation actions":"Anonymizovat moderátorské akce","Moderation notes":"Moderátorské poznámky","Error when saving the note":"Chyba při ukládání poznámky","Create a new note":"Vytvořit novou poznámku","Delete note":"Smazat poznámku","Search filters":"Vyhledávací filtry","Nickname of the participant at the time of the note creation":"Přezdívka účastníka v době vytvoření poznámky","You can configure the bot to respond to commands. A command is a message starting with a \"!\", like for example \"!help\" that calls the \"help\" command.":"Bota můžete nakonfigurovat tak, aby reagoval na příkazy. Příkaz je zpráva začínající znakem \"!\", například \"!help\", která vyvolá příkaz \"help\".","Create a new poll":"Vytvoření nové ankety","Poll":"Anketa","New poll":"Nová anketa","To vote, click on your choice or send a message with an exclamation mark followed by your choice number (Example: !1).":"Chcete-li hlasovat, klikněte na svou volbu nebo pošlete zprávu s vykřičníkem a číslem volby (příklad: !1).","Send a message with an exclamation mark followed by your choice number to vote. Example: !1":"Pro hlasování pošlete zprávu s vykřičníkem, za kterou následuje číslo vaší volby. Příklad: !1","This choice is not valid.":"Tato volba není platná.","This poll is now over.":"Tato anketa je nyní u konce.","Your vote is taken into account. Votes are anonymous, they will not be shown to other participants.":"Váš hlas je zohledněn. Hlasy jsou anonymní, nebudou zobrazeny ostatním účastníkům.","Your vote has been taking into account, the counters will be updated in a moment.":"Váš hlas byl vzat v úvahu, počítadla budou za chvíli aktualizována.","You can configure a \"terms & conditions\" message that will be shown to users joining your chatrooms.":"Můžete nakonfigurovat zprávu \"podmínky\", která se zobrazí uživatelům, kteří se připojí k vašim chatovacím místnostem.","Search all messages":"Vyhledat všechny zprávy","Message search":"Hledání zpráv","Nickname of the participant when the message was sent":"Přezdívka účastníka v době odeslání zprávy","Enable Prosody mod_firewall":"Povolit mod_firewall Prosody","<a class=\"peertube-button-link orange-button secondary-button\" href=\"/p/livechat/admin/firewall\" target=\"_blank\">Configure mod_firewall</a>":"<a class=\"peertube-button-link orange-button secondary-button\" href=\"/p/livechat/admin/firewall\" target=\"_blank\">Konfigurace mod_firewall</a>","Prosody mod_firewall configuration":"Konfigurace mod_firewall Prosody","Warning: mod_firewall is disabled in the livechat <a href=\"/admin/plugins/show/peertube-plugin-livechat\" target=\"_blank\">plugin settings</a>, you have to enable it if you want this configuration to be taken into account.":"Varování: mod_firewall je zakázán v nastavení <a href=\"/admin/plugins/show/peertube-plugin-livechat\" target=\"_blank\">pluginu</a>, pokud chcete, aby byla tato konfigurace zohledněna, musíte ji povolit.","Enabled":"Povoleno","Name":"Název","Can only contain: alphanumerical characters, underscores and hyphens. Scripts will be loaded in alphabetical order.":"Může obsahovat pouze: alfanumerické znaky, podtržítka a pomlčky. Skripty se načítají v abecedním pořadí.","File content":"Obsah souboru","Bot command":"Příkaz Bota","Users can generate long term tokens to connect to the chat. These tokens can for example be used to include the chat in OBS web docks. Check <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/user/obs\" target=\"_blank\">the documentation</a> for more information. You can disable this feature by checking this setting.":"Uživatelé mohou generovat dlouhodobé tokeny pro připojení k chatu. Tyto tokeny lze například použít k zahrnutí chatu do webových doků OBS. Další informace najdete v <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/user/obs\" target=\"_blank\">dokumentaci</a>. Tuto funkci můžete zakázat zaškrtnutím tohoto nastavení.","Default value for new chatrooms. For existing chatrooms, you can change the feature in the room configuration form. When this feature is enabled, anonymous users can only read the chat, and not send messages.":"Výchozí hodnota pro nové chatovací místnosti. U stávajících chatovacích místností můžete tuto funkci změnit ve formuláři pro konfiguraci místnosti. Když je tato funkce povolena, anonymní uživatelé mohou chat pouze číst, nikoli však odesílat zprávy.","Channel's chat terms & conditions":"Podmínky chatu kanálu","Complete and submit this form to create a new poll. This will end and replace any existing poll.":"Vyplněním a odesláním tohoto formuláře vytvoříte novou anketu. Tím se ukončí a nahradí všechny stávající ankety.","Question":"Otázka","Poll duration (in minutes)":"Doba trvání ankety (v minutách)","Are you sure you want to delete this note?":"Opravdu chcete tuto poznámku smazat?","Search notes":"Hledání poznámek","This mode can be usefull for example: <ul> <li>To avoid spam or offensive message when you are not here to moderate.</li> <li>When there are too many speaking participants, and you can't no more moderate correctly.</li> </ul>":"Tento režim může být užitečný například: <ul> <li> Abyste zabránili spamu nebo urážlivým zprávám, když zde nejste, abyste je moderovali.</li> <li>Když je příliš mnoho hovořících účastníků a vy už nemůžete správně moderovat.</li> </ul>","To enable or disable this mode, you can use the room configuration form. If you want to enable it for all your chatrooms at once, you can use the button bellow.":"Chcete-li tento režim povolit nebo zakázat, můžete použít konfigurační formulář místnosti. Pokud jej chcete povolit pro všechny své chatovací místnosti najednou, můžete použít tlačítko níže.","Enable the emoji only mode on all channel's chatrooms":"Povolení režimu pouze emoji ve všech chatovacích místnostech kanálu","Forbid special characters":"Zákaz speciálních znaků","By enabling this option, the moderation bot will automatically delete messages containing more than X special characters. Special characters are those that don't fit into one of these categories: letters, numbers, punctuation symbols, currency symbols, emojis.":"Pokud tuto možnost povolíte, moderátor bude automaticky mazat zprávy obsahující více než X speciálních znaků. Speciální znaky jsou ty, které nepatří do jedné z těchto kategorií: písmena, číslice, interpunkční znaménka, symboly měn, emotikony.","Tolerance":"Tolerance","Number of special characters to accept in a message without deleting it.":"Počet speciálních znaků, které lze ve zprávě přijmout, aniž by došlo k jejímu vymazání.","This feature comes with the livechat plugin version X.X.X.":"Tato funkce je součástí pluginu livechat verze X.X.X.","No duplicate message":"Žádné duplicitní zprávy","By enabling this options, the moderation bot will automatically moderate duplicate messages. That means if a user send the same message twice within X seconds, the second message will be deleted.":"Povolením této možnosti bude moderovací robot automaticky upravovat duplicitní zprávy. To znamená, že pokud uživatel odešle stejnou zprávu dvakrát během X sekund, druhá zpráva bude odstraněna.","Time interval":"Časový interval","The interval, in seconds, during which a user can't send again the same message.":"Interval v sekundách, během kterého uživatel nemůže znovu odeslat stejnou zprávu.","Message type":"Typ zprávy","Standard":"Standardní","Announcement":"Oznámení","Highlight":"Zvýrazněná","Warning":"Upozornění","Anonymous results":"Anonymní výsledky","Choice {{N}}:":"Možnost {{N}}:","Poll ends at:":"Anketa končí v:","_language":"cs"}