{"Open chat":"Chat öffnen","Open chat in a new window":"Chat in neuem Fenster öffnen","Close chat":"Chat schließen","Use chat":"Chat nutzen","If enabled, there will be a chat next to the video.":"Wenn aktiviert, wird ein Chat neben dem Video sein.","Share chat link":"Chat Link teilen","Read-only":"Nur-Lesen","Show the scrollbar":"Zeige die Scrollleiste","Transparent background (for stream integration, with OBS for example)":"Transpatenter Hintergrund (zum Beispiel für die Streamintegration mit OBS)","Tips for streamers: To embed the chat in your video stream using OBS for example, generate a read-only link and use it as a browser source.":"Tipps für Streamer: Um den Chat in Ihren Video Stream einzubinden, z.B. mit OBS, erstellen Sie einen schreibgeschützten Link und verwenden Sie ihn als Browser-Quelle.","Copy":"Kopieren","Link copied":"Link kopiert","Error":"Fehler","Open":"Öffnen","Use current theme colors":"Die derzeitigen Themenfarben nutzen","Generate an iframe to embed the chat in a website":"IFrame-Element erstellen, um den Chat in eine Webseite zu integrieren","<h3>Important notes</h3>":"<h3>Wichtige Hinweise</h3>","You can find the plugin documentation here: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Peertube Plugin Livechat documentation </a>.":"Sie können die Dokumentation hier finden: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/de/\" target=\"_blank\"> Peertube Plugin Livechat Dokumentation </a>.","Before asking for help, please use the diagnostic tool: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Launch diagnostic</a> (if this button is not opening a new window, please try to refresh the page).":"Bevor Sie um Hilfe bitten, verwenden Sie bitte das Diagnosetool: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Diagnose starten</a> (wenn dieser Knopf kein neues Fenster öffnet, versuchen Sie bitte, die Seite zu aktualisieren).","<h3>Chat</h3>":"<h3>Chat</h3>","List existing rooms":"Bestehende Räume auflisten","<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">List rooms</a>":"<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">Räume auflisten</a>","<h3>Federation</h3> Following settings concern the federation with other Peertube instances, and other fediverse softwares.":"<h3>Föderation</h3> Die folgenden Einstellungen betreffen die Föderation mit anderen Peertube-Instanzen, und anderer Fediverse Software.","Don't display remote chats":"Chats von anderen Instanzen nicht anzeigen","By checking this setting, your instance will never display chats from remote videos.":"Wenn Sie diese Einstellung aktivieren, werden in Ihrer Instanz niemals Chats von Videos anderer Instanzen angezeigt.","Don't publish chat information":"Chat-Information nicht veröffentlichen","By checking this setting, your instance will not publish chat information on the fediverse. Remote Peertube instances will not be aware that they are chat rooms associated to your videos.<br> <b>Please note</b>: if you already had chats in progress, it is possible that the information has already been published. You will have to wait for the next video update before the information is unpublished. Also, if you disable this setting, you'll have to wait for the videos to be updated before the information are published again. This update happens among others when a live event resumes or stops.<br> <b>Please note</b>: this setting only affects the publication of information via the ActivityPub protocol. It will not prevent a remote application from otherwise detecting the presence of chats, and trying to connect to it.":"Wenn Sie diese Einstellung aktivieren, wird Ihre Instanz keine Chat Informationen im Fediverse veröffentlichen. Andere Peertube-Instanzen wissen nicht, dass mit Ihren Videos Chaträume verbunden sind.<br> <b>Bitte beachten Sie</b>: Wenn Sie bereits Chats geführt haben, ist es möglich, dass die Informationen bereits veröffentlicht wurden. Sie müssen das nächste Video Update abwarten, bevor die Informationen nicht mehr öffentlich zugänglich sind. Wenn Sie diese Einstellung deaktivieren, müssen Sie außerdem warten, bis die Videos aktualisiert wurden, bevor die Informationen erneut veröffentlicht werden. Diese Aktualisierung erfolgt unter anderem, wenn ein Live Event fortgesetzt oder beendet wird.<br> <b>Bitte beachten Sie</b>: Diese Einstellung betrifft nur die Veröffentlichung von Informationen über das ActivityPub-Protokoll. Dies hindert eine entfernte Anwendung nicht daran, das Vorhandensein von Chats zu erkennen und zu versuchen, eine Verbindung herzustellen.","<h3>Chat behaviour</h3>":"<h3>Chatverhalten</h3>","Room type":"Raumtyp","You can choose here to have separate rooms for each video, or to group them by channel.":"Sie können hier wählen, ob Sie für jedes Video einen eigenen Raum haben möchten oder ob Sie sie nach Kanälen gruppieren möchten.","Each video has its own webchat room":"Eigenen Webchat-Raum für jedes Video","Webchat rooms are grouped by channel":"Webchat-Räume nach Kanal gruppieren","Automatically open the chat":"Chat automatisch öffnen","When watching a video, the chatbox will automatically open.":"Wenn ausgewählt wird der Chat geladen, sobald Sie auf der Videoseite sind.","Show the «open in new window» button":"Zeige den «Chat in neuem Fenster öffnen» Knopf","There will be a button for opening the web chat in a new window.":"Es wird einen Knopf zum Öffnen des Webchats in einem neuen Fenster geben.","Show the «share chat link» button":"Zeige den «Chat Link teilen» Knopf","There will be a button for sharing a chat url (could be used for OBS integration, for example).":"Es wird einen Knopf für das Teilen des Chat Links geben (könnte z.B. für die Integration in OBS verwendet werden).","Show for nobody":"Niemandem zeigen","Show for everyone":"Jedem zeigen","Show for the video owner":"Videobesitzer zeigen","Show for the video owner and instance's moderators":"Videobesitzern, Instanzmoderatoren zeigen","Users can activate the chat for their lives":"Nutzer können den Chat für ihre Live-Videos aktivieren","If checked, all live videos will have a checkbox in their properties for enabling the web chat.":"Wenn diese Option aktiviert ist, haben alle Live-Videos in ihren Eigenschaften ein Feld zur Aktivierung des Webchats.","<span class=\"peertube-plugin-livechat-warning\"> You have enabled the setting «Users can activate the chat for their lives». It is redundant with the «Activate chat for all lives» setting. </span>":"<span class=\"peertube-plugin-livechat-warning\"> Sie haben die Einstellung «Nutzer können den Chat für ihre Livestreams aktivieren» aktiviert. Die Einstellung ist von der «Chats für alle Livestreams aktivieren» Einstellung abhängig. </span>","Activate chat for all lives":"Chat für alle Live-Videos aktivieren","If checked, the chat will be enabled for all lives.":"Wenn diese Option markiert ist, wird der Chat für alle Live-Videos aktiviert.","Activate chat for all non-lives":"Chat für alle Nicht-Live-Videos aktivieren","If checked, the chat will be enabled for all video that are not lives.":"Wenn diese Option aktiviert ist, wird der Chat für alle Videos aktiviert, die keine Live-Videos sind.","Activate chat for these videos":"Chat für diese Videos aktivieren","Videos UUIDs for which we want a web chat. Can be non-live videos. One per line. <br /> You can add comments: everything after the # character will be stripped off, and empty lines ignored.<br /> Don't add private videos, the UUIDs will be sent to the frontend.":"Videos UUIDs, für die wir einen Webchat wollen. Es können auch Nicht-Livestream-Videos sein. Ein Video pro Zeile. <br /> Sie können Kommentare hinzufügen: alles nach dem #-Zeichen wird entfernt, und leere Zeilen werden ignoriert. <br /> Fügen Sie keine privaten Videos hinzu, die UUIDs werden an das Frontend gesendet.","Hide the chat for anonymous users":"Chat für anonyme Benutzer ausblenden","If checked, anonymous Peertube users won't see the chat. This feature is still experimental. If you enabled it, it is highly recommended to also check \"Don't publish chat information\". Otherwise, some third party tools could try to open the chat, and have unpredictable behaviours.":"Wenn die Option aktiviert ist, können anonyme Peertube-Nutzer den Chat nicht sehen. Diese Funktion ist noch experimentell. Wenn Sie diese Option aktiviert haben, wird empfohlen auch die Option \"Chat-Informationen nicht veröffentlichen\" zu aktivieren. Andernfalls könnten einige Tools von Drittanbietern versuchen, den Chat zu öffnen, und ein unvorhersehbares Verhalten verursachen.","<h3>Theming</h3>":"<h3>Themen</h3>","ConverseJS theme":"ConverseJS Thema","Please choose the converseJS theme you want to use.":"Bitte wählen Sie, welches ConverseJS Thema Sie nutzen möchten.","Peertube theme":"Peertube Thema","Default ConverseJS theme":"Default ConverseJS Thema","ConverseJS Cyberpunk theme":"ConverseJS Cyberpunk Thema","Automatic color detection":"Automatische Farberkennung","Try to autodetect colors from user's current theme.<br> When this setting is enabled, the plugin tries to auto-detect colors to apply to the chat theme.<br> If this is not correctly working for some of your Peertube theme, you can disable this option. You can report the bug on the official <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> issue tracker </a>. Don't forget to specify which theme is not working.":"Versucht, die Farben des aktuellen Themas des Benutzers automatisch zu erkennen.<br> Wenn diese Einstellung aktiviert ist, versucht das Plugin, die Farben für das Chat-Thema automatisch zu erkennen.<br> Wenn dies für einige Ihrer Peertube-Themen nicht korrekt funktioniert, können Sie diese Option deaktivieren. Sie können den Fehler im offiziellen <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> Issue Tracker </a> melden. Vergessen Sie nicht anzugeben, welches Thema nicht funktioniert.","Webchat iframe style attribute":"Webchat Iframe Stil-Attribut","Additional styles to be added on the iframe style attribute. <br> Example: height:400px;":"Sie können einige benutzerdefinierte Stile hinzufügen, die dem Iframe hinzugefügt werden. Zum Beispiel eine benutzerdefinierte Breite: width:400px;","<h3>Chat server advanced settings</h3>":"<h3>Erweiterte Einstellungen des Chatservers</h3>","Prosody server":"Prosody Server","This plugin uses the Prosody XMPP server to handle chat rooms.<br> This plugin comes with a Prosody AppImage, that will be used to run the service.":"Dieses Plugin verwendet den Prosody XMPP-Server zur Verwaltung von Chaträumen.<br> Dieses Plugin wird mit einem Prosody AppImage geliefert, das zur Ausführung des Dienstes verwendet wird.","Use system Prosody":"System Prosody benutzen","Warning: don't check this setting if you are not sure of what you are doing.<br> By checking this setting, your Peertube will use the Prosody server that comes with your system, and not the embedded AppImage.<br> Only use this if you encounter problems with the embedded Prosody.":"Warnung: Aktivieren Sie diese Einstellungen nicht, wenn Sie nicht sicher sind, was Sie tun.<br> Wenn Sie diese Einstellungen aktivieren, wird Ihr Peertube den Prosody-Server verwenden, der mit Ihrem System geliefert wird, und nicht das eingebettete AppImage.<br> Nutzen Sie diese Einstellung nur, wenn Sie Probleme mit dem eingebetteten Prosody haben.","Disable Websocket":"Websocket deaktivieren","With Peertube &gt;= 5.0.0, this plugin try to use Websocket connection for chatting. If the user's browser or connection is incompatible, the browser will automatically fall back on the BOSH protocol. <br> But in rare case, this can fail. For example, if you have a reverse proxy in front of Peertube that does not allow Websocket connection for plugins. In this case, you can check this setting to disable Websocket connections.":"Mit Peertube &gt;= 5.0.0 versucht dieses Plugin, eine Websocket-Verbindung zum Chatten zu verwenden. Wenn der Browser oder die Verbindung des Benutzers nicht kompatibel ist, wird der Browser automatisch auf das BOSH-Protokoll zurückgreifen. <br> Aber in seltenen Fällen kann dies fehlschlagen. Zum Beispiel, wenn Sie einen Reverse Proxy vor Peertube haben, der keine Websocket-Verbindung für Plugins erlaubt. In diesem Fall können Sie diese Einstellungen überprüfen, um Websocket-Verbindungen zu deaktivieren.","Prosody port":"Prosody Port","The port that will be used by the Prosody server.<br> Change it if this port is already in use on your server.<br> You can close this port on your firewall, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"Der Port, der vom integrierten Prosody-Server verwendet wird.<br> Ändern Sie ihn, wenn dieser Port bereits auf Ihrem Server verwendet wird.<br> Sie können diesen Port auf Ihrer Firewall schließen, es wird nicht von der Außenwelt darauf zugegriffen. Hinweis: Dies könnte sich in naher Zukunft ändern, da geplant ist, eine Funktion zum Aktivieren externer Verbindungen hinzuzufügen.","Peertube url for API calls":"Peertube-URL für API-Aufrufe","Please let this setting empty if you don't know what you are doing.<br> In some rare cases, Prosody can't call Peertube's API from its public URI. You can use this field to customize Peertube's URI for Prosody modules (for example, with «http://localhost:9000» or «http://127.0.0.1:9000»).":"Bitte lassen Sie diese Einstellungen leer, wenn Sie nicht wissen, was Sie tun.<br> In einigen seltenen Fällen kann Prosody die API von Peertube nicht von seiner öffentlichen URI aufrufen. Sie können dieses Feld verwenden, um die URI von Peertube für Prosody-Module anzupassen (z.B. mit «http://localhost:9000» oder «http://127.0.0.1:9000»).","Log rooms content by default":"Standardmäßig Inhalte von Räumen protokollieren","If checked, room contents will be saved by default. Any user who joins a room will see what was written before they joins.<br> Please note that it is always possible to enable/disable the content archiving for a specific room, by editing its properties.":"Wenn diese Option aktiviert ist, werden die Rauminhalte standardmäßig gespeichert. Jeder Benutzer, der einem Raum beitritt, sieht, was bereits geschrieben wurde, bevor er dem Chat beitrat.<br> Bitte beachten Sie, dass es immer möglich ist, die Inhaltsarchivierung für einen bestimmten Raum zu aktivieren/deaktivieren, indem Sie seine Eigenschaften bearbeiten.","Room logs expiration":"Ablaufzeit von Raumprotokollen","You can choose here how long the chatting room's content is kept by the server. The value can be: <ul> <li><b>60</b>: the content will be saved for 60 <b>seconds</b>. You can replace 60 by any integer value.</li> <li><b>1d</b>: the content will be saved for 1 <b>day</b>. You can replace 1 by any integer value.</li> <li><b>1w</b>: the content will be saved for 1 <b>week</b>. You can replace 1 by any integer value.</li> <li><b>1m</b>: the content will be saved for 1 <b>month</b>. You can replace 1 by any integer value.</li> <li><b>1y</b>: the content will be saved for 1 <b>year</b>. You can replace 1 by any integer value.</li> <li><b>never</b>: the content will never expire, and will be kept forever.</li> </ul>":"Sie können hier auswählen, wie lange der Inhalt des Chatrooms vom Server aufbewahrt wird. Der Wert kann sein: <ul> <li><b>60</b>: Der Inhalt wird 60 <b>Sekunden</b> gespeichert. Sie können 60 durch einen beliebigen ganzzahligen Wert ersetzen.</li> <li><b>1d</b>: Der Inhalt wird für 1 <b>Tag</b> gespeichert. Sie können 1 durch einen beliebigen ganzzahligen Wert ersetzen.</li> <li><b>1w</b>: Der Inhalt wird für 1 <b>Woche</b> gespeichert. Sie können 1 durch einen beliebigen ganzzahligen Wert ersetzen.</li> <li><b>1m</b>: Der Inhalt wird für 1 <b>Monat</b> gespeichert. Sie können 1 durch einen beliebigen ganzzahligen Wert ersetzen.</li> <li><b>1y</b>: Der Inhalt wird für 1 <b>Jahr</b> gespeichert. Sie können 1 durch einen beliebigen ganzzahligen Wert ersetzen.</li> <li><b>nie</b>: Der Inhalt läuft nie ab und wird für immer aufbewahrt.</li> </ul>","Enable connection to room using external XMPP accounts":"Verbindung zum Raum mit externen XMPP Konten aktivieren","By enabling this option, it will be possible to connect to rooms using external XMPP accounts and XMPP clients.<br> <span class=\"peertube-plugin-livechat-warning\"> <b>Warning</b>, enabling this option can request extra server and DNS configuration. </span> Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/advanced/xmpp_clients/\" target=\"_blank\"> Enable external XMPP account connections. </a>":"Durch Aktivieren dieser Option ist es möglich, über externe XMPP-Konten und XMPP-Clients eine Verbindung zu Räumen herzustellen.<br> <span class=\"peertube-plugin-livechat-warning\"> <b>Achtung:</b> Durch die Aktivierung dieser Option können zusätzliche Server- und DNS-Konfigurationen erforderlich sein. </span> Bitte beachten Sie die Dokumentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/de/documentation/admin/advanced/xmpp_clients/\" target=\"_blank\"> Aktivieren Sie externe XMPP-Kontoverbindungen. </a>","Prosody server to server port":"Prosody Server Port zu Server Port","The port that will be used for XMPP s2s (server to server) connections.<br> You should use the standard 5269 port. Otherwise you should <a href=\"https://prosody.im/doc/s2s\"> setup a specific DNS record </a>.":"Der Port, der für XMPP s2s-Verbindungen (Server zu Server) verwendet wird.<br> Sie sollten den Standardport 5269 verwenden. Andernfalls müssen Sie <a href=\"https://prosody.im/doc/s2s\"> einen bestimmten DNS Eintrag erstellen </a>.","Server to server network interfaces":"Server zu Server Netzwerkschnittstellen","The network interfaces to listen on for server to server connections.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>":"Die Netzwerkschnittstellen, die für Server zu Server Verbindungen verwendet werden sollen.<br> Liste der zu nutzenden IPs, durch Kommata getrennt (Leerzeichen werden entfernt).<br> Sie können «*» verwenden, um alle IPv4-Schnittstellen zu nutzen, und «::» für alle IPv6-Schnittstellen.<br> Beispiele: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>","Enable client to server connections":"Aktivieren von Client-Server-Verbindungen","Enable XMPP clients to connect to the built-in Prosody server.<br> This option alone only allows connections from localhost clients.":"Ermöglichen Sie XMPP-Clients die Verbindung zum integrierten Prosody-Server.<br> Diese Option allein lässt nur Verbindungen von localhost-Clients zu.","Prosody client to server port":"Prosody Client-Server-Verbindungsport","The port that will be used by the c2s module of the built-in Prosody server.<br> XMPP clients shall use this port to connect.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall for now, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"Der Port, der vom c2s-Modul des integrierten Prosody-Servers verwendet wird.<br> XMPP-Clients müssen diesen Port zum Verbinden verwenden.<br> Ändern Sie ihn, wenn dieser Port bereits auf Ihrem Server verwendet wird.<br> Sie können diesen Port auf Ihrer Firewall vorerst geschlossen halten, es wird nicht von der Außenwelt darauf zugegriffen. Hinweis: Dies könnte sich in naher Zukunft ändern, da geplant ist, eine Funktion zum Aktivieren externer Verbindungen hinzuzufügen.","Enable custom Prosody external components":"Aktivieren externer XMPP-Komponenten","Enable the use of external XMPP components.<br> This option alone only allows connections from localhost. You have to setup the listening interfaces and open the port on your firewall to make it available from remote servers.<br> This feature can, for example, be used to connect some bots to the chatting rooms.":"Aktivieren Sie die Verwendung externer XMPP-Komponenten.<br> Diese Option allein erlaubt nur Verbindungen von localhost. Sie müssen die Netzwerkschnittstellen einrichten und den Port auf Ihrer Firewall öffnen, um sie von entfernten Servern aus verfügbar zu machen.<br> Diese Funktion kann beispielsweise verwendet werden, um einige Bots mit den Chatrooms zu verbinden.","Prosody external components port":"Port für externe Komponenten zur Verbindung mit Prosody","The port that will be used by XMPP components to connect to the Prosody server.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall if you don't allow access on interfaces other than localhost.":"Der Port, der von XMPP-Komponenten verwendet wird, um sich mit dem Prosody-Server zu verbinden.<br> Ändern Sie ihn, wenn dieser Port bereits auf Ihrem Server verwendet wird.<br> Sie können diesen Port in Ihrer Firewall geschlossen lassen, wenn Sie den Zugriff von anderen Schnittstellen als localhost nicht zulassen möchten.","External components":"Externe Komponenten","The external components to declare: <ul> <li>One per line.</li> <li>Use the format «component_name:component_secret» (spaces will be trimmed).</li> <li>You can add comments: everything after the # character will be stripped off, and empty lines ignored.</li> <li>The name can only contain latin alphanumeric characters and dots.</li> <li> If the name contains only alphanumeric characters, it will be suffixed with the XMPP domain. For example, «bridge» will become «bridge.your_domain.tld». You can also specify a full domain name, but you have to make sure to configure your DNS correctly. </li> <li>Only use alphanumeric characters in the secret passphrase (use at least 15 characters).</li> </ul>":"Die zu erstellenden externen Komponenten: <ul> <li>Eine pro Zeile.</li> <li>Verwenden Sie das Format «Komponentenname:Komponenten_Geheimnis» (Leerzeichen werden entfernt)</li> <li>Sie können Kommentare hinzufügen: alles nach dem #-Zeichen wird entfernt und leere Zeilen werden ignoriert.</li> <li>Der Name darf nur alphanumerische Zeichen und Punkte enthalten</li> <li> Wenn der Name nur alphanumerische Zeichen enthält, wird ihm die XMPP-Domäne angehängt. Aus «bridge» wird zum Beispiel «bridge.your_domain.tld». Sie können auch einen vollständigen Domänennamen angeben, müssen jedoch sicherstellen, dass Ihr DNS korrekt konfiguriert ist. </li> <li>Verwenden Sie nur alphanumerische Zeichen in der geheimen Passphrase (verwenden Sie mindestens 15 Zeichen).</li> </ul>","Chat for live stream:":"Chat für den Livestream:","Room name":"Raumname","Channel":"Kanal","Room description":"Raumbeschreibung","Not found":"Nicht gefunden","Video":"Video","Last activity":"Letzte Aktivität","Web":"Web","Connect using XMPP":"Mit XMPP verbinden","You can connect to the room using an external XMPP account, and your favorite XMPP client.":"Sie können sich mit einem externen XMPP Konto und Ihrem bevorzugten XMPP Client zum Chatraum verbinden.","Certificates folder":"Zertifikate Ordner","If this field is empty, the plugin will generate and use self-signed certificates.<br> If you want to use other certificates, just specify here the folder where Prosody can find them. Note: the \"peertube\" user must have read access to this folder.":"Wenn dieses Feld leer ist, erzeugt und verwendet das Plugin selbstsignierte Zertifikate.<br> Wenn Sie andere Zertifikate verwenden wollen, geben Sie hier einfach den Ordner an, in dem Prosody sie finden kann. Hinweis: Der Benutzer \"peertube\" muss Lesezugriff auf diesen Ordner haben.","Online help":"Online Hilfe","Enable moderation bot":"Moderationsbot aktivieren","One word or expression per line. If you put multiple words on one line, it will only match messages containing the whole sequence.":"Ein Wort oder Ausdruck pro Zeile. Wenn Sie mehrere Wörter in eine Zeile schreiben, werden nur Nachrichten gefunden, die die gesamte Sequenz enthalten.","You can configure some words that will be automatically moderated by the bot (messages containing such words will be instantly deleted). You can also add an optional reason that will be displayed at the place of deleted messages. Several examples are provided on the documentation page.":"Sie können einige Wörter konfigurieren, die vom Chatbot automatisch moderiert werden (Nachrichten, die solche Wörter enthalten, werden sofort gelöscht). Sie können auch einen optionalen Grund hinzufügen, der an der Stelle der gelöschten Nachrichten angezeigt wird. Mehrere Beispiele finden Sie auf der Dokumentationsseite.","<b class=\"peertube-plugin-livechat-experimental\">Experimental feature:</b> this feature is still experimental.":"<b class=\"peertube-plugin-livechat-experimental\">Experimentelle Funktion:</b> diese Funktion ist noch experimentell.","<h3>Channel advanced configuration</h3> Following settings concern the advanced channel options: users will be able to add some customization on their channels, activate the moderation bot, ...":"<h3>Erweiterte Konfiguration des Kanals</h3> Die folgenden Einstellungen betreffen die erweiterten Kanaloptionen: Die Benutzer können ihre Kanäle individuell anpassen, den Moderationsbot aktivieren, ...","Disable the advanced channel configuration and the chatbot":"Die erweiterten Kanalkonfiguration und den Chatbot deaktivieren","Save":"Speichern","Cancel":"Abbrechen","Successfully saved":"Erfolgreich gespeichert","Chatrooms":"Chaträume","Configure your live's chatrooms":"Konfigurieren Sie die Chaträume Ihres Livestreams","Here you can configure some advanced options for chatrooms associated to your live streams.":"Hier können Sie einige erweiterte Optionen für Chaträume konfigurieren, die mit Ihren Livestreams verbunden sind.","Channel options":"Kanaloptionen","You can setup here some options for this channel (moderation policies, ...).":"Sie können hier einige Optionen für diesen Kanal einstellen (Moderationsrichtlinien, ...).","Moderation bot options":"Optionen für den Moderationsbot","Forbidden words or expressions":"Verbotene Wörter oder Ausdrücke","Reason":"Grund","Reason to display besides deleted messages":"Anzuzeigender Grund anstelle der gelöschen Nachricht","By checking this option, you can use regular expressions.":"Wenn Sie diese Option aktivieren, können Sie reguläre Ausdrücke (regex) verwenden.","Timer":"Timer","One message per line. If multiple messages, it will pick one randomly every X minutes.":"Eine Nachricht pro Zeile. Wenn mehrere Nachrichten vorhanden sind, wird alle X Minuten eine zufällig ausgewählt.","Send every X minutes":"Alle X Minuten senden","Bot command":"Chatbotbefehle","Command":"Befehl","The command, without the starting \"!\". For example \"help\", \"sponsor\", ...":"Den Befehl, ohne das beginnende \"!\" eintragen. Zum Beispiel \"help\", \"sponsor\", ...","Message":"Nachricht","The message to send.":"Die zu sendende Nachricht.","For more information about how to configure this feature, please refer to the documentation by clicking on the help button.":"Weitere Informationen zur Konfiguration dieser Funktion finden Sie in der Dokumentation, indem Sie auf die Schaltfläche Hilfe klicken.","Banned users and patterns":"Gesperrte Benutzer und Muster","Bot nickname":"Chatbot Spitzname","Ban anonymous user's IP when user is banned from a chatroom":"IP eines anonymen Benutzers sperren, wenn dieser aus einem Chatraum verbannt wird","By enabling this option, each time an anonymous user is banned from a chatroom, it's IP will also be banned from the chat server. Warning: if your instance is open to registration, any user could create a trapped-room, invite users to join, and automatically ban all anonymous user's IPs. The banned IP list is not stored, it will be cleared on server restart, or when you change some plugin's settings. The banned IP are logged in the Prosody server log files, so server's administrators can eventually use some external tools (like fail2ban) to ban IPs more widely.":"Wenn Sie diese Option aktivieren, wird jedes Mal, wenn ein anonymer Benutzer aus einem Chatraum verbannt wird, seine IP auch vom Chatserver verbannt. Warnung: wenn Ihre Instanz für die Registrierung offen ist, könnte jeder Benutzer einen gefangenen Raum erstellen, Benutzer zum Beitritt einladen und automatisch alle IPs der anonymen Benutzer sperren. Die Liste der gesperrten IPs wird nicht gespeichert, sie wird beim Neustart des Servers gelöscht, oder wenn Sie die Einstellungen eines Plugins ändern. Die gesperrten IPs werden in den Logdateien des Prosody-Servers protokolliert, so dass die Administratoren des Servers eventuell externe Tools (wie fail2ban) verwenden können, um IPs in größerem Umfang zu sperren.","Prosody external components network interfaces":"Prosody externe Komponenten Netzwerkschnittstellen","The network interfaces to listen on for external components connections.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>":"Die Netzwerkschnittstellen, die für externe Komponentenverbindungen überwacht werden sollen.<br> Liste der zu überwachenden IP, durch Kommata getrennt (Leerzeichen werden entfernt).<br> Sie können «*» verwenden, um auf allen IPv4-Schnittstellen zu lauschen, und «::» für alle IPv6-Schnittstellen.<br> Beispiele: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>","Please select bellow one of your channel, to setup its chatting options.":"Bitte wählen Sie unten einen Ihrer Channels aus, um dessen Chat-Optionen einzustellen.","Consider as regular expressions":"Als reguläre Ausdrücke (regex) betrachten","You can configure several timers that will send messages at regular interval. These messages will be sent by the bot every X minutes. You can for example make the bot sent some sponsoring information every 5 minutes.":"Sie können mehrere voraufgezeichnete Nachrichten (Timer) konfigurieren, die in regelmäßigen Abständen gesendet werden. Diese Nachrichten werden vom Chatbot alle X Minuten gesendet. Sie können beispielsweise festlegen, dass der Bot alle 5 Minuten eine Sponsor-Information sendet.","The bot will post the message every X minutes.":"Der Chatbot wird die Nachricht alle X Minuten veröffentlichen.","You can configure the bot to respond to commands. A command is a message starting with a \"!\", like for example \"!help\" that calls the \"help\" command.":"Sie können den Chatbot so konfigurieren, dass er auf Befehle reagiert. Ein Befehl ist eine Nachricht, die mit einem \"!\" beginnt, wie zum Beispiel \"!help\" den Befehl \"help\" aufruft.","Also moderate messages from moderators":"Auch Nachrichten von Moderatoren moderieren","Invalid value.":"Ungültiger Wert.","Comments":"Kommentare","You can add here some comments about this rule, to remember how and why you created it. These comments are purely indicative, and have no influence on the bot's behavior.":"Sie können hier einige Kommentare zu dieser Regel hinzufügen, um sich daran zu erinnern, wie und warum Sie sie erstellt haben. Diese Kommentare sind rein indikativ und haben keinen Einfluss auf das Verhalten des Chatbots.","Messages":"Nachrichten","Avatar set":"Avatar-Satz","You can choose from several different sets the default avatars that will be used for chat users. Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Settings</a>.":"Sie können aus mehreren verschiedenen Sets von Standard-Avataren wählen, die für Chat-Benutzer verwendet werden sollen. Bitte beachten Sie die Dokumentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/de/documentation/admin/settings/\" target=\"_blank\">Einstellungen</a>.","Sepia (Peertube mascot)":"Sepia (Peertube-Maskottchen)","Cats":"Katzen","Birds":"Vögel","Fenecs (Mobilizon mascot)":"Fenecs (Mobilizon-Maskottchen)","Legacy Sepia avatars (those included in previous plugin versions)":"Ältere Sepia-Avatare (die in früheren Plugin-Versionen enthalten waren)","Abstract":"Abstrakt","Slow mode":"Langsamer Modus","Slow mode is enabled, users can send a message every %1$s seconds.":"Wenn der langsame Modus aktiviert ist, können Benutzer alle %1$s Sekunden eine Nachricht senden.","Slow mode default value: <ul> <li>0: slow mode disabled</li> <li>Any positive integer: users can send a message every X seconds (moderators are not limited)</li> </ul>":"Standardwert für den langsamen Modus: <ul> <li>0: langsamer Modus deaktiviert</li> <li>Beliebige positive ganze Zahl: Benutzer können alle X Sekunden eine Nachricht senden (Moderatoren sind nicht beschränkt)</li> </ul>","This chatroom does not exist, or is not accessible to you.":"Dieser Chatraum existiert nicht oder ist für Sie nicht zugänglich.","Searching the video on the Peertube instance...":"Suche nach dem Video auf der Peertube Instanz...","In some cases, the video can still be retrieved if you connect to the remote instance.":"In einigen Fällen kann das Video dennoch abgerufen werden, wenn Sie eine Verbindung zur Remote-Instanz herstellen.","Log in using an account on another Peertube instance:":"Melden Sie sich mit einem Konto auf einer anderen Peertube-Instanz an:","Your Peertube instance URL":"Ihre Peertube Instanz URL","Invalid Peertube URL.":"Ungültige Peertube URL.","The livechat plugin is not installed on this Peertube instance.":"Das Livechat Plugin ist auf dieser Peertube Instanz nicht installiert.","This video is not available on this Peertube instance.":"Dieses Video ist auf dieser Peertube Instanz nicht verfügbar.","Try anyway to open the video on the Peertube instance":"Trotzdem versuchen, das Video auf der Peertube-Instanz zu öffnen","Log in using an external account":"Mit einem externem Account anmelden","Use an OpenID Connect provider":"Verwenden eines OpenID Connect Anbieters","Label for the connection button":"Name für die Anmeldungsschaltfläche","Discovery URL":"Discovery URL","Client ID":"Client ID","Client secret":"Client secret","<h4>OpenID Connect</h4>":"<h4>OpenID Connect</h4>","This label will be displayed to users, as the button label to authenticate with this OIDC provider.":"Diese Bezeichnung wird den Nutzern als Name der Schaltfläche zur Authentifizierung bei diesem OIDC-Anbieter angezeigt.","You can configure an external OpenID Connect provider that could be used to log in to the chat. Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Settings</a>.":"Sie können einen externen OpenID Connect Anbieter konfigurieren, der für die Anmeldung beim Chat verwendet werden kann. Bitte lesen Sie dazu die Dokumentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/de/documentation/admin/settings/\" target=\"_blank\">Einstellungen</a>.","<h3>External authentication</h3> For users that have no Peertube account, you can enable various authentication modes based on remote authentication providers.":"<h3>Externe Authentifizierung</h3> Für Benutzer, die kein Peertubekonto haben, können Sie verschiedene Authentifizierungsmodi auf der Grundlage von externen Authentifizierungsanbietern aktivieren.","Authentication failed":"Authentifizierung fehlgeschlagen","<strong>Callback/Redirect URI:</strong> If you want to configure authorized redirection URI on the external Application, please add this url:":"<strong>Callback/Redirect URI:</strong> Wenn Sie eine autorisierte Umleitungs-URI für die externe Anwendung konfigurieren möchten, fügen Sie bitte diese URL hinzu:","Enabling this adds a \"login with Google\" button. You have to configure a Google OAuth application.":"Wenn Sie dies aktivieren, wird eine Schaltfläche \"Über Google anmelden\" hinzugefügt. Sie müssen eine Google OAuth-Anwendung konfigurieren.","Use Google":"Über Google anmelden","Use Facebook":"Über Facebook anmelden","Enabling this adds a \"login with Facebook\" button. You have to configure a Facebook OAuth application.":"Wenn Sie dies aktivieren, wird eine Schaltfläche \"Über Facebook anmelden\" hinzugefügt. Sie müssen eine Facebook OAuth-Anwendung konfigurieren.","Your browser has blocked the opening on the remote instance, please try to open manually this link:":"Ihr Browser hat das Öffnen der Remote-Instanz blockiert. Bitte versuchen Sie, diesen Link manuell zu öffnen:","Create new task list:":"Neue Aufgabenliste erstellen:","Task list name":"Name der Aufgabenliste","Create a new task":"Eine neue Aufgabe erstellen","Task name":"Aufgabenname","Description":"Beschreibung","Delete task":"Aufgabe löschen","Are you sure you want to delete this task?":"Sind Sie sich sicher, dass Sie diese Aufgabe löschen wollen?","Please choose a task list":"Bitte wählen Sie eine Aufgabenliste","Error when saving the task list":"Fehler beim Speichern der Aufgabenliste","Tasks":"Aufgaben","Delete task list":"Aufgabenliste löschen","Are you sure you want to delete this task list?":"Sind Sie sich sicher, dass Sie diese Aufgabenliste löschen möchten?","There is no task list for now, please first create one":"Es gibt noch keine Aufgabenliste, bitte erstellen Sie zunächst eine","Once you have chosen a task list, a new task will be created. To see the task, open the task application using the top menu. More information in the livechat plugin documentation.":"Sobald Sie eine Aufgabenliste ausgewählt haben, wird eine neue Aufgabe erstellt. Um die Aufgabe zu sehen, öffnen Sie die Aufgabenanwendung über das obere Menü. Weitere Informationen finden Sie in der Dokumentation des Livechat-Plugins.","Become moderator":"Moderator werden","Client to server network interfaces":"Client zu Server Netzwerkschnittstellen","The network interfaces to listen on for client to server connections.<br> This setting is provided for advanced users. Don't change this setting if you don't fully understand what it means.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>127.0.0.1, ::1, 172.18.0.42</li> </ul>":"Die Netzwerkschnittstellen, die für Client-Server-Verbindungen überwacht werden sollen.<br> Diese Einstellung ist für fortgeschrittene Benutzer gedacht. Ändern Sie diese Einstellung nicht, wenn Sie nicht genau wissen, was sie bedeutet.<br> Liste der zu überwachenden IPs, durch Kommata getrennt (Leerzeichen werden entfernt).<br> Sie können \"*\" verwenden, um auf allen IPv4-Schnittstellen zu lauschen, und \"::\" für alle IPv6-Schnittstellen.<br> Beispiele: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>127.0.0.1, ::1, 172.18.0.42</li> </ul>","Label":"Beschriftung","Label for this forbidden words rule":"Beschriftung für diese Regel der verbotenen Wörter","Value is of the wrong type.":"Der Wert hat einen falschen Typ.","Value is in the wrong format.":"Der Wert ist in einem falschen Format.","Value is not in authorized range.":"Der Wert liegt nicht im zulässigen Bereich.","There was an error during validation.":"Bei der Validierung ist ein Fehler aufgetreten.","This value is required.":"Dieser Wert ist erforderlich.","File size is too big (max size: %s).":"Die Datei ist zu groß (maximale Größe: %s).","Duplicate value":"Doppelter Wert","Channel emojis":"Kanal-Emojis","Short name":"Kurzname","You can use emojis in the chat using \":shortname:\". The short name can start and/or end by a colon (:), and only contain alphanumerical characters, underscores and hyphens. It is strongly recommended to start them by a colon, so that users can use autocompletion (by typing \":\" then press TAB).":"Sie können Emojis im Chat mit \":Kurzname:\" verwenden. Der Kurzname kann mit einem Doppelpunkt (:) beginnen und/oder enden und darf nur alphanumerische Zeichen, Unterstriche und Bindestriche enthalten. Es wird dringend empfohlen, sie mit einem Doppelpunkt zu beginnen, damit die Benutzer die automatische Vervollständigung nutzen können (indem sie \":\" eingeben und dann TAB drücken).","You can configure custom emojis for your channel. These emojis will be available in the emoji picker. Users can also use them by with their short name (for example by writing \":shortname:\").":"Sie können benutzerdefinierte Emojis für Ihren Kanal konfigurieren. Diese Emojis werden in der Emoji-Auswahl verfügbar sein. Benutzer können sie auch mit ihrem Kurznamen verwenden (z. B. indem sie \":Kurzname:\" schreiben).","File":"Datei","The emoji file.":"Die Emoji-Datei.","Export":"Exportieren","Import":"Importieren","If imported data are okay, don't forgot to save the form.":"Wenn die importierten Daten in Ordnung sind, vergessen Sie nicht, das Formular zu speichern.","Add an entry":"Eintrag hinzufügen","Remove this entry":"Diesen Eintrag entfernen","Are you sure you want to remove this entry?":"Sind Sie sicher, dass Sie diesen Eintrag entfernen möchten?","An error occured while loading data.":"Beim Laden der Daten ist ein Fehler aufgetreten.","Copied":"Kopiert","Embed":"Einbetten","This link will open the chat within the Peertube interface.":"Über diesen Link wird der Chat in der Peertube-Oberfläche geöffnet.","You can generate a link that will open the chat in full page, logged in with your Peertube account. This can be use, for example, to have a web dock in your OBS, so you can read and interact with the chat directly from OBS. Don't share this link to anyone, as it would allow them to connect as yourself. Please find bellow the list of authentication token you have already generated. You can create a new one, or revoke any previous token. Please note that these tokens have no expiration date.":"Sie können einen Link generieren, der den Chat auf einer neuen Seite öffnet, mit Ihrem Peertube-Konto direkt angemeldet. Damit können Sie z. B. ein Web-Dock in Ihrem OBS einrichten, so dass Sie den Chat direkt von OBS aus lesen und mit ihm interagieren können. Geben Sie diesen Link nicht an andere weiter, da diese sich dann als Sie selbst einloggen können. Unten finden Sie die Liste der Authentifizierungs-Token, die Sie bereits erstellt haben. Sie können ein neues Token erstellen oder ein früheres Token widerrufen. Bitte beachten Sie, dass diese Token kein Verfallsdatum haben.","Users can generate long term tokens to connect to the chat. These tokens can for example be used to include the chat in OBS web docks. Check <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/user/obs\" target=\"_blank\">the documentation</a> for more information. You can disable this feature by checking this setting.":"Benutzer können langfristige Token erzeugen, um sich mit dem Chat zu verbinden. Diese Token können zum Beispiel verwendet werden, um den Chat in OBS-Webdocks einzubinden. Weitere Informationen finden Sie <a href=\"https://livingston.frama.io/peertube-plugin-livechat/de/documentation/user/obs\" target=\"_blank\">in der Dokumentation</a>. Sie können diese Funktion deaktivieren, indem Sie diese Einstellung auswählen.","Password token":"Passwort Token","Create a new token":"Ein neuen Token erstellen","Revoke the token":"Token widerrufen","Token generated from the web interface":"Über die Weboberfläche generierter Token","Are you sure you want to revoke this token?":"Sind Sie sicher, dass Sie diesen Token widerrufen wollen?","<h3>Authentication</h3>":"<h3>Authentifizierung</h3>","Disable livechat tokens":"Livechat-Token deaktivieren","Dock":"Dock","Date":"Datum","Too many entries":"Zu viele Einträge","Mute anonymous users":"Anonyme Benutzer stummschalten","Only registered users can send messages.":"Nur registrierte Benutzer können Nachrichten versenden.","Default value for new chatrooms. For existing chatrooms, you can change the feature in the room configuration form. When this feature is enabled, anonymous users can only read the chat, and not send messages.":"Standardwert für neue Chaträume. Für bestehende Chaträume können Sie die Funktion im Raumkonfigurationsformular ändern. Wenn diese Funktion aktiviert ist, können anonyme Benutzer den Chat nur lesen, aber keine Nachrichten senden.","Terms & Conditions":"Nutzungsbedingungen","These terms & conditions will be shown to all users when then join chatrooms. Streamers can also configure terms & conditions for their channels, that will be shown right after these global terms & conditions.":"Diese Nutzungsbedingungen werden allen Nutzern angezeigt, wenn sie Chaträumen beitreten. Streamer können auch Bedingungen für ihre Kanäle konfigurieren, die direkt nach diesen globalen Bedingungen angezeigt werden.","Value too long":"Wert zu lang","Channel's chat terms & conditions":"Chat Nutzungsbedingungen und Konditionen des Kanals","You can configure a \"terms & conditions\" message that will be shown to users joining your chatrooms.":"Sie können eine \"Nutzungsbedingungen\"-Nachricht konfigurieren, die Benutzern angezeigt wird, die Ihren Chaträumen beitreten.","Send a message with an exclamation mark followed by your choice number to vote. Example: !1":"Senden Sie eine Nachricht mit einem Ausrufezeichen, gefolgt von Ihrer Wahlnummer, um abzustimmen. Beispiel: !1","Create a new poll":"Eine neue Umfrage erstellen","Complete and submit this form to create a new poll. This will end and replace any existing poll.":"Füllen Sie dieses Formular aus und senden Sie es ab, um eine neue Umfrage zu erstellen. Damit wird eine bestehende Umfrage beendet und ersetzt.","To vote, click on your choice or send a message with an exclamation mark followed by your choice number (Example: !1).":"Um abzustimmen, klicken Sie auf Ihre Wahl oder senden Sie eine Nachricht mit einem Ausrufezeichen gefolgt von der Nummer Ihrer Wahl (Beispiel: !1).","Your vote is taken into account. Votes are anonymous, they will not be shown to other participants.":"Ihre Stimme wird berücksichtigt. Die Stimmen sind anonym, sie werden den anderen Teilnehmern nicht angezeigt.","Poll":"Umfrage","New poll":"Neue Umfrage","This poll is now over.":"Diese Umfrage ist nun beendet.","Question":"Frage","Poll duration (in minutes)":"Umfragezeit (in Minuten)","Anonymous results":"Anonyme Ergebnisse","Choice {{N}}:":"Wahl {{N}}:","Poll ends at:":"Die Umfrage endet am:","This choice is not valid.":"Diese Wahl ist nicht gültig.","Your vote has been taking into account, the counters will be updated in a moment.":"Ihre Stimme wurde berücksichtigt, die Zähler werden in Kürze aktualisiert.","Moderation delay":"Moderationsverzögerung","Moderation delay default value: <ul> <li>0: moderation delay disabled</li> <li>Any positive integer: messages will be delayed for X seconds for non-moderator participants, allowing moderators to delete message before any user can read it.</li> </ul>":"Standardwert der Moderationsverzögerung: <ul> <li>0: Moderationsverzögerung deaktiviert</li> <li>Beliebige positive ganze Zahl: Nachrichten werden für Nicht-Moderator-Teilnehmer um X Sekunden verzögert, so dass Moderatoren die Nachricht löschen können, bevor ein anderer Benutzer sie lesen kann.</li> </ul>","None":"Nichts","Anonymize moderation actions":"Moderationsaktionen anonymisieren","Anonymize moderation actions default value for new rooms. When this is enabled, moderation actions will be anonymized, to avoid disclosing who is banning/kicking/… occupants.":"Moderationsaktionen anonymisieren Standardwert für neue Räume. Wenn dies aktiviert ist, werden Moderationsaktionen anonymisiert, um zu vermeiden, dass bekannt wird, wer Teilnehmer bannt/verweist/....","Error when saving the note":"Fehler beim Speichern der Notiz","Delete note":"Notiz löschen","Create a new note":"Eine neue Notiz erstellen","Search notes":"Notizen suchen","Search filters":"Suchfilter","Nickname of the participant at the time of the note creation":"Nickname des Teilnehmers zum Zeitpunkt der Erstellung der Notiz","Are you sure you want to delete this note?":"Sind Sie sicher, dass Sie diese Notiz löschen wollen?","Moderation notes":"Moderationsnotizen","Message search":"Suche nach Nachrichten","Search all messages":"Alle Nachrichten suchen","Nickname of the participant when the message was sent":"Nickname des Teilnehmers zum Zeitpunkt des Versendens der Nachricht","Enable Prosody mod_firewall":"Prosody mod_firewall einschalten","You can enable <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a> on your Prosody server. For more information, please check <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/mod_firewall/\" target=\"_blank\">the documentation</a>.":"Sie können <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a> auf Ihrem Prosody-Server aktivieren. Weitere Informationen finden Sie unter <a href=\"https://livingston.frama.io/peertube-plugin-livechat/de/documentation/admin/mod_firewall/\" target=\"_blank\">in der Dokumentation</a>.","<a class=\"peertube-button-link orange-button secondary-button\" href=\"/p/livechat/admin/firewall\" target=\"_blank\">Configure mod_firewall</a>":"<a class=\"peertube-button-link orange-button secondary-button\" href=\"/p/livechat/admin/firewall\" target=\"_blank\">mod_firewall konfigurieren</a>","Prosody mod_firewall configuration":"Prosody mod_firewall Konfiguration","Here you can configure Prosody <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a> module. You can create multiple configuration files bellow, and change their order. Don't hesitate to share your configurations with the community (for example by adding some examples in the plugin documentation).":"Hier können Sie das Modul Prosody <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a> konfigurieren. Sie können mehrere Konfigurationsdateien unten erstellen und deren Reihenfolge ändern. Zögern Sie nicht, Ihre Konfigurationen mit der Gemeinschaft zu teilen (z. B. indem Sie einige Beispiele zu der Plugin-Dokumentation hinzufügen).","Warning: mod_firewall is disabled in the livechat <a href=\"/admin/plugins/show/peertube-plugin-livechat\" target=\"_blank\">plugin settings</a>, you have to enable it if you want this configuration to be taken into account.":"Warnung: mod_firewall ist in den livechat <a href=\"/admin/plugins/show/peertube-plugin-livechat\" target=\"_blank\">Plugin-Einstellungen </a> deaktiviert, du musst es aktivieren, wenn du willst, dass diese Konfiguration beachtet wird.","Enabled":"Aktiviert","Name":"Name","Can only contain: alphanumerical characters, underscores and hyphens. Scripts will be loaded in alphabetical order.":"Darf nur folgende Zeichen enthalten: alphanumerische Zeichen, Unterstriche und Bindestriche. Die Skripte werden in alphabetischer Reihenfolge geladen.","File content":"Dateiinhalt","Chat":"Chat","Emoji only mode is enabled, you can only use emoji in your messages.":"Wenn der Modus \"Nur Emoji\" aktiviert ist, können Sie nur Emoji in Ihren Nachrichten verwenden.","Emojis only mode":"Nur Emojis-Modus","You can enable an \"Emojy only mode\" in your chatrooms. When this mode is enabled, participants can only send emojis (standard, or channel custom emojis). Moderators are not affected by this limitation.":"Sie können in Ihren Chaträumen einen \"Nur-Emoji-Modus\" aktivieren. Wenn dieser Modus aktiviert ist, können die Teilnehmer nur Emojis (Standard- oder kanalangepasste Emojis) senden. Moderatoren sind von dieser Einschränkung nicht betroffen.","To enable or disable this mode, you can use the room configuration form. If you want to enable it for all your chatrooms at once, you can use the button bellow.":"Um diesen Modus zu aktivieren oder zu deaktivieren, können Sie das Raumkonfigurationsformular verwenden. Wenn Sie ihn für alle Ihre Chaträume auf einmal aktivieren möchten, können Sie die Schaltfläche unten verwenden.","Enable the emoji only mode on all channel's chatrooms":"Aktiviere den Modus \"Nur Emoji\" in allen Chaträumen des Kanals","This mode can be usefull for example: <ul> <li>To avoid spam or offensive message when you are not here to moderate.</li> <li>When there are too many speaking participants, and you can't no more moderate correctly.</li> </ul>":"Dieser Modus kann zum Beispiel nützlich sein: <ul> <li>um Spam oder beleidigende Nachrichten zu vermeiden, wenn Sie nicht hier sind, um zu moderieren.</li> <li>wenn es zu viele sprechende Teilnehmer gibt, und Sie nicht mehr richtig moderieren können.</li> </ul>","By default, moderator messages will not be affected by this feature. By checking this option, messages from moderators will also be deleted.":"Standardmäßig sind Nachrichten von Moderatoren von dieser Funktion nicht betroffen. Wenn Sie diese Option aktivieren, werden auch Nachrichten von Moderatoren gelöscht.","Forbid special characters":"Sonderzeichen verbieten","Tolerance":"Toleranz","Number of special characters to accept in a message without deleting it.":"Anzahl der Sonderzeichen, die in einer Nachricht akzeptiert werden, ohne sie zu löschen.","By enabling this option, the moderation bot will automatically delete messages containing more than X special characters. Special characters are those that don't fit into one of these categories: letters, numbers, punctuation symbols, currency symbols, emojis.":"Wenn Sie diese Option aktivieren, wird der Moderationsbot automatisch Nachrichten löschen, die mehr als X Sonderzeichen enthalten. Sonderzeichen sind Zeichen, die nicht in eine der folgenden Kategorien passen: Buchstaben, Zahlen, Satzzeichen, Währungssymbole, Emojis.","This feature comes with the livechat plugin version X.X.X.":"Diese Funktion wird mit dem Livechatplugin Version X.X.X verfügbar sein.","No duplicate message":"Keine doppelten Nachrichten","By enabling this options, the moderation bot will automatically moderate duplicate messages. That means if a user send the same message twice within X seconds, the second message will be deleted.":"Wenn Sie diese Option aktivieren, wird der Chatbot automatisch doppelte Nachrichten moderieren. Das heißt, wenn ein Benutzer die gleiche Nachricht zweimal innerhalb von X Sekunden sendet, wird die zweite Nachricht gelöscht.","Time interval":"Zeitintervall","The interval, in seconds, during which a user can't send again the same message.":"Das Intervall in Sekunden, in dem ein Benutzer die gleiche Nachricht nicht erneut senden kann.","Message type":"Art der Nachricht","Standard":"Standard","Announcement":"Ankündigung","Highlight":"Highlight","Warning":"Warnung","_language":"de"}