{"Open chat":"Abrir el chat","Open chat in a new window":"Abrir el chat en otra ventana","Close chat":"Cerrar el chat","Use chat":"Habilitar el chat","If enabled, there will be a chat next to the video.":"Activado, abre el chat junto al vídeo.","Share chat link":"Compartir el enlace de esta sala de chat","Read-only":"Sólo lectura","Show the scrollbar":"Mostrar la barra de desplazamiento","Transparent background (for stream integration, with OBS for example)":"Fondo transparente (para la integración en directos, por ejemplo con OBS)","Tips for streamers: To embed the chat in your video stream using OBS for example, generate a read-only link and use it as a browser source.":"para agregar el chat a su OBS, genere un enlace de «solo lectura» y utilícelo como «fuente o canal web».","Copy":"Copiar","Link copied":"Enlace copiado","Error":"Error","Open":"Abrir","Use current theme colors":"Utilizar los colores del tema actual","Generate an iframe to embed the chat in a website":"Generar un iframe para incrustar el chat en un sitio web","Channel":"Canal","Connect using XMPP":"Conectar utilizando XMPP","Last activity":"Última actividad","Video":"Vídeo","Web":"Web","<h3>Important notes</h3>":"<h3>Notas importantes</h3>","<h3>Chat</h3>":"<h3>Chat</h3>","Chat for live stream:":"Chat para transmisión en vivo:","Room name":"Nombre de la Sala","Room description":"Sala descripción","Not found":"No encontrado","You can connect to the room using an external XMPP account, and your favorite XMPP client.":"Puede conectar a la sala con una XMPP cuanta externa, y su favorito XMPP cliente.","<h3>Chat behaviour</h3>":"<h3>Chat comportamiento</h3>","Room type":"Tipo de sala","Each video has its own webchat room":"Cada video tiene su propria sala de webchat","Webchat rooms are grouped by channel":"Salas de webchat son grupadas por su canal","You can find the plugin documentation here: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Peertube Plugin Livechat documentation </a>.":"Puede encontrar la documentación del plugin aquí: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\">Documentación del plugin Peertube Livechat</a>.","You can choose here to have separate rooms for each video, or to group them by channel.":"Puede elegir tener distintas salas para cada video, o agruparlas por canal.","Automatically open the chat":"Abrir el chat automaticamente","Hide the chat for anonymous users":"Esconder chat para usuarios anónimos","ConverseJS theme":"ConverseJS tematización","Please choose the converseJS theme you want to use.":"Elige la converseJS tematización que quiere utilizar por favor.","Peertube theme":"Peertube tematización","Default ConverseJS theme":"ConverseJS tematización por defecto","Automatic color detection":"Detección de color automatica","Prosody port":"Prosody puerto","Peertube url for API calls":"URL de Peertube para peticiones de API","Activate chat for these videos":"Activar chat para estos vídeos","Prosody server":"Servidor prosody","Disable Websocket":"Desactivar Websocket","Enable connection to room using external XMPP accounts":"Activar conexión a la sala con cuentas XMPP externas","<h3>Theming</h3>":"<h3>Tematización</h3>","Before asking for help, please use the diagnostic tool: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Launch diagnostic</a> (if this button is not opening a new window, please try to refresh the page).":"Antes de pedir ayuda, por favor, use la herramienta de diagnóstico: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Lanzar diagnóstico</a> (si este botón no abre una nueva ventana, por favor, intente recargar la página).","List existing rooms":"Listar salas existentes","<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">List rooms</a>":"<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">Listar salas</a>","By checking this setting, your instance will never display chats from remote videos.":"Marcando este ajuste, su instancia nunca mostrará los chats de los vídeos remotos.","Don't publish chat information":"No publicar información del chat","If checked, all live videos will have a checkbox in their properties for enabling the web chat.":"Si se marca, todos los vídeos en directo tendrán un checkbox en sus propiedades para activar el web chat.","<h3>Federation</h3> Following settings concern the federation with other Peertube instances, and other fediverse softwares.":"<h3>Federación</h3> Los siguientes ajustes se refieren a la federación con otras instancias de Peertube, y otros software del fediverso.","Show the «open in new window» button":"Muestra el botón «abrir en ventana nueva»","There will be a button for sharing a chat url (could be used for OBS integration, for example).":"Se mostrará un botón para compartir la url del chat (puede usarse para integración con OBS, por ejemplo).","Don't display remote chats":"No mostrar chats remotos","When watching a video, the chatbox will automatically open.":"Cuando se reproduzca un vídeo, el chatbox se abrirá automáticamente.","There will be a button for opening the web chat in a new window.":"Habrá un botón para abrir el web chat en una nueva ventana.","Show the «share chat link» button":"Muestra el botón \"enlace para compartir el chat\"","Show for the video owner":"Mostrar para el propietario del vídeo","Show for the video owner and instance's moderators":"Mostrar para el propietario del vídeo y los moderadores de la instancia","Activate chat for all lives":"Activar chat para todos los en vivos","If checked, the chat will be enabled for all lives.":"Si se marca, el chat sera activado para todos los en vivos.","Activate chat for all non-lives":"Activar chatpara todos los no - en vivos","By checking this setting, your instance will not publish chat information on the fediverse. Remote Peertube instances will not be aware that they are chat rooms associated to your videos.<br> <b>Please note</b>: if you already had chats in progress, it is possible that the information has already been published. You will have to wait for the next video update before the information is unpublished. Also, if you disable this setting, you'll have to wait for the videos to be updated before the information are published again. This update happens among others when a live event resumes or stops.<br> <b>Please note</b>: this setting only affects the publication of information via the ActivityPub protocol. It will not prevent a remote application from otherwise detecting the presence of chats, and trying to connect to it.":"Al aceptar esta configuración, su instancia no publicara la información del chat en el fediverse. Instancias remotas de Peertube no estaran al tanto de la existencia de chat rooms liados a sus videos. <br> <b>Porfavor note</b>: si ya tiene chats en progreso, es posible que la información ya haya sido publicada. Tendra que esperar a la próxima actualización del video antes de que la información sea ocultada. Ademas, si desactiva esta configuracion, tendra que esperar a la próxima actualización del video antesde que la información sea publicada otra vez. Esta actualización sucede, ente otros, cuando un evento en vivo reanuda o se detiene.<br> <b>Porfavor note</b>: esta configuración solo afecta la publicación de información via el protocolo ActivityPub. Ella no prevendra une applicación remota de detectar la presencia de chats y de intentar connectarse a ellos.","Show for nobody":"No mostrar a nadie","Users can activate the chat for their lives":"Los usuarios pueden activar el chat para sus directos","Show for everyone":"Mostrar a todos","<span class=\"peertube-plugin-livechat-warning\"> You have enabled the setting «Users can activate the chat for their lives». It is redundant with the «Activate chat for all lives» setting. </span>":"<span class=\"peertube-plugin-livechat-warning\"> Ha activado la configuración \"Usuarions pueden activar el chat para sus en vivo\". Es redundante con la configuración \"Activar el chat para todos los en vivos\". </span>","If checked, the chat will be enabled for all video that are not lives.":"Si está marcada, el chat se habilitará para todos los vídeos que no sean en directo.","If checked, anonymous Peertube users won't see the chat. This feature is still experimental. If you enabled it, it is highly recommended to also check \"Don't publish chat information\". Otherwise, some third party tools could try to open the chat, and have unpredictable behaviours.":"Si se marca, los usuarios anónimos de Peertube no verán el chat. Funcionalidad en desarrollo. Si la activas, es muy recomendable marcar también \"No publicar información del chat\". De lo contrario, algunas herramientas de terceros podrían intentar abrir el chat , generando comportamientos imprevistos.","ConverseJS Cyberpunk theme":"Tema cyberpunk de ConverseJS","This plugin uses the Prosody XMPP server to handle chat rooms.<br> This plugin comes with a Prosody AppImage, that will be used to run the service.":"Este plugin utiliza el servidor XMPP Prosody para manejar salas de chat.<br> Este plugin viene con una AppImage de Prosody, que se utilizará para ejecutar el servicio.","Try to autodetect colors from user's current theme.<br> When this setting is enabled, the plugin tries to auto-detect colors to apply to the chat theme.<br> If this is not correctly working for some of your Peertube theme, you can disable this option. You can report the bug on the official <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> issue tracker </a>. Don't forget to specify which theme is not working.":"Intenta detectar automáticamente los colores del tema actual del usuario.<br> Cuando está habilitado, el plugin intenta detectar automáticamente los colores para aplicarlos al tema del chat.<br> Si no funciona correctamente para algunos de sus temas de Peertube, puede deshabilitar esta opción. Puede informar de un error en el <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> rastreador de problemas </a>. No olvide especificar qué tema no funciona.","Webchat iframe style attribute":"Atributo de estilo iframe del Webchat","Additional styles to be added on the iframe style attribute. <br> Example: height:400px;":"Se agregarán estilos adicionales en el atributo de estilo iframe. <br> Por ejemplo: height:400px;","<h3>Chat server advanced settings</h3>":"<h3>Configuración avanzada del servidor de chat</h3>","Use system Prosody":"Use el sistema Prosody","Warning: don't check this setting if you are not sure of what you are doing.<br> By checking this setting, your Peertube will use the Prosody server that comes with your system, and not the embedded AppImage.<br> Only use this if you encounter problems with the embedded Prosody.":"Advertencia: no marque este parametro si no está seguro de lo que está haciendo. <br> Al seleccionar este parametro su Peertube utilizará el servidor Prosody por defecto en su sistema, y no el incorporado en la AppImage. <br> Utilize esto solamente si encuentra problemas con el servidor Prosody de la AppImage.","With Peertube &gt;= 5.0.0, this plugin try to use Websocket connection for chatting. If the user's browser or connection is incompatible, the browser will automatically fall back on the BOSH protocol. <br> But in rare case, this can fail. For example, if you have a reverse proxy in front of Peertube that does not allow Websocket connection for plugins. In this case, you can check this setting to disable Websocket connections.":"Con Peertube &gt;= 5.0.0, este plugin intenta usar una conexión Websocket para chatear. Si el navegador o la conexión del usuario son incompatibles, el navegador recurrirá automáticamente al protocolo BOSH. <br> En ciertos casos esto puede fallar. Por ejemplo, si tiene un proxy inverso frente a Peertube que no permite una conexión Websocket para plugins. En tal caso, puede marcar este parámetro para deshabilitar las conexiones Websocket.","Please let this setting empty if you don't know what you are doing.<br> In some rare cases, Prosody can't call Peertube's API from its public URI. You can use this field to customize Peertube's URI for Prosody modules (for example, with «http://localhost:9000» or «http://127.0.0.1:9000»).":"Por favor, deje esta configuración vacía si no sabe lo que está haciendo.<br> En algunos casos raros, Prosody no puede llamar a la API de Peertube desde su URI pública. Puede usar este campo para personalizar el URI de Peertube para los módulos de Prosody (por ejemplo, con \"http://localhost:9000\" o \"http://127.0.0.1:9000\").","By enabling this option, it will be possible to connect to rooms using external XMPP accounts and XMPP clients.<br> <span class=\"peertube-plugin-livechat-warning\"> <b>Warning</b>, enabling this option can request extra server and DNS configuration. </span> Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/advanced/xmpp_clients/\" target=\"_blank\"> Enable external XMPP account connections. </a>":"Al habilitar esta opción, será posible conectarse a salas utilizando cuentas XMPP externas y clientes XMPP.<br> <span class=\"peertube-plugin-livechat-warning\"> <b>Advertencia</b>, habilitar esta opción puede solicitar un servidor adicional y una configuración de DNS. </span> Por favor, consulte la documentación: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/es/documentation/admin/advanced/xmpp_clients/\" target=\"_blank\"> Habilitar conexiones con cuentas XMPP externas. </a>","You can choose here how long the chatting room's content is kept by the server. The value can be: <ul> <li><b>60</b>: the content will be saved for 60 <b>seconds</b>. You can replace 60 by any integer value.</li> <li><b>1d</b>: the content will be saved for 1 <b>day</b>. You can replace 1 by any integer value.</li> <li><b>1w</b>: the content will be saved for 1 <b>week</b>. You can replace 1 by any integer value.</li> <li><b>1m</b>: the content will be saved for 1 <b>month</b>. You can replace 1 by any integer value.</li> <li><b>1y</b>: the content will be saved for 1 <b>year</b>. You can replace 1 by any integer value.</li> <li><b>never</b>: the content will never expire, and will be kept forever.</li> </ul>":"Aquí puede elegir cuánto tiempo el servidor conserva el contenido de la sala de chat. El valor puede ser: <ul> <li><b>60</b>: el contenido se guardará durante 60 <b>segundos</b>. Puede reemplazar 60 por cualquier valor entero.</li> <li><b>1d</b>: el contenido se guardará durante 1 <b>día</b>. Puede reemplazar 1 por cualquier valor entero.</li> <li><b>1s</b>: el contenido se guardará durante 1 <b>semana</b>. Puede reemplazar 1 por cualquier valor entero.</li> <li><b>1m</b>: el contenido se guardará durante 1 <b>mes</b>. Puede reemplazar 1 por cualquier valor entero.</li> <li><b>1y</b>: el contenido se guardará durante 1 <b>año</b>. Puede reemplazar 1 por cualquier valor entero.</li> <li><b>nunca</b>: el contenido nunca caducará y se mantendrá para siempre.</li> </ul>","Videos UUIDs for which we want a web chat. Can be non-live videos. One per line. <br /> You can add comments: everything after the # character will be stripped off, and empty lines ignored.<br /> Don't add private videos, the UUIDs will be sent to the frontend.":"UUIDs de los videos para los cuales se desea un chat web. Pueden ser videos no en vivo. Una por línea. <br /> Puede agregar comentarios: todo lo que este detras del caracter # no sera interpretado y las líneas vacías ignoradas. <br /> No agregue videos privados, los UUID se enviarán al frontend.","The port that will be used by the Prosody server.<br> Change it if this port is already in use on your server.<br> You can close this port on your firewall, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"El puerto que sera usado por el servidor Prosody.<br> Cámbielo si este puerto ya está en uso en su servidor.<br> Puede cerrar este puerto con su cortafuegos, no sera accesible desde el mundo exterior.<br> Nota: esto podría cambiar en un futuro cercano, ya que está previsto agregar una función para activar las conexiones externas.","Log rooms content by default":"Contenido de los logs de las salas por defecto","If checked, room contents will be saved by default. Any user who joins a room will see what was written before they joins.<br> Please note that it is always possible to enable/disable the content archiving for a specific room, by editing its properties.":"Si está marcado, el contenido de la sala de chat se guardará de forma predeterminada. Cualquier usuario que se una a una sala verá lo que se escribió antes de unirse.<br> Tenga en cuenta que siempre es posible habilitar/deshabilitar el contenido salvaguardado de una sala específica, editando sus propiedades.","Room logs expiration":"Caducidad del historial de la sala","Prosody server to server port":"Puerto Prosody de servidor a servidor","The port that will be used for XMPP s2s (server to server) connections.<br> You should use the standard 5269 port. Otherwise you should <a href=\"https://prosody.im/doc/s2s\"> setup a specific DNS record </a>.":"El puerto que se usará para las conexiones XMPP s2s (servidor a servidor).<br> Debe utilizar el puerto estándar 5269. De lo contrario, debería <a href=\"https://prosody.im/doc/s2s\"> configurar un registro DNS específico </a>.","The network interfaces to listen on for server to server connections.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>":"Las interfaces de red para escuchar conexiones de servidor a servidor.<br> Lista de direcciones IP para escuchar, separadas por comas (se eliminarán los espacios).<br> Puede utilizar «*» para escuchar en todas las interfaces IPv4 y «::» para todas las IPv6.<br> Ejemplos: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>","Server to server network interfaces":"Interfaces de red de servidor a servidor","Enable custom Prosody external components":"Habilitar componentes externos personalizados de Prosody","Enable the use of external XMPP components.<br> This option alone only allows connections from localhost. You have to setup the listening interfaces and open the port on your firewall to make it available from remote servers.<br> This feature can, for example, be used to connect some bots to the chatting rooms.":"Activar el uso de componentes XMPP externos.<br> Esta opción por sí sola solo permite conexiones desde localhost.<br> Debes configurar las interfaces de escucha y abrir el puerto en tu cortafuegos para que esté disponible desde servidores remotos.<br> Esta función se puede utilizar, por ejemplo, para conectar algunos bots a las salas de chat.","The port that will be used by XMPP components to connect to the Prosody server.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall if you don't allow access on interfaces other than localhost.":"El puerto que usarán los componentes XMPP para conectarse al servidor Prosody.<br> Cámbielo si este puerto ya está en uso en su servidor.<br> Puede mantener este puerto cerrado con su firewall por ahora, no se accederá desde el mundo exterior.","Certificates folder":"Directorio de certificados","Enable client to server connections":"Activar las conexiones cliente-servidor","If this field is empty, the plugin will generate and use self-signed certificates.<br> If you want to use other certificates, just specify here the folder where Prosody can find them. Note: the \"peertube\" user must have read access to this folder.":"Si este campo está vacío, el plugin generará y utilizará certificados autofirmados.<br> Si desea utilizar otros certificados, sólo tiene que especificar aquí el directorio donde Prosody puede encontrarlos. Nota: el usuario \"peertube\" debe tener acceso de lectura a este directorio.","Enable XMPP clients to connect to the built-in Prosody server.<br> This option alone only allows connections from localhost clients.":"Habilitar clientes XMPP para conectarse al servidor Prosody integrado.<br> Esta opción sólo permite conexiones desde clientes en localhost.","Prosody client to server port":"Puerto de cliente a servidor Prosody","The port that will be used by the c2s module of the built-in Prosody server.<br> XMPP clients shall use this port to connect.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall for now, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"El puerto que utilizará el módulo c2s del servidor Prosody integrado.<br> Los clientes XMPP deben usar este puerto para conectarse.<br> Cámbielo si este puerto ya está en uso en su servidor.<br> Puede mantener este puerto cerrado con su cortafuegos por ahora, no se accederá desde el mundo exterior.<br> Nota: esto podría cambiar en un futuro cercano, ya que está previsto agregar una función para activar las conexiones externas.","Prosody external components port":"Puerto de componentes externos Prosody","External components":"Componentes externos","The external components to declare: <ul> <li>One per line.</li> <li>Use the format «component_name:component_secret» (spaces will be trimmed).</li> <li>You can add comments: everything after the # character will be stripped off, and empty lines ignored.</li> <li>The name can only contain latin alphanumeric characters and dots.</li> <li> If the name contains only alphanumeric characters, it will be suffixed with the XMPP domain. For example, «bridge» will become «bridge.your_domain.tld». You can also specify a full domain name, but you have to make sure to configure your DNS correctly. </li> <li>Only use alphanumeric characters in the secret passphrase (use at least 15 characters).</li> </ul>":"Los componentes externos a declarar: <ul> <li>Uno por línea.</li> <li>Utilice el formato «component_name:component_secret» (los espacios se recortarán).</li> <li>Puede agregar comentarios: todo lo que esté después del carácter # se eliminará y las líneas vacías se ignorarán.</li> <li>El nombre solo puede contener caracteres alfanuméricos latinos y puntos.</li> <li> Si el nombre contiene solo caracteres alfanuméricos, tendrá como sufijo el dominio XMPP. Por ejemplo, «bridge» se convertirá en «bridge.tu_dominio.tld». También puede especificar un nombre de dominio completo, pero debe asegurarse de configurar su DNS correctamente. </li> <li>Use solo caracteres alfanuméricos en la frase de contraseña secreta (use al menos 15 caracteres).</li> </ul>","Online help":"Ayuda en línea","By enabling this option, each time an anonymous user is banned from a chatroom, it's IP will also be banned from the chat server. Warning: if your instance is open to registration, any user could create a trapped-room, invite users to join, and automatically ban all anonymous user's IPs. The banned IP list is not stored, it will be cleared on server restart, or when you change some plugin's settings. The banned IP are logged in the Prosody server log files, so server's administrators can eventually use some external tools (like fail2ban) to ban IPs more widely.":"Al habilitar esta opción, cada vez que un usuario anónimo sea excluido de una sala de chat, su IP también será baneada del servidor de chat. Advertencia: si su instancia está abierta a la inscripción, cualquier usuario podría crear un chat de trampa, invitar a los usuarios a unirse y banear automáticamente todas las IP de esos usuarios anónimos. La lista de IP baneadas no se almacena, se borrará al reiniciar el servidor o cuando cambie la configuración de algún plugin. Las IP baneadas se guardan en los archivos de registro del servidor Prosody, por lo que los administradores del servidor pueden eventualmente usar algunas herramientas externas (como fail2ban) para bloquear el acceso las IP de manera más amplia.","Prosody external components network interfaces":"Interfaces de red de componentes externos de Prosody","Ban anonymous user's IP when user is banned from a chatroom":"Banear la IP del usuario si le banean de una sala de chat","<b class=\"peertube-plugin-livechat-experimental\">Experimental feature:</b> this feature is still experimental.":"<b class=\"peertube-plugin-livechat-experimental\">Característica experimental:</b>esta característica aún es experimental","<h3>Channel advanced configuration</h3> Following settings concern the advanced channel options: users will be able to add some customization on their channels, activate the moderation bot, ...":"<h3>Configuracion avanzada del canal</h3> Los parametros a continuación conciernen las opciones avanzadas del canal: los usuarios podrán añadir personalización adicional a sus canales, activar el bot de moderación, ...","You can setup here some options for this channel (moderation policies, ...).":"Puedes configurar aquí algunas opciones para este canal (políticas de moderación, ...).","You can configure some words that will be automatically moderated by the bot (messages containing such words will be instantly deleted). You can also add an optional reason that will be displayed at the place of deleted messages. Several examples are provided on the documentation page.":"Puedes configurar algunas palabras que serán moderadas automáticamente por el bot (los mensajes que contengan dichas palabras serán borrados instantáneamente). También puedes añadir una razón opcional que se mostrará en el lugar de los mensajes eliminados. Se proporcionan varios ejemplos en la página de documentación.","Disable the advanced channel configuration and the chatbot":"Desactivar la configuración avanzada del canal y el chatbot","Save":"Salvaguardar","Cancel":"Cancelar","Successfully saved":"Salvaguardado éxitosamente","Chatrooms":"Salas de chat","Configure your live's chatrooms":"Configura las salas de chat de tus directos","Here you can configure some advanced options for chatrooms associated to your live streams.":"Aquí puedes configurar algunas opciones avanzadas para salas de chat asociadas a tus retransmisiones en directo.","Please select bellow one of your channel, to setup its chatting options.":"Selecciona a continuación uno de tus canales para configurar sus opciones de chat.","Channel options":"Opciones de canal","Enable moderation bot":"Habilitar el bot de moderación","Moderation bot options":"Opciones del bot de moderación","Forbidden words or expressions":"Palabras o expresiones prohibidas","One word or expression per line. If you put multiple words on one line, it will only match messages containing the whole sequence.":"Una palabra o expresión por línea. Si pones varias palabras en una línea, solo coincidirá con los mensajes que contengan la secuencia completa.","Reason":"Motivo","Reason to display besides deleted messages":"Motivo para mostrar además de eliminar los mensajes","Consider as regular expressions":"Considéralo como expresiones regulares","By checking this option, you can use regular expressions.":"Marcando esta opción, puedes usar expresiones regulares.","Also moderate messages from moderators":"Moderar también los mensajes de los moderadores","Comments":"Comentarios","Timer":"Temporizador","You can configure several timers that will send messages at regular interval. These messages will be sent by the bot every X minutes. You can for example make the bot sent some sponsoring information every 5 minutes.":"Puedes configurar varios temporizadores que enviaran mensajes cada cierto intervalo. Estos mensages los enviara el bot cada X minutos. Puedes por ejemplo hacer que el bot muestre información de tus patrocinadores cada 5 minutos.","The message to send.":"El mensaje a enviar.","You can add here some comments about this rule, to remember how and why you created it. These comments are purely indicative, and have no influence on the bot's behavior.":"Puedes añadir aquí algunos comentarios sobre esta regla, para recordar cómo y por qué la creaste. Estos comentarios son puramente indicativos, y no influyen en el comportamiento del bot.","One message per line. If multiple messages, it will pick one randomly every X minutes.":"Un mensaje por línea. Si hay varios mensajes, se seleccionará uno al azar cada X minutos.","Send every X minutes":"Enviar cada X minutos","The bot will post the message every X minutes.":"El bot publicará el mensaje cada X minutos.","Bot command":"Comando del bot","You can configure the bot to respond to commands. A command is a message starting with a \"!\", like for example \"!help\" that calls the \"help\" command.":"Puedes configurar el bot para que responda a comandos. Un comando es un mensaje que comienza con \"!\", como por ejemplo \"!help\" que llama al comando \"help\".","Command":"Comando","The command, without the starting \"!\". For example \"help\", \"sponsor\", ...":"El comando, sin el \"!\" inicial. Por ejemplo \"ayuda\", \"patrocinador\",...","Message":"Mensaje","Messages":"Mensajes","For more information about how to configure this feature, please refer to the documentation by clicking on the help button.":"Para más información sobre cómo configurar esta funciónalidad, consulte la documentación haciendo clic en el botón de ayuda.","Banned users and patterns":"Usuarios baneados y patrones","Invalid value.":"Valor inválido.","Bot nickname":"Nick del bot","The network interfaces to listen on for external components connections.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>":"Las interfaces de red para escuchar las conexiones de componentes externos.<br> Lista de IP para escuchar, separadas por coma (se eliminarán los espacios).<br> Puede utilizar «*» para escuchar en todas las interfaces IPv4 y «::» para todas las IPv6.<br> Ejemplos: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>","Avatar set":"Conjunto de avatares","You can choose from several different sets the default avatars that will be used for chat users. Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Settings</a>.":"Puedes elegir entre varios conjuntos diferentes, los avatares predeterminados que se utilizarán para los usuarios del chat. Consulta la documentación: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/es/documentation/admin/settings/\" target=\"_blank\">Ajustes</a>.","Sepia (Peertube mascot)":"Sepia (mascota de Peertube)","Cats":"Gatos","Birds":"Pájaros","Fenecs (Mobilizon mascot)":"Fenecos (mascota de Mobilizon)","Abstract":"Abstracto","Legacy Sepia avatars (those included in previous plugin versions)":"Avatares Sepia tradicionales (incluidos en versiones anteriores del plugin)","Slow mode is enabled, users can send a message every %1$s seconds.":"Modo lento activado, los usuarios pueden enviar un mensaje cada %1$s segundos.","Slow mode":"Modo lento","Slow mode default value: <ul> <li>0: slow mode disabled</li> <li>Any positive integer: users can send a message every X seconds (moderators are not limited)</li> </ul>":"Valor del modo lento: <ul> <li>0: modo lento deshabilitado</li> <li>Cualquier número entero positivo: los usuarios pueden enviar un mensaje cada X segundos (los moderadores no están limitados)</li> </ul>","This chatroom does not exist, or is not accessible to you.":"Esta sala de chat no existe, o no esta accesible para ti.","Log in using an external account":"Iniciar sesión usando una cuenta externa","Log in using an account on another Peertube instance:":"Iniciar sesión usando una cuenta de otra instancia Peertube:","Your Peertube instance URL":"Tu URL de instancia Peertube","Searching the video on the Peertube instance...":"Buscar el vídeo en la instancia Peertube...","Invalid Peertube URL.":"URL Peertube inválida.","The livechat plugin is not installed on this Peertube instance.":"El plugin livechat no esta instalado en esta instancia.","This video is not available on this Peertube instance.":"Este vídeo no está disponible en esta instancia de Peertube.","In some cases, the video can still be retrieved if you connect to the remote instance.":"En algunos casos, el vídeo aún se puede recuperar si se conecta a la instancia remota.","Try anyway to open the video on the Peertube instance":"Intenta abrir de todas formas el video en la instancia Peertube","_language":"es"}