{"Share chat link":"Jaa linkki keskusteluun","Transparent background (for stream integration, with OBS for example)":"Läpinäkyvä tausta (striimauksen integrointiin, esimerkiksi OBS:llä)","Use current theme colors":"Käytä teeman värejä","Connect using XMPP":"Yhdistä käyttäen XMPP:tä","You can connect to the room using an external XMPP account, and your favorite XMPP client.":"Voit liittyä huoneeseen käyttämällä ulkoista XMPP-tiliä ja suosikki XMPP-asiakasohjelmaa.","You can find the plugin documentation here: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Peertube Plugin Livechat documentation </a>.":"Löydät lisäosan dokumentaation täältä: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Peertube Plugin Livechat documentation </a>.","Before asking for help, please use the diagnostic tool: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Launch diagnostic</a> (if this button is not opening a new window, please try to refresh the page).":"Ennen kuin pyydät apua, käytä diagnostiikkatyökalua: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Käynnistä diagnostiikka</a> (Jos tämä painike ei avaa uutta ikkunaa, yritä päivittää sivu).","<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">List rooms</a>":"<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">Listaa huoneet</a>","Use chat":"Käytä keskustelua","If enabled, there will be a chat next to the video.":"Jos tämä on käytössä, videon vieressä on keskustelu.","Video":"Video","Channel":"Kanava","<h3>Important notes</h3>":"<h3>Huomioitavaa</h3>","Terms & Conditions":"Käyttöehdot","These terms & conditions will be shown to all users when then join chatrooms. Streamers can also configure terms & conditions for their channels, that will be shown right after these global terms & conditions.":"Nämä käyttöehdot näytetään kaikille käyttäjille, kun he liittyvät chattihuoneisiin. Striimaajat voivat myös määrittää omat käyttöehdot kanavalleen, jotka näytetään näiden globaalien käyttöehtojen jälkeen.","Don't display remote chats":"Älä näytä etäkeskusteluja","Open chat":"Avaa keskustelu","Open chat in a new window":"Avaa keskustelu uudessa ikkunassa","Close chat":"Sulje keskustelu","Tips for streamers: To embed the chat in your video stream using OBS for example, generate a read-only link and use it as a browser source.":"Vinkkejä striimaajille: Upottaaksesi chatin videostriimiisi, esimerkiksi OBS:ssä, luo vain luku -linkki ja käytä sitä selainlähteenä.","Link copied":"Linkki kopioiotu","Generate an iframe to embed the chat in a website":"Luo iframe keskustelun upottamiseksi verkkosivulle","<h3>Chat</h3>":"<h3>Keskustelu</h3>","Chat":"Keskustelu","By checking this setting, your instance will never display chats from remote videos.":"Tämän asetuksen valitsemalla instanssisi ei koskaan näytä keskustelua etävideoista.","Show the scrollbar":"Näytä vierityspalkki","Read-only":"Vain luku","Copy":"Kopioi","Error":"Virhe","Open":"Avaa","Last activity":"Viimeksi aktiivinen","Web":"Webbi","Copied":"Kopioitu","Room name":"Huoneen nimi","List existing rooms":"Listaa olemassaolevat huoneet","Chat for live stream:":"Live striimin keskustelu:","Room description":"Huoneen kuvaus","Not found":"Ei löytynyt","Online help":"Apua online","<h3>Federation</h3> Following settings concern the federation with other Peertube instances, and other fediverse softwares.":"<h3>Federointi</h3> Seuraavat asetukset koskevat federointia muiden Peertube-instanssien ja muiden fediverse-ohjelmistojen kanssa.","_language":"fi"}