{"Open chat":"Ouvrir le salon de discussion","Open chat in a new window":"Ouvrir le salon de discussion dans une nouvelle fenêtre","Close chat":"Fermer le salon de discussion","Use chat":"Activer le salon de discussion","If enabled, there will be a chat next to the video.":"Si activé, un salon de discussion sera affiché à coté de la vidéo.","Share chat link":"Partager le lien du salon de discussion","Read-only":"Lecture seule","Show the scrollbar":"Afficher la barre de défilement","Transparent background (for stream integration, with OBS for example)":"Arrière plan transparent (pour l'intégration dans le stream, avec OBS par exemple)","Tips for streamers: To embed the chat in your video stream using OBS for example, generate a read-only link and use it as a browser source.":"Astuce pour les streamers et streameuses : pour intégrer le tchat dans votre flux en direct, en utilisant OBS par exemple, générez un lien «lecture seule» et utilisez le comme «source navigateur web».","Copy":"Copier","Link copied":"Lien copié","Error":"Erreur","Open":"Ouvrir","Use current theme colors":"Utiliser les couleurs du thème courant","Generate an iframe to embed the chat in a website":"Générer une iframe pour intégrer le tchat dans un site web","Chat for live stream:":"Tchat pour le direct :","Room name":"Nom du salon","Room description":"Description du salon","Not found":"Non trouvé","Video":"Vidéo","Channel":"Chaîne","Last activity":"Dernière activité","Web":"Web","Connect using XMPP":"Connexion avec un client XMPP","You can connect to the room using an external XMPP account, and your favorite XMPP client.":"Vous pouvez vous connecter au salon en utilisant un compte XMPP externe, et votre client XMPP favori.","<h3>Important notes</h3>":"<h3>Note importante</h3>","You can find the plugin documentation here: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Peertube Plugin Livechat documentation </a>.":"Vous pouvez trouver la documentation du plugin ici : <a href=\"https://livingston.frama.io/peertube-plugin-livechat/fr/\" target=\"_blank\"> Documentation du Plugin Peertube Livechat </a>.","Before asking for help, please use the diagnostic tool: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Launch diagnostic</a> (if this button is not opening a new window, please try to refresh the page).":"Avant de demander de l'aide, merci d'utiliser l'outil de diagnostic : <a class=\"peertube-plugin-livechat-launch-diagnostic\">Lancer le diagnostique</a> (si ce bouton n'ouvre pas une nouvelle fenêtre, merci de rafraîchir la page).","<h3>Chat</h3>":"<h3>Tchat</h3>","List existing rooms":"Lister les salons de tchat existants","<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">List rooms</a>":"<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">Lister les salons</a>","<h3>Federation</h3> Following settings concern the federation with other Peertube instances, and other fediverse softwares.":"<h3>Fédération</h3> Les paramètres ci-dessous concerne la fédération avec d'autres instances Peertube et autres logiciels du fédivers.","Don't display remote chats":"Ne pas afficher les tchats distants","By checking this setting, your instance will never display chats from remote videos.":"En cochant ce paramètre, votre instance n'affichera jamais les tchats sur les vidéos distantes.","Don't publish chat information":"Ne pas publier les informations de tchats","By checking this setting, your instance will not publish chat information on the fediverse. Remote Peertube instances will not be aware that they are chat rooms associated to your videos.<br> <b>Please note</b>: if you already had chats in progress, it is possible that the information has already been published. You will have to wait for the next video update before the information is unpublished. Also, if you disable this setting, you'll have to wait for the videos to be updated before the information are published again. This update happens among others when a live event resumes or stops.<br> <b>Please note</b>: this setting only affects the publication of information via the ActivityPub protocol. It will not prevent a remote application from otherwise detecting the presence of chats, and trying to connect to it.":"En cochant ce paramètre, votre instance ne publiera pas les informations de tchat sur le fédivers. Les instances Peertube distantes ne sauront pas qu'un tchat est associé aux vidéos.<br> <b>Attention</b> : si vous aviez déjà des tchats en cours, il est possible que les informations aient déjà été publiées. Il faudra attendre la prochaine mise à jour des vidéos pour que les informations soient dépubliées. De même, si vous désactivé ce paramètre, il faudra attendre que les vidéos soient mises à jour pour à nouveau publier les informations. Cette mise à jour intervient entre autre quand un live reprend ou s'arrête.<br> <b>Attention</b> : ce paramètre ne joue que sur la publication d'informations via le protocole ActivityPub. Il n'empêchera pas une application distante de détecter autrement la présence de tchat, et de tenter de s'y connecter.","<h3>Chat behaviour</h3>":"<h3>Comportement du tchat</h3>","Room type":"Type de salon","You can choose here to have separate rooms for each video, or to group them by channel.":"Vous pouvez choisir d'avoir des salons séparés pour chaque vidéo, ou de les grouper par chaîne.","Each video has its own webchat room":"Chaque video a son propre salon de discussion","Webchat rooms are grouped by channel":"Les salons sont regroupés par chaîne","Automatically open the chat":"Ouvrir automatiquement le tchat","When watching a video, the chatbox will automatically open.":"Quand on regarde une vidéo, le tchat va automatiquement s'ouvrir.","Show the «open in new window» button":"Montrer le bouton «ouvrir dans une nouvelle fenêtre»","There will be a button for opening the web chat in a new window.":"Il y aura un bouton pour ouvrir le tchat dans une nouvelle fenêtre.","Show the «share chat link» button":"Montrer le bouton «partager le lien du salon»","There will be a button for sharing a chat url (could be used for OBS integration, for example).":"Il y aura un bouton permettant de partager le lien vers le tchat (peut par exemple être utilisé pour l'intégration dans OBS).","Show for nobody":"Ne pas le montrer","Show for everyone":"Le montrer à tout le monde","Show for the video owner":"Le montrer au proriétaire de la vidéo","Show for the video owner and instance's moderators":"Le montrer au propriétaire de la vidéo, et aux modérateur⋅rices de l'instance","Users can activate the chat for their lives":"Les utilisateur⋅rices peuvent activer le tchat pour leurs directs","If checked, all live videos will have a checkbox in their properties for enabling the web chat.":"Si coché, il y aura pour tous les directs une case à cocher dans les propriétés qui permettra d'activer/désactiver le tchat.","<span class=\"peertube-plugin-livechat-warning\"> You have enabled the setting «Users can activate the chat for their lives». It is redundant with the «Activate chat for all lives» setting. </span>":"<span class=\"peertube-plugin-livechat-warning\"> Vous avez activé le paramètre «Les utilisateur⋅rices peuvent activer le tchat pour leurs directs». C'est redondant avec «Activer le tchat pour tous les directs». </span>","Activate chat for all lives":"Activer le tchat pour tous les directs","If checked, the chat will be enabled for all lives.":"Si coché, il y aura un tchat pour tous les directs.","Activate chat for all non-lives":"Activer le tchat pour toutes les vidéos «non-direct»","If checked, the chat will be enabled for all video that are not lives.":"Si coché, il y aura un tchat pour toutes les vidéos qui ne sont pas des directs.","Activate chat for these videos":"Activer le tchat pour ces vidéos","Videos UUIDs for which we want a web chat. Can be non-live videos. One per line. <br /> You can add comments: everything after the # character will be stripped off, and empty lines ignored.<br /> Don't add private videos, the UUIDs will be sent to the frontend.":"Mettez ici les UUIDs des vidéos pour lesquelles vous voulez forcer l'activation du tchat. Cela peut être des directs, ou non. Un UUID par ligne. <br /> Vous pouvez ajouter des commentaires : tout ce qui se trouve après le caractère # sera retiré, et les lignes vides ignorées. <br /> N'ajoutez pas de vidéos privées, les UUIDs fuiteraient.","Hide the chat for anonymous users":"Masquer les tchats pour les utilisateur⋅rices anonymes","If checked, anonymous Peertube users won't see the chat. This feature is still experimental. If you enabled it, it is highly recommended to also check \"Don't publish chat information\". Otherwise, some third party tools could try to open the chat, and have unpredictable behaviours.":"Si coché, les utilisteur⋅rices non connecté⋅es ne verront pas les tchats. Cette fonctionnalité est encore expérimentale. Si vous l'avez activée, il est hautement recommandé d'également cocher «Ne pas publier les informations de tchats». Sinon certains outils tierces ne pourraient tenter d'ouvrir le tchat, et auraient des résultats imprédictibles.","<h3>Theming</h3>":"<h3>Personnalisation des thèmes</h3>","ConverseJS theme":"Thème ConverseJS","Please choose the converseJS theme you want to use.":"Merci de choisir le thème ConverseJS que vous voulez utiliser.","Peertube theme":"Thème Peertube","Default ConverseJS theme":"Thème par défaut de ConverseJS","ConverseJS Cyberpunk theme":"Thème cyberpunk de ConverseJS","Automatic color detection":"Détection automatique des couleurs","Try to autodetect colors from user's current theme.<br> When this setting is enabled, the plugin tries to auto-detect colors to apply to the chat theme.<br> If this is not correctly working for some of your Peertube theme, you can disable this option. You can report the bug on the official <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> issue tracker </a>. Don't forget to specify which theme is not working.":"Essaie de détecter automatiquement les couleurs du thème courant de l'utilisateur⋅rice.<br> Quand ce paramètre est activé, le plugin essaie de détecter automatiquement les couleurs à appliquer au thème du tchat.<br> Si cela ne fonctionne pas correctement pour certains de vos thèmes Peertube, vous pouvez désactiver cette option. Vous pouvez rapporter les bugs sur le <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> gestionnaire de ticket </a>. N'oubliez pas de préciser pour quel thème cela ne fonctionne pas.","Webchat iframe style attribute":"Attribut de style de l'iframe du tchat","Additional styles to be added on the iframe style attribute. <br> Example: height:400px;":"Styles additionnels à appliquer sur l'iframe du tchat.<br> Exemple : height:400px;","<h3>Chat server advanced settings</h3>":"<h3>Paramètres avancés du serveur de tchat</h3>","Prosody server":"Serveur Prosody","This plugin uses the Prosody XMPP server to handle chat rooms.<br> This plugin comes with a Prosody AppImage, that will be used to run the service.":"Ce plugin utilise le serveur XMPP Prosody pour gérer les salons de discussion.<br> Ce plugin inclu une AppImage de Prosody, qui va être utilisée pour faire tourner le service.","Use system Prosody":"Utiliser le serveur Prosody installé sur le système","Warning: don't check this setting if you are not sure of what you are doing.<br> By checking this setting, your Peertube will use the Prosody server that comes with your system, and not the embedded AppImage.<br> Only use this if you encounter problems with the embedded Prosody.":"Attention : ne pas cocher ce paramètre si vous n'êtes pas sûr de ce que vous faites.<br> En cochant ce paramètre, Peertube va utiliser l'exécutable Prosody fourni par le système, et non l'AppImage intégrée.<br> N'utilisez cette option que si vous rencontrez des problèmes pour utiliser l'AppImage intégrée.","Disable Websocket":"Désactiver Websocket","With Peertube &gt;= 5.0.0, this plugin try to use Websocket connection for chatting. If the user's browser or connection is incompatible, the browser will automatically fall back on the BOSH protocol. <br> But in rare case, this can fail. For example, if you have a reverse proxy in front of Peertube that does not allow Websocket connection for plugins. In this case, you can check this setting to disable Websocket connections.":"Avec Peertube &gt;= 5.0.0, ce plugin va essayer d'utiliser Websocket pour les connexions au tchat. Si le navigateur de l'utilisateur⋅rice ou sa connexion n'est pas compatible, le navigateur va automatiquement passer au protocole BOSH. <br> Mais, dans de rare cas, cela pourrait échouer. Par exemple si vous avez un reverse proxy devant votre Peertube qui ne permettrait pas les connexions Websocket. Dans ce cas, vous pouvez cocher cette option pour désactiver les connexions Websocket.","Prosody port":"Port Prosody","The port that will be used by the Prosody server.<br> Change it if this port is already in use on your server.<br> You can close this port on your firewall, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"Le port qui va être utilisé par le serveur Prosody.<br> Changez-le si ce port est déjà utilisé sur votre serveur.<br> Vous pouvez fermer ce port sur votre pare-feu, il ne sera pas accédé par le monde extérieur.<br> Note : cela pourrait changer dans un futur proche, car il est prévu d'ajouter des paramètres pour autoriser les connexions externes.","Peertube url for API calls":"Url Peertube pour les appels d'API","Please let this setting empty if you don't know what you are doing.<br> In some rare cases, Prosody can't call Peertube's API from its public URI. You can use this field to customize Peertube's URI for Prosody modules (for example, with «http://localhost:9000» or «http://127.0.0.1:9000»).":"Merci de ne pas toucher à ce paramètre si vous ne savez pas ce que vous faites.<br> Dans de rare cas, le serveur Prosody ne peut appeler l'API de Peertube en utilisant l'url publique. Vous pouvez utiliser ce paramètre pour personnaliser l'url que les modules Prosody utiliseront pour les API Peertube (par exemple, en mettant «http://localhost:9000» ou «http://127.0.0.1:9000»).","Log rooms content by default":"Enregistrer les salons par défaut","If checked, room contents will be saved by default. Any user who joins a room will see what was written before they joins.<br> Please note that it is always possible to enable/disable the content archiving for a specific room, by editing its properties.":"Si coché, le contenu des salons sera enregistré par défaut. Quand un⋅e utilisateur⋅rice rejoint un salon, iel pourra voir ce qui a été dit avant.<br> À noter qu'il est toujours possible d'activer/désactiver cette fonctionnalité pour un salon spécifique, en changeant ses paramètres.","Room logs expiration":"Expiration des journaux de salon","You can choose here how long the chatting room's content is kept by the server. The value can be: <ul> <li><b>60</b>: the content will be saved for 60 <b>seconds</b>. You can replace 60 by any integer value.</li> <li><b>1d</b>: the content will be saved for 1 <b>day</b>. You can replace 1 by any integer value.</li> <li><b>1w</b>: the content will be saved for 1 <b>week</b>. You can replace 1 by any integer value.</li> <li><b>1m</b>: the content will be saved for 1 <b>month</b>. You can replace 1 by any integer value.</li> <li><b>1y</b>: the content will be saved for 1 <b>year</b>. You can replace 1 by any integer value.</li> <li><b>never</b>: the content will never expire, and will be kept forever.</li> </ul>":"Vous pouvez choisir combien de temps le contenu des salons est gardé sur le serveur. La valeur peut être : <ul> <li><b>60</b> : le contenu sera sauvegardé pour 60 <b>secondes</b>. Vous pouvez remplacer 60 par n'importe quelle valeur entière.</li> <li><b>1d</b> : le contenu sera sauvegardé pour 1 <b>jour</b>. Vous pouvez remplacer 1 par n'importe quelle valeur entière.</li> <li><b>1w</b> : le contenu sera sauvegardé pour 1 <b>semaine</b>. Vous pouvez remplacer 1 par n'importe quelle valeur entière.</li> <li><b>1m</b> : le contenu sera sauvegardé pour 1 <b>mois</b>. Vous pouvez remplacer 1 par n'importe quelle valeur entière.</li> <li><b>1y</b> : le contenu sera sauvegardé pour 1 <b>année</b>. Vous pouvez remplacer 1 par n'importe quelle valeur entière.</li> <li><b>never</b> : le contenu ne sera jamais effacé.</li> </ul>","Enable connection to room using external XMPP accounts":"Autoriser les connexions aux salons via des comptes XMPP externes","By enabling this option, it will be possible to connect to rooms using external XMPP accounts and XMPP clients.<br> <span class=\"peertube-plugin-livechat-warning\"> <b>Warning</b>, enabling this option can request extra server and DNS configuration. </span> Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/advanced/xmpp_clients/\" target=\"_blank\"> Enable external XMPP account connections. </a>":"En activant cette option, il sera possible de se connecter aux salons en utilisant des comptes XMPP externes via des clients XMPP.<br> <span class=\"peertube-plugin-livechat-warning\"> Attention, activer cette option peut demander une configuration au niveau du serveur et des enregistrements DNS. </span> Pour en savoir plus, merci de vous référer à la documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/fr/documentation/admin/advanced/xmpp_clients/\" target=\"_blank\"> Autoriser les connexions avec des comptes XMPP externes. </a>","Prosody server to server port":"Port Prosody serveur vers serveur","The port that will be used for XMPP s2s (server to server) connections.<br> You should use the standard 5269 port. Otherwise you should <a href=\"https://prosody.im/doc/s2s\"> setup a specific DNS record </a>.":"Le port à utiliser pour les connexions XMPP s2s (server to server).<br> Il est recommandé d'utiliser le port standard 5269. Sinon vous devrez <a href=\"https://prosody.im/doc/s2s\"> configurer un enregistrement DNS spécifique </a>.","Server to server network interfaces":"Interfaces réseau pour les connexions serveur vers serveur","The network interfaces to listen on for server to server connections.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>":"Les interfaces réseau sur lesquelles écouter pour les connexions s2s (server to server).<br> Une liste d'IP séparées par des virgules (les espaces seront retirés). On pourra utiliser «*» pour écouter sur toutes les IPv4, et «::» pour toutes les IPv6.<br> Exemples de configuration possible: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>","Certificates folder":"Dossiers des certificats","If this field is empty, the plugin will generate and use self-signed certificates.<br> If you want to use other certificates, just specify here the folder where Prosody can find them. Note: the \"peertube\" user must have read access to this folder.":"Si ce champ est vide, le plugin va générer et utiliser des certificats auto-signés.<br> Si vous voulez utiliser d'autres certificats, vous avez juste à spécifier ici le dossier où Prosody peut les trouver. Note : l'utilisateur «peertube» doit avoir un accès en lecture à ce dossier.","Enable client to server connections":"Activer les connexions client vers serveur","Enable XMPP clients to connect to the built-in Prosody server.<br> This option alone only allows connections from localhost clients.":"Autoriser les clients XMPP à se connecter au serveur Prosody.<br> Cette option seule n'autorise que les connexions de clients sur le localhost.","Prosody client to server port":"Port Prosody client vers serveur","The port that will be used by the c2s module of the built-in Prosody server.<br> XMPP clients shall use this port to connect.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall for now, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"Le port à utiliser pour les connexions XMPP c2s (client to server).<br> Les clients XMPP devront utiliser ce port pour se connecter.<br> Changez ce port si le port est déjà utilisé sur votre serveur.<br> Pour l'instant, vous pouvez garder ce port fermé sur votre pare-feu, il sera inaccessible depuis l'extérieur (Prosody n'écoute que le localhost).<br> Note : cela pourrait prochainement changer, car il est prévu d'ajouter une fonction permettant d'activer les connexions externes.","Enable custom Prosody external components":"Activer les composants externes personnalisés Prosody","Enable the use of external XMPP components.<br> This option alone only allows connections from localhost. You have to setup the listening interfaces and open the port on your firewall to make it available from remote servers.<br> This feature can, for example, be used to connect some bots to the chatting rooms.":"Pour permettre l'utilisation de composants XMPP externes.<br> Cette option seule n'autorise que les connexions depuis le localhost.<br> Vous devez configurer les interfaces sur lesquelles écouter et ouvrir les ports sur votre pare-feu pour rendre cela disponible à des serveurs distants.<br> Cette fonctionnalité peut, par exemple, être utilisée pour connecter des bots aux salons.","Prosody external components port":"Port pour les composants externe Prosody","The port that will be used by XMPP components to connect to the Prosody server.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall if you don't allow access on interfaces other than localhost.":"Le port à utiliser pour les XMPP components.<br> Changez ce port s'il est déjà utilisé sur votre serveur.<br> Vous pouvez garder ce port fermé sur votre pare-feu si vous n'autorisez pas l'accès sur les interfaces autre que localhost.","External components":"Composants externes","The external components to declare: <ul> <li>One per line.</li> <li>Use the format «component_name:component_secret» (spaces will be trimmed).</li> <li>You can add comments: everything after the # character will be stripped off, and empty lines ignored.</li> <li>The name can only contain latin alphanumeric characters and dots.</li> <li> If the name contains only alphanumeric characters, it will be suffixed with the XMPP domain. For example, «bridge» will become «bridge.your_domain.tld». You can also specify a full domain name, but you have to make sure to configure your DNS correctly. </li> <li>Only use alphanumeric characters in the secret passphrase (use at least 15 characters).</li> </ul>":"Les composants externes à déclarer : <ul> <li>Un par ligne.</li> <li>Utilisez le format «nom_du_composant:passphrase_secrete» (les espaces seront retirés).</li> <li>Vous pouvez ajouter des commentaires: tout ce qui se trouve après un caractère # sera retiré, et les lignes vides ignorées. </li> <li>Le nom ne peut contenir que des caractères alphanumériques latins et des points.</li> <li> Si le nom ne contient que des caractères alphanumériques, il sera suffixé avec le domaine XMPP. Par exemple, «bridge» deviendra «bridge.votre_domaine.tld». Vous pouvez aussi spécifier un nom de domaine complet, mais vous devrez vous assurer que votre configuration DNS est correcte. </li> <li>N'utilisez que des caractères alphanumériques dans la passphrase secrète (utilisez au moins 15 caractères).</li> </ul>","Online help":"Aide en ligne","Prosody external components network interfaces":"Interfaces réseau pour les composants Prosody externes","The network interfaces to listen on for external components connections.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>":"Les interfaces réseau sur lesquelles écouter pour les composants externes.<br> Une liste d'IP séparées par des virgules (les espaces seront retirés). On pourra utiliser «*» pour écouter sur toutes les IPv4, et «::» pour toutes les IPv6.<br> Exemples : <ul> <li>*,::</li> <li>*</li> <li>127.0.0.1,::1</li> <li>172.18.0.42</li> </ul>","<b class=\"peertube-plugin-livechat-experimental\">Experimental feature:</b> this feature is still experimental.":"<b class=\"peertube-plugin-livechat-experimental\">Fonction expérimentale :</b> cette fonctionnalité est encore expérimentale.","Disable the advanced channel configuration and the chatbot":"Désactiver la configuration avancée des chaînes et le bot de modération","Save":"Enregistrer","Cancel":"Annuler","Successfully saved":"Sauvegarde effectuée","Chatrooms":"Salons de discussion","Configure your live's chatrooms":"Configurez vos salons de discussions","Here you can configure some advanced options for chatrooms associated to your live streams.":"Vous pouvez configurer ici quelques options avancées pour les salons de discussion associés à vos flux en direct.","Please select bellow one of your channel, to setup its chatting options.":"Veuillez sélectionner ci-dessous l'une de vos chaîne, pour configurer ses options de tchat.","Channel options":"Options de la chaîne","You can setup here some options for this channel (moderation policies, ...).":"Vous pouvez configurer ici quelques options pour cette chaîne (politiques de modération, ...).","Enable moderation bot":"Activer le bot de modération","Moderation bot options":"Options du bot de modération","Forbidden words or expressions":"Mots ou expressions interdites","One word or expression per line. If you put multiple words on one line, it will only match messages containing the whole sequence.":"Un mot ou une expression par ligne. Si vous mettez plusieurs mots sur une même ligne, seuls les messages contenant la séquence entière seront supprimés.","Reason":"Raison","Reason to display besides deleted messages":"Raison à affiche à côté des messages supprimés","Consider as regular expressions":"Considérer comme une expression régulière","By checking this option, you can use regular expressions.":"En cochant cette option, vous pouvez utiliser des expressions régulières.","Also moderate messages from moderators":"Également modérer les messages des modérateur⋅rices","Timer":"Timer","You can configure several timers that will send messages at regular interval. These messages will be sent by the bot every X minutes. You can for example make the bot sent some sponsoring information every 5 minutes.":"Vous pouvez configurer quelques timers qui enverront des messages à intervalle régulier. Ces messages seront envoyés par le bot toutes les X minutes. Vous pouvez par exemple faire en sorte que le bot envoie des informations de sponsoring toutes les 5 minutes.","One message per line. If multiple messages, it will pick one randomly every X minutes.":"Un message par ligne. S'il y a plusieurs messages, le bot en choisira un aléatoirement toutes les X minutes.","Send every X minutes":"Envoyer toutes les X minutes","The bot will post the message every X minutes.":"Le bot enverra les messages toutes les X minutes","Bot command":"Commande du bot","Command":"Commande","The command, without the starting \"!\". For example \"help\", \"sponsor\", ...":"La commande, sans le \"!\" au début. Par exemple \"help\", \"sponsor\", ...","Message":"Message","The message to send.":"Le message à envoyer.","Banned users and patterns":"Motifs d'utilisateur⋅rices banni⋅es","Bot nickname":"Pseudonyme du bot","<h3>Channel advanced configuration</h3> Following settings concern the advanced channel options: users will be able to add some customization on their channels, activate the moderation bot, ...":"<h3>Configuration avancée de la chaîne</h3> Les paramètres suivants concernant les options avancées de la chaîne : les utilisateur⋅rices pourrons personnaliser certaines options pour les chaînes, activer le bot de modération, ...","You can configure some words that will be automatically moderated by the bot (messages containing such words will be instantly deleted). You can also add an optional reason that will be displayed at the place of deleted messages. Several examples are provided on the documentation page.":"Vous pouvez configurer quelques mots qui seront automatiquement modérés par le bot (les messages contenant de tels mots seront instantanément supprimés). Vous pouvez aussi ajouter une raison optionnelle, qui sera affichée à la place des messages supprimés. Quelques exemples de configuration sont fournis sur la page de documentation.","By default, moderator messages will not be affected by this feature. By checking this option, messages from moderators will also be deleted.":"Par défaut, les messages des modérateur⋅rices ne seront pas affectés par cette fonctionnalité. En cochant cette option, leur messages seront également supprimés.","You can configure the bot to respond to commands. A command is a message starting with a \"!\", like for example \"!help\" that calls the \"help\" command.":"Vous pouvez configurer le bot pour répondre à des commandes. Une commande est un message qui commence par un \"!\", comme par exemple \"!help\" qui appellera la commande \"help\".","For more information about how to configure this feature, please refer to the documentation by clicking on the help button.":"Pour plus d'information sur comment configurer cette fonctionnalité, merci de vous référer à la documentation en cliquant sur le bouton d'aide.","Ban anonymous user's IP when user is banned from a chatroom":"Bannir l'IP des utilisateur⋅rices anonymes, quand iels sont banni⋅es des salons","Invalid value.":"Valeur invalide.","Comments":"Commentaires","You can add here some comments about this rule, to remember how and why you created it. These comments are purely indicative, and have no influence on the bot's behavior.":"Vous pouvez ajouter ici quelques commentaires sur cette règle, pour vous rappeler comment et pourquoi vous l'avez créé. Ces commentaires sont purement indicatifs, et n'ont pas d'influence sur le comportement du bot.","By enabling this option, each time an anonymous user is banned from a chatroom, it's IP will also be banned from the chat server. Warning: if your instance is open to registration, any user could create a trapped-room, invite users to join, and automatically ban all anonymous user's IPs. The banned IP list is not stored, it will be cleared on server restart, or when you change some plugin's settings. The banned IP are logged in the Prosody server log files, so server's administrators can eventually use some external tools (like fail2ban) to ban IPs more widely.":"En activant cette option, à chaque fois qu'un⋅e utilisateur⋅rice anonyme est banni⋅e d'un salon, son IP sera également bannie du serveur de tchat. Attention : si votre instance est ouverte aux inscriptions, un⋅e utilisateur⋅rice pourrait créer un salon piégé, y inviter des personnes, et automatiquement bannir les IPs des utilisateur⋅rices anonymes. La liste des IPs bannie n'est pas enregistrée, et sera effacée au redémarrage du serveur, ou si vous changez certains paramètres du plugin. Les IPs bannies sont journalisées dans les journaux du serveur Prosody, donc les admins du serveur peuvent éventuellement utiliser des outils externes (comme par exemple fail2ban) pour bannir les IPs plus largement.","Messages":"Messages","Sepia (Peertube mascot)":"Sepia (mascotte Peertube)","Cats":"Chats","Birds":"Oiseaux","Fenecs (Mobilizon mascot)":"Fennecs (mascotte Mobilizon)","Legacy Sepia avatars (those included in previous plugin versions)":"Anciens avatars Sepia (ceux inclus dans les versions précédentes du plugin)","Avatar set":"Jeu d'avatars","You can choose from several different sets the default avatars that will be used for chat users. Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Settings</a>.":"Vous pouvez choisir parmi plusieurs jeux différents les avatars par défaut qui seront utilisés pour les utilisateurs du tchat. Veuillez vous référer à la documentation : <a href=\"https://livingston.frama.io/peertube-plugin-livechat/fr/documentation/admin/settings/\" target=\"_blank\">Paramètres</a>.","Abstract":"Abstrait","Slow mode":"Mode lent","Slow mode is enabled, users can send a message every %1$s seconds.":"Le mode lent est activé, les utilisateur⋅rices peuvent envoyer un message toutes les %1$s secondes.","Slow mode default value: <ul> <li>0: slow mode disabled</li> <li>Any positive integer: users can send a message every X seconds (moderators are not limited)</li> </ul>":"Valeur par défaut du mode lent : <ul> <li>0 : mode lent désactivé</li> <li>Tout entier positif : les utilisateur⋅rices peuvent envoyer un message toutes les X secondes (les modérateur⋅rices ne sont pas limité⋅es)</li> </ul>","This chatroom does not exist, or is not accessible to you.":"Ce salon de discussion n'existe pas, ou ne vous est pas accessible.","In some cases, the video can still be retrieved if you connect to the remote instance.":"Dans certains cas, la vidéo peut quand même être récupérée si vous vous connectez sur l'instance distante.","Log in using an external account":"Se connecter avec un compte externe","Searching the video on the Peertube instance...":"Recherche de la vidéo sur l'instance Peertube...","Log in using an account on another Peertube instance:":"Se connecter en utilisant un compte sur une autre instance Peertube :","Your Peertube instance URL":"L'URL de votre instance Peertube","Invalid Peertube URL.":"URL Peertube invalide.","The livechat plugin is not installed on this Peertube instance.":"Le plugin livechat n'est pas installé sur cette instance Peertube.","This video is not available on this Peertube instance.":"Cette vidéo n'est pas disponible sur cette instance Peertube.","Try anyway to open the video on the Peertube instance":"Essayer quand-même d'ouvrir la vidéo sur l'instance Peertube","<h4>OpenID Connect</h4>":"<h4>OpenID Connect</h4>","Use an OpenID Connect provider":"Utiliser un fournisseur OpenID Connect","Discovery URL":"URL de découverte (Discovery URL)","Enabling this adds a \"login with Google\" button. You have to configure a Google OAuth application.":"Activer cette option ajoute un bouton «se connecter avec Google». Vous devez configurer une application OAuth Google.","<h3>External authentication</h3> For users that have no Peertube account, you can enable various authentication modes based on remote authentication providers.":"<h3>Authentification externe</h3> Pour les utilisateur⋅rices qui n'ont pas de compte Peertube, vous pouvez activer diverses méthodes d'authentification basées sur des fournisseurs d'identité externes.","You can configure an external OpenID Connect provider that could be used to log in to the chat. Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Settings</a>.":"Vous pouvez configurer un fournisseur OpenID Connect externe, qui pourra être utilisé pour se connecter au tchat. Veuillez vous référer à la documentation : <a href=\"https://livingston.frama.io/peertube-plugin-livechat/fr/documentation/admin/settings/\" target=\"_blank\">Paramètres</a>.","Client ID":"ID Client (Client ID)","Client secret":"Secret client (Client Secret)","<strong>Callback/Redirect URI:</strong> If you want to configure authorized redirection URI on the external Application, please add this url:":"<strong>URL de retour :</strong> Si vous voulez configurer les URL de retour autorisées pour l'application externe, veuillez ajouter cette url :","Use Google":"Utiliser Google","Use Facebook":"Utiliser Facebook","Enabling this adds a \"login with Facebook\" button. You have to configure a Facebook OAuth application.":"Activer cette option ajoute un bouton «se connecter avec Facebook». Vous devez configurer une application OAuth Facebook.","Authentication failed":"Échec de l'authentification","Label for the connection button":"Libellé pour le bouton de connexion","This label will be displayed to users, as the button label to authenticate with this OIDC provider.":"Ce libellé va être affiché aux utilisateur⋅rices, en tant que libellé du bouton de connection OIDC.","Error when saving the task list":"Erreur à l'enregistrement de la liste de tâche","Delete task list":"Supprimer la liste de tâches","Task list name":"Nom de la liste de tâches","Create a new task":"Créer une nouvelle tâche","Task name":"Nom de la tâche","Description":"Description","Delete task":"Supprimer la tâche","Please choose a task list":"Veuillez sélectionner une liste de tâches","Your browser has blocked the opening on the remote instance, please try to open manually this link:":"Votre navigateur a bloqué l'ouverture sur l'instance distante, veuillez essayer d'ouvrir manuellement ce lien :","Tasks":"Tâches","Are you sure you want to delete this task?":"Êtes-vous sûr de vouloir supprimer cette tâche ?","There is no task list for now, please first create one":"Il n'y a pas de liste de tâches pour l'instant, veuillez d'abord en créer une","Create new task list:":"Créer une nouvelle liste de tâches :","Are you sure you want to delete this task list?":"Êtes-vous sûr de vouloir supprimer cette liste de tâches ?","Once you have chosen a task list, a new task will be created. To see the task, open the task application using the top menu. More information in the livechat plugin documentation.":"Une fois que vous aurez sélectionné une liste de tâches, une nouvelle tâche sera créée. Pour visualiser la tâche, ouvrez l'application tâche en utilisant le menu du haut. Plus d'informations dans la documentation du module livechat.","Become moderator":"Devenir modérateur⋅rice","Client to server network interfaces":"Interfaces réseau client vers serveur","The network interfaces to listen on for client to server connections.<br> This setting is provided for advanced users. Don't change this setting if you don't fully understand what it means.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>127.0.0.1, ::1, 172.18.0.42</li> </ul>":"Les interfaces réseau sur lesquelles écouter pour les connexions c2s (client to server).<br> Ce paramètre est fourni pour les utilisateur⋅ices avancé⋅es. Ne changez pas ce paramètre si vous ne comprenez pas entièrement ce que cela signifie.<br< Une liste d'IP séparées par des virgules (les espaces seront retirés). On pourra utiliser «*» pour écouter sur toutes les IPv4, et «::» pour toutes les IPv6.<br> Exemples de configuration possible: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>127.0.0.1, ::1, 172.18.0.42</li> </ul>","Label":"Libellé","Label for this forbidden words rule":"Libellé pour cette règle de mots interdits","Value is of the wrong type.":"La valeur n'est pas du bon type.","Value is in the wrong format.":"Le format de la valeur n'est pas correct.","Value is not in authorized range.":"La valeur n'est pas dans la plage autorisée.","You can configure custom emojis for your channel. These emojis will be available in the emoji picker. Users can also use them by with their short name (for example by writing \":shortname:\").":"Vous pouvez configurer des émojis personnalisés pour votre chaîne. Ces émojis seront disponibles dans le sélecteur d’émojis. Les utilisateurs peuvent également les utiliser avec leur nom court (par exemple en écrivant \":nom_court:\").","There was an error during validation.":"Il y a eu une erreur lors de la validation.","This value is required.":"Cette valeur est obligatoire.","File size is too big (max size: %s).":"La taille du fichier est trop grande (taille maximum: %s).","Duplicate value":"Valeur en double","Channel emojis":"Émojis de la chaîne","Short name":"Nom court","You can use emojis in the chat using \":shortname:\". The short name can start and/or end by a colon (:), and only contain alphanumerical characters, underscores and hyphens. It is strongly recommended to start them by a colon, so that users can use autocompletion (by typing \":\" then press TAB).":"Vous pouvez utiliser l'émojis dans le tchat en utilisant \":nom_court:\". Le nom court peut commencer et/ou finir par des deux-points (:), et seulement contenir des caractères alphanumériques des underscores et des tirets. Il est fortement recommandé de les commencer par des deux-points, pour que les utilisateur⋅rices puissent utiliser l'autocomplétion (en tapant \":\" puis en pressant TABULATION).","File":"Fichier","The emoji file.":"Le fichier de l'émoji.","Export":"Exporter","If imported data are okay, don't forgot to save the form.":"Si les données importées sont correctes, n'oubliez pas de sauvegarder le formulaire.","Import":"Importer","Copied":"Copié","Remove this entry":"Supprimer cette entrée","Are you sure you want to remove this entry?":"Êtes-vous sûr de vouloir supprimer cette entrée ?","An error occured while loading data.":"Une erreur s'est produite lors du chargement des données.","Add an entry":"Ajouter une entrée","Embed":"Intégration","This link will open the chat within the Peertube interface.":"Ce lien ouvrira le tchat dans l'interface Peertube.","Dock":"Dock","Password token":"Jeton","Create a new token":"Créer un nouveau jeton","Revoke the token":"Révoquer le jeton","Token generated from the web interface":"Jeton généré à partir de l'interface web","Are you sure you want to revoke this token?":"Êtes-vous sûr de vouloir révoquer ce jeton ?","<h3>Authentication</h3>":"<h3>Authentification</h3>","Disable livechat tokens":"Désactiver les jetons livechat","You can generate a link that will open the chat in full page, logged in with your Peertube account. This can be use, for example, to have a web dock in your OBS, so you can read and interact with the chat directly from OBS. Don't share this link to anyone, as it would allow them to connect as yourself. Please find bellow the list of authentication token you have already generated. You can create a new one, or revoke any previous token. Please note that these tokens have no expiration date.":"Vous pouvez générer un lien qui ouvrira le tchat en pleine page, en vous connectant avec votre compte Peertube. Cela peut être utilisé, par exemple, pour avoir un dock web dans votre OBS, de sorte que vous pouvez lire et interagir avec le chat directement à partir d'OBS. Ne partagez pas ce lien avec qui que ce soit, car il leur permettrait de se connecter en votre nom. Vous trouverez ci-dessous la liste des jetons d'authentification que vous avez déjà générés. Vous pouvez en créer un nouveau ou révoquer un jeton précédent. Veuillez noter que ces jetons n'ont pas de date d'expiration.","Users can generate long term tokens to connect to the chat. These tokens can for example be used to include the chat in OBS web docks. Check <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/user/obs\" target=\"_blank\">the documentation</a> for more information. You can disable this feature by checking this setting.":"Les utilisateur⋅rices peuvent générer des jetons à long terme pour se connecter au tchat. Ces jetons peuvent par exemple être utilisés pour inclure le tchat dans les docks web dans OBS. Consultez <a href=\"https://livingston.frama.io/peertube-plugin-livechat/fr/documentation/user/obs\" target=\"_blank\">la documentation</a> pour plus d'informations. Vous pouvez désactiver cette fonctionnalité en cochant ce paramètre.","Too many entries":"Trop d'entrées","Default value for new chatrooms. For existing chatrooms, you can change the feature in the room configuration form. When this feature is enabled, anonymous users can only read the chat, and not send messages.":"Valeur par défaut pour les nouveaux salons de discussion. Pour les salons existants, vous pouvez changer la fonctionnalité via le formulaire de configuration du salon. Quand la fonctionnalité est active, les utilisateur⋅rices anonymes ne peuvent que lire le tchat, et ne peuvent pas envoyer de messages.","Mute anonymous users":"Silencier les utilisateur⋅rices anonymes","Only registered users can send messages.":"Seuls les utilisateur⋅rices enregistré⋅es peuvent envoyer des messages.","Date":"Date","Terms & Conditions":"Conditions d'utilisation","Value too long":"Valeur trop longue","These terms & conditions will be shown to all users when then join chatrooms. Streamers can also configure terms & conditions for their channels, that will be shown right after these global terms & conditions.":"Ces conditions d'utilisation seront affichées à tous les utilisateur⋅rices lorsqu'iels rejoindront les salons de discussion. Les streameur⋅euses peuvent également configurer des conditions d'utilisation pour leurs canaux, qui seront affichées juste après les conditions de l'instance.","Channel's chat terms & conditions":"Conditions d'utilisation du tchat de la chaîne","You can configure a \"terms & conditions\" message that will be shown to users joining your chatrooms.":"Vous pouvez configurer un message de \"conditions d'utilisation\" qui sera affiché aux utilisateur⋅rices qui rejoignent vos salons de discussion.","Create a new poll":"Créer un nouveau sondage","New poll":"Nouveau sondage","Complete and submit this form to create a new poll. This will end and replace any existing poll.":"Complétez et soumettez ce formulaire pour créer un nouveau sondage. Ceci mettra fin au sondage précédent le cas échéant.","Question":"Question","Poll duration (in minutes)":"Durée du sondage (en minutes)","Anonymous results":"Résultats anonymes","Choice {{N}}:":"Choix {{N}} :","Poll ends at:":"Fin du sondage :","To vote, click on your choice or send a message with an exclamation mark followed by your choice number (Example: !1).":"Pour voter, cliquez sur votre choix, ou envoyez un message avec un point d'exclamation suivi de votre choix (Exemple: !1).","This poll is now over.":"Ce sondage est à présent terminé.","This choice is not valid.":"Ce choix n'est pas valide.","Your vote is taken into account. Votes are anonymous, they will not be shown to other participants.":"Votre vote a été pris en compte. Les votes sont anonymes, ils ne seront pas montrés aux autres participant⋅es.","Your vote has been taking into account, the counters will be updated in a moment.":"Votre vote a été pris en compte, les compteurs seront mis à jour dans un instant.","Send a message with an exclamation mark followed by your choice number to vote. Example: !1":"Envoyez un message avec un point d'exclamation suivi du numéro de votre choix pour voter. Exemple : !1","Poll":"Sondage","Moderation delay default value: <ul> <li>0: moderation delay disabled</li> <li>Any positive integer: messages will be delayed for X seconds for non-moderator participants, allowing moderators to delete message before any user can read it.</li> </ul>":"Valeur par défaut du délai de modération : <ul> <li>0 : délai de modération désactivé</li> <li>Tout nombre entier positif : les messages seront retardés de X secondes pour les participant⋅es non modérateur⋅rices, ce qui permet à ces derniers de supprimer les messages avant qu'un utilisateur⋅rice ne puisse le lire.</li> </ul>","Moderation delay":"Délai de modération","None":"Aucun","Anonymize moderation actions":"Anonymiser les actions de modération","Anonymize moderation actions default value for new rooms. When this is enabled, moderation actions will be anonymized, to avoid disclosing who is banning/kicking/… occupants.":"Anonymiser les actions de modération : valeur par défaut pour les nouveaux salons. Lorsque cette option est activée, les actions de modération sont rendues anonymes, afin d'éviter de révéler qui bannit/expulse/... les occupants.","Error when saving the note":"Erreur lors de l'enregistrement de la note","Delete note":"Supprimer la note","Are you sure you want to delete this note?":"Êtes-vous sûr de vouloir supprimer cette note ?","Search notes":"Recherche de notes","Search filters":"Filtres de recherche","Nickname of the participant at the time of the note creation":"Pseudonyme du participant⋅e au moment de la création de la note","Create a new note":"Créer une nouvelle note","Moderation notes":"Notes de modération","Message search":"Recherche de messages","Search all messages":"Rechercher tous les messages","Nickname of the participant when the message was sent":"Pseudonyme du participant⋅e au moment de l'envoi du message","<a class=\"peertube-button-link orange-button secondary-button\" href=\"/p/livechat/admin/firewall\" target=\"_blank\">Configure mod_firewall</a>":"<a class=\"peertube-button-link orange-button secondary-button\" href=\"/p/livechat/admin/firewall\" target=\"_blank\">Configurer mod_firewall</a>","Prosody mod_firewall configuration":"Configuration de mod_firewall pour Prosody","Enable Prosody mod_firewall":"Activer mod_firewall pour Prosody","You can enable <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a> on your Prosody server. For more information, please check <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/mod_firewall/\" target=\"_blank\">the documentation</a>.":"Vous pouvez activer <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a> sur votre serveur Prosody. Pour plus d'informations, veuillez consulter <a href=\"https://livingston.frama.io/peertube-plugin-livechat/fr/documentation/admin/mod_firewall/\" target=\"_blank\">la documentation</a>.","Here you can configure Prosody <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a> module. You can create multiple configuration files bellow, and change their order. Don't hesitate to share your configurations with the community (for example by adding some examples in the plugin documentation).":"Ici vous pouvez configurer le module Prosody <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a>. Vous pouvez créer plusieurs fichiers de configuration ci-dessous, et changer leur ordre. N'hésitez pas à partager vos configurations avec la communauté (par exemple en ajoutant des exemples dans la documentation du plugin).","Warning: mod_firewall is disabled in the livechat <a href=\"/admin/plugins/show/peertube-plugin-livechat\" target=\"_blank\">plugin settings</a>, you have to enable it if you want this configuration to be taken into account.":"Attention : mod_firewall est désactivé dans les <a href=\"/admin/plugins/show/peertube-plugin-livechat\" target=\"_blank\">paramètres du plugin livechat</a> , vous devez l'activer si vous voulez que cette configuration soit prise en compte.","Enabled":"Activé","Name":"Nom","Can only contain: alphanumerical characters, underscores and hyphens. Scripts will be loaded in alphabetical order.":"Ne peut contenir que des caractères alphanumériques, des traits de soulignement et des traits d'union. Les scripts seront chargés par ordre alphabétique.","File content":"Contenu du fichier","Chat":"Tchat","This feature comes with the livechat plugin version X.X.X.":"Cette fonctionnalité arrive avec le plugin livechat version X.X.X.","Emojis only mode":"Mode Émojis Uniquement","To enable or disable this mode, you can use the room configuration form. If you want to enable it for all your chatrooms at once, you can use the button bellow.":"Pour activer ou désactiver ce mode, vous pouvez utiliser le formulaire de configuration du salon. Si vous souhaitez l'activer pour tous vos salons de discussion en même temps, vous pouvez utiliser le bouton ci-dessous.","Forbid special characters":"Interdire les caractères spéciaux","By enabling this option, the moderation bot will automatically delete messages containing more than X special characters. Special characters are those that don't fit into one of these categories: letters, numbers, punctuation symbols, currency symbols, emojis.":"En activant cette option, le robot de modération supprimera automatiquement les messages contenant plus de X caractères spéciaux. Les caractères spéciaux sont ceux qui n'entrent pas dans l'une de ces catégories : lettres, chiffres, symboles de ponctuation, symboles monétaires, émojis.","Number of special characters to accept in a message without deleting it.":"Nombre de caractères spéciaux à accepter dans un message avant de le supprimer.","Tolerance":"Tolérance","Time interval":"Intervalle de temps","The interval, in seconds, during which a user can't send again the same message.":"Intervalle, en secondes, pendant lequel un⋅e utilisateur⋅rice ne peut pas renvoyer le même message.","Emoji only mode is enabled, you can only use emoji in your messages.":"Le mode Émoji Uniquement est activé, vous ne pouvez utiliser que des émoji dans vos messages.","You can enable an \"Emojy only mode\" in your chatrooms. When this mode is enabled, participants can only send emojis (standard, or channel custom emojis). Moderators are not affected by this limitation.":"Vous pouvez activer un mode \"Émoji Uniquement\" dans vos salons de discussion. Lorsque ce mode est activé, les participant⋅es ne peuvent envoyer que des émojis (standards ou émojis personnalisés de votre chaîne). Les modérateur⋅rices ne sont pas concerné⋅es par cette limitation.","This mode can be usefull for example: <ul> <li>To avoid spam or offensive message when you are not here to moderate.</li> <li>When there are too many speaking participants, and you can't no more moderate correctly.</li> </ul>":"Ce mode peut être utile par exemple : <ul> <li>Pour éviter le spam ou les messages offensants lorsque vous n'êtes pas là pour modérer.</li> <li>Lorsqu'il y a trop de participant⋅es qui parlent, et que vous ne pouvez plus modérer correctement.</li> </ul>","Enable the emoji only mode on all channel's chatrooms":"Activer le mode Émoji Uniquement sur tous les salons de discussion de la chaîne","No duplicate message":"Pas de message en double","By enabling this options, the moderation bot will automatically moderate duplicate messages. That means if a user send the same message twice within X seconds, the second message will be deleted.":"En activant cette option, le robot de modération modérera automatiquement les messages en double. Cela signifie que si un⋅e utilisateur⋅rice envoie deux fois le même message en l'espace de X secondes, le deuxième message sera supprimé.","_language":"fr"}