{"Open chat":"Apri la chat","Open chat in a new window":"Apri la chat in un nuova finestra","Close chat":"Chiudi la chat","Use chat":"Attiva la chat","If enabled, there will be a chat next to the video.":"Se abilitato, ci sarà una chat accanto al video.","Share chat link":"Condividi il link della chat","Read-only":"In sola lettura","Show the scrollbar":"Mostra la barra di scorrimento","Transparent background (for stream integration, with OBS for example)":"Sfondo trasparente (per l'integrazione delle dirette con OBS, ad esempio)","Tips for streamers: To embed the chat in your video stream using OBS for example, generate a read-only link and use it as a browser source.":"Suggerimenti per gli streamer: per aggiungere la chat al proprio OBS, genera un link della chat in sola lettura e usalo in quanto fonte “browser”.","Copy":"Copia","Link copied":"Link copiato","Error":"Errore","Open":"Apri","Use current theme colors":"Utilizza i colori del tema corrente","Generate an iframe to embed the chat in a website":"Genera un iframe per incorporare la chat in un sito web","Room name":"Nome della chat room","Room description":"Descrizione della chat room","Not found":"Non trovato","Video":"Video","Channel":"Canale","Last activity":"Ultima attività","<h3>Important notes</h3>":"<h3>Note importanti</h3>","You can find the plugin documentation here: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Peertube Plugin Livechat documentation </a>.":"La documentazione del plugin si trova qui: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/it/\" target=\"_blank\"> Documentazione del plugin Peertube Livechat </a>.","Before asking for help, please use the diagnostic tool: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Launch diagnostic</a> (if this button is not opening a new window, please try to refresh the page).":"Prima di chiedere aiuto, ti preghiamo di utilizzare lo strumento di diagnostica: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Avvia la diagnostica</a> (se questo pulsante non apre una nuova finestra, aggiorna la pagina).","<h3>Chat</h3>":"<h3>Chat</h3>","List existing rooms":"Elenco delle chat room esistenti","<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">List rooms</a>":"<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">Elenca le chat room</a>","<h3>Federation</h3> Following settings concern the federation with other Peertube instances, and other fediverse softwares.":"<h3>Federazione</h3> Le impostazioni seguenti riguardano la federazione con altre istanze Peertube, e altri software del fediverso.","Don't display remote chats":"Non visualizzare le chat remote","By checking this setting, your instance will never display chats from remote videos.":"Selezionando questa impostazione la vostra istanza non visualizzerà mai chat da video remoti.","Don't publish chat information":"Non pubblicare le informazioni sulla chat","By checking this setting, your instance will not publish chat information on the fediverse. Remote Peertube instances will not be aware that they are chat rooms associated to your videos.<br> <b>Please note</b>: if you already had chats in progress, it is possible that the information has already been published. You will have to wait for the next video update before the information is unpublished. Also, if you disable this setting, you'll have to wait for the videos to be updated before the information are published again. This update happens among others when a live event resumes or stops.<br> <b>Please note</b>: this setting only affects the publication of information via the ActivityPub protocol. It will not prevent a remote application from otherwise detecting the presence of chats, and trying to connect to it.":"Selezionando questo parametro, la vostra istanza non pubblicherà le informazioni della chat sul fediverso. Le istanze Peertube remote non sapranno che una chat è associata ai video.<br> <b>Attenzione</b>: se erano già in corso delle chat, è possibile che le informazioni siano già state pubblicate. Dovrete attendere il prossimo aggiornamento dei video perché le informazioni non vengano pubblicate. Allo stesso modo, se si disattiva questa impostazione, bisognerà attendere l'aggiornamento dei video prima di poter pubblicare nuovamente le informazioni. Questo aggiornamento avviene, tra l'altro, quando una trasmissione in diretta riprende o si interrompe.<br> <b>Attenzione</b>: questo parametro influisce solo sulla pubblicazione di informazioni tramite il protocollo ActivityPub. Non impedisce a un'applicazione remota di rilevare in altro modo la presenza della chat e di tentare di connettersi ad essa.","<h3>Chat behaviour</h3>":"<h3>Comportamento della chat</h3>","Room type":"Tipo di chat room","You can choose here to have separate rooms for each video, or to group them by channel.":"Puoi scegliere di avere delle chat room separate per ogni video o di raggrupparle per canale.","Each video has its own webchat room":"Ogni video ha la propria chat room","Webchat rooms are grouped by channel":"Le chat room sono raggruppate per canale","Automatically open the chat":"Apri automaticamente la chat","When watching a video, the chatbox will automatically open.":"Quando si guarda un video, la chat si aprirà automaticamente.","Show the «open in new window» button":"Mostra il pulsante “Apri in una nuova finestra”","There will be a button for opening the web chat in a new window.":"Ci sarà un pulsante per aprire la chat in una nuova finestra.","Show the «share chat link» button":"Mostra il pulsante “Condividi il link della chat room”","There will be a button for sharing a chat url (could be used for OBS integration, for example).":"Ci sarà un pulsante per condividere il link della chat room (che potrebbe essere utilizzato, ad esempio, per integrare la chat a OBS).","Show for nobody":"Non mostrarlo a nessuno","Show for everyone":"Mostralo a tutti","Show for the video owner":"Mostralo solo al proprietario del video","Show for the video owner and instance's moderators":"Mostralo solo al proprietario del video e ai moderatori dell'istanza","Users can activate the chat for their lives":"Lз utentə possono attivare la chat per i loro video in diretta","If checked, all live videos will have a checkbox in their properties for enabling the web chat.":"Se selezionata, tutti i video in diretta avranno una casella di controllo nelle loro proprietà per attivare/disattivare la chat.","<span class=\"peertube-plugin-livechat-warning\"> You have enabled the setting «Users can activate the chat for their lives». It is redundant with the «Activate chat for all lives» setting. </span>":"<span class=\"peertube-plugin-livechat-warning\"> È stata attivata l'impostazione “Lз utentə possono attivare la chat per i loro video in diretta”. Quest'impostazione è ridondante con “Attiva la chat per tutti i video in diretta”. </span>","Activate chat for all lives":"Attiva la chat per tutti i video in diretta","If checked, the chat will be enabled for all lives.":"Se selezionata, la chat sarà attivata per tutti i video in diretta.","Activate chat for all non-lives":"Attiva la chat per tutti i video che non sono dirette","If checked, the chat will be enabled for all video that are not lives.":"Se selezionata, la chat sarà attivata per tutti i video non in diretta.","Activate chat for these videos":"Attiva la chat per questi video","Videos UUIDs for which we want a web chat. Can be non-live videos. One per line. <br /> You can add comments: everything after the # character will be stripped off, and empty lines ignored.<br /> Don't add private videos, the UUIDs will be sent to the frontend.":"Inserisci gli UUID dei video per i quali desideri forzare l'attivazione della chat (uno per riga). Questi possono essere dei video in diretta o no.<br /> Puoi anche inserire dei commenti: tutto ciò che si trova dopo il carattere # verrà eliminato e le righe vuote saranno ignorate.<br /> Non aggiungere video privati: gli UUID sarebbero inviati al frontend e dunque esposti a tutti gli utenti.","Hide the chat for anonymous users":"Nascondi la chat per gli utenti anonimi (non connessi)","If checked, anonymous Peertube users won't see the chat. This feature is still experimental. If you enabled it, it is highly recommended to also check \"Don't publish chat information\". Otherwise, some third party tools could try to open the chat, and have unpredictable behaviours.":"Se selezionata, gli utenti anonimi (non connessi) non vedranno la chat.","<h3>Theming</h3>":"<h3>Personalizza l'aspetto</h3>","ConverseJS theme":"Tema ConverseJS","Please choose the converseJS theme you want to use.":"Scegli il tema converseJS che desideri utilizzare.","Peertube theme":"Tema Peertube","Default ConverseJS theme":"Tema predefinito di ConverseJS","ConverseJS Cyberpunk theme":"Tema “cyberpunk“ di ConverseJS","Automatic color detection":"Rilevamento automatico dei colori","Try to autodetect colors from user's current theme.<br> When this setting is enabled, the plugin tries to auto-detect colors to apply to the chat theme.<br> If this is not correctly working for some of your Peertube theme, you can disable this option. You can report the bug on the official <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> issue tracker </a>. Don't forget to specify which theme is not working.":"Cerca di rilevare automaticamente i colori dal tema corrente dell'utente.<br> Se selezionata, il plugin cercherà di rilevare automaticamente i colori del tema corrente dell'utente e li applicherà al tema della chat.<br> Se questo non funzionasse correttamente per alcuni temi di Peertube, disattiva questa opzione. Puoi segnalare i bug riscontrati nella <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> gestione errori ufficiale </a>. Non dimenticare di indicare il tema difettoso.","Webchat iframe style attribute":"Attributi di stile dell'iframe della chat","Additional styles to be added on the iframe style attribute. <br> Example: height:400px;":"Stili aggiuntivi da applicare all'iframe della chat.<br> Esempio: height:400px;","<h3>Chat server advanced settings</h3>":"<h3>Impostazioni avanzate del chat server</h3>","Prosody server":"Server Prosody","This plugin uses the Prosody XMPP server to handle chat rooms.<br> This plugin comes with a Prosody AppImage, that will be used to run the service.":"Questo plugin utilizza il server XMPP Prosody per gestire le stanze di discussione.<br> Questo plugin include una AppImage di Prosody, che sarà utilizzata per far funzionare il servizio.","Use system Prosody":"Usa il server Prosody installato sul sistema","Warning: don't check this setting if you are not sure of what you are doing.<br> By checking this setting, your Peertube will use the Prosody server that comes with your system, and not the embedded AppImage.<br> Only use this if you encounter problems with the embedded Prosody.":"Attenzione: non utilizzare questa impostazione se non sei sicurə di quello che stai facendo.<br> Se selezionata, Peertube utilizzerà il server Prosody fornito dal tuo sistema e non quello incorporato nel plugin<br> Utilizza questa impostazione solo se hai problemi con l'AppImage di Prosody integrata nel plugin.","Disable Websocket":"Disattiva Websocket","With Peertube &gt;= 5.0.0, this plugin try to use Websocket connection for chatting. If the user's browser or connection is incompatible, the browser will automatically fall back on the BOSH protocol. <br> But in rare case, this can fail. For example, if you have a reverse proxy in front of Peertube that does not allow Websocket connection for plugins. In this case, you can check this setting to disable Websocket connections.":"Con Peertube &gt;= 5.0.0, questo plugin cercherà di utilizzare il protocollo Websocket per le connessioni alla chat. Se il browser o la connessione dell'utente non sono compatibili, il browser passerà automaticamente al protocollo BOSH. <br> Tuttavia, in rari casi, questo potrebbe non funzionare. Ad esempio, se hai un reverse proxy di fronte a Peertube che non consente le connessioni tramite Websocket. In tal caso, puoi selezionare quest'opzione per disattivare le connessioni Websocket.","Prosody port":"Porta per Prosody","The port that will be used by the Prosody server.<br> Change it if this port is already in use on your server.<br> You can close this port on your firewall, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"La porta che sarà utilizzata dal server Prosody.<br> Cambiala se questa porta è già in uso sul tuo server.<br> Puoi chiudere tramite il tuo firewall l'accesso a questa porta dall'esterno.<br> Nota: questo potrebbe cambiare prossimamente, poiché è prevista l'aggiunta di parametri per attivare le connessioni esterne.","Peertube url for API calls":"URL di Peertube per le chiamate API","Please let this setting empty if you don't know what you are doing.<br> In some rare cases, Prosody can't call Peertube's API from its public URI. You can use this field to customize Peertube's URI for Prosody modules (for example, with «http://localhost:9000» or «http://127.0.0.1:9000»).":"Ti preghiamo di non toccare questa impostazione se non sei sicurə di quello che stai facendo.<br> In rari casi il server Prosody potrebbe non essere in grado di chiamare l'API di Peertube utilizzando il suo url pubblico. Puoi allora utilizzare questo parametro per personalizzare l'url che i moduli Prosody utilizzeranno per le API di Peertube (ad esempio «http://localhost:9000» o «http://127.0.0.1:9000»).","Log rooms content by default":"Registra automaticamente il contenuto delle chat room","If checked, room contents will be saved by default. Any user who joins a room will see what was written before they joins.<br> Please note that it is always possible to enable/disable the content archiving for a specific room, by editing its properties.":"Se selezionata, i contenuti della chat room saranno registrati automaticamente. Ogni utente che entrerà in una chat room vedrà allora tutto quello che è stato scritto prima del suo arrivo. <br> Nota: puoi sempre attivare/disattivare la registrazione dei contenuti per una specifica chat room, modificandone le proprietà.","Room logs expiration":"Scadenza dei registri delle chat room","You can choose here how long the chatting room's content is kept by the server. The value can be: <ul> <li><b>60</b>: the content will be saved for 60 <b>seconds</b>. You can replace 60 by any integer value.</li> <li><b>1d</b>: the content will be saved for 1 <b>day</b>. You can replace 1 by any integer value.</li> <li><b>1w</b>: the content will be saved for 1 <b>week</b>. You can replace 1 by any integer value.</li> <li><b>1m</b>: the content will be saved for 1 <b>month</b>. You can replace 1 by any integer value.</li> <li><b>1y</b>: the content will be saved for 1 <b>year</b>. You can replace 1 by any integer value.</li> <li><b>never</b>: the content will never expire, and will be kept forever.</li> </ul>":"Scegli per quanto tempo il contenuto della chat room sarà conservato sul server. Il valore può essere: <ul> <li><b>60</b>: il contenuto verrà registrato per 60 <b>secondi</b>. Puoi sostituire 60 con qualsiasi valore intero.</li> <li><b>1d</b>: il contenuto verrà registrato per 1 <b>giorno</b>. Puoi sostituire 1 con qualsiasi valore intero.</li> <li><b>1w</b>: il contenuto verrà registrato per 1 <b>settimana</b>. Puoi sostituire 1 con qualsiasi valore intero.</li> <li><b>1m</b>: il contenuto verrà registrato per 1 <b>mese</b>. Puoi sostituire 1 con qualsiasi valore intero.</li> <li><b>1y</b>: il contenuto verrà registrato per 1 <b>anno</b>. Puoi sostituire 1 con qualsiasi valore intero.</li> <li><b>never</b>: il contenuto non sarà mai cancellato.</li> </ul>","Enable connection to room using external XMPP accounts":"Abilitare la connessione a questa stanza usando profili XMPP esterni","By enabling this option, it will be possible to connect to rooms using external XMPP accounts and XMPP clients.<br> <span class=\"peertube-plugin-livechat-warning\"> <b>Warning</b>, enabling this option can request extra server and DNS configuration. </span> Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/advanced/xmpp_clients/\" target=\"_blank\"> Enable external XMPP account connections. </a>":"Abilitando questa opzione, sarà possibile connettersi alle stanze utilizzando account XMPP esterni tramite client XMPP.<br> <span class=\"peertube-plugin-livechat-warning\">Si noti che l'attivazione di questa opzione può richiedere la configurazione del server e dei record DNS.</span> Per saperne di più, consultare la documentazione: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/it/documentation/admin/advanced/xmpp_clients/\" target=\"_blank\"> Permettere connessioni con account XMPP esterni. </a>","Prosody server to server port":"Porta Prosody da server a server","The port that will be used for XMPP s2s (server to server) connections.<br> You should use the standard 5269 port. Otherwise you should <a href=\"https://prosody.im/doc/s2s\"> setup a specific DNS record </a>.":"La porta che verrà utilizzata per le connessioni XMPP s2s (da server a server).<br> Si dovrebbe usare la porta standard 5269. Altrimenti sarà necessario <a href=\"https://prosody.im/doc/s2s\"> impostare un record DNS specifico </a>.","Server to server network interfaces":"Interfacce di rete da server a server","The network interfaces to listen on for server to server connections.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>":"Le interfacce di rete su cui ascoltare per le connessioni da server a server.<br> Elenco di IP su cui ascoltare, separati da virgole (gli spazi saranno eliminati).<br> È possibile utilizzare \"*\" per ascoltare su tutte le interfacce IPv4 e «::» per tutte le IPv6.<br> Esempi: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>","Enable client to server connections":"Abilitare le connessioni dal client al server","Enable XMPP clients to connect to the built-in Prosody server.<br> This option alone only allows connections from localhost clients.":"Consenti ai clienti XMPP a connettersi al server Prosody incorporato nel plugin.<br> Questa opzione consente unicamente le connessioni dei clienti sul localhost.","Prosody client to server port":"Porta di connessione dei client al server Prosody","The port that will be used by the c2s module of the built-in Prosody server.<br> XMPP clients shall use this port to connect.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall for now, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"Questa è la porta che verrà utilizzata dal modulo “c2s” (client to server) del server Prosody incorporato nel plugin.<br> I clienti XMPP dovranno utilizzare questa porta per connettersi.<br> Cambiala se questa porta è già in uso sul tuo server.<br> Per ora, puoi chiudere l'accesso a questa porta dall'esterno, tramite il tuo firewall (Prosody ascolta solo il localhost).<br> Nota: questo potrebbe cambiare prossimamente, poiché è prevista l'aggiunta di una funzione per attivare le connessioni dall'esterno.","Enable custom Prosody external components":"Abilita le componenti esterne personalizzate di Prosody","Enable the use of external XMPP components.<br> This option alone only allows connections from localhost. You have to setup the listening interfaces and open the port on your firewall to make it available from remote servers.<br> This feature can, for example, be used to connect some bots to the chatting rooms.":"Abilita l'uso di componenti XMPP esterne.<br> Sono consentite solo le connessioni dal localhost.<br> Questa funzione può essere utilizzata, ad esempio, per collegare dei bot alle chat room.","Prosody external components port":"Porta di connessione delle componenti XMPP al server Prosody","The port that will be used by XMPP components to connect to the Prosody server.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall if you don't allow access on interfaces other than localhost.":"Questa è la porta che verrà utilizzata dalle componenti XMPP per connettersi al server Prosody.<br> Cambiala se questa porta è già in uso sul tuo server.<br> Per ora, puoi chiudere l'accesso a questa porta dall'esterno, tramite il tuo firewall (Prosody ascolta solo il localhost).<br> Nota: questo potrebbe cambiare prossimamente, poiché è prevista l'aggiunta di una funzione per attivare le connessioni dall'esterno.","External components":"Componenti esterne","The external components to declare: <ul> <li>One per line.</li> <li>Use the format «component_name:component_secret» (spaces will be trimmed).</li> <li>You can add comments: everything after the # character will be stripped off, and empty lines ignored.</li> <li>The name can only contain latin alphanumeric characters and dots.</li> <li> If the name contains only alphanumeric characters, it will be suffixed with the XMPP domain. For example, «bridge» will become «bridge.your_domain.tld». You can also specify a full domain name, but you have to make sure to configure your DNS correctly. </li> <li>Only use alphanumeric characters in the secret passphrase (use at least 15 characters).</li> </ul>":"Componenti esterne da dichiarare: <ul> <li>Una per riga</li> <li>Usa il formato «nome_componente:passphrase_segreta» (gli spazi verranno eliminati).</li> <li>Puoi aggiungere commenti: tutto ciò che segue il carattere # verrà eliminato, e le righe vuote ignorate.</li> <li>Il nome elle componenti può contenere solo caratteri alfanumerici latini e punti.</li> <li> Se il nome contiene solo caratteri alfanumerici, sarà seguito dal dominio XMPP come suffisso. Ad esempio, «bridge» diventerà «bridge.tuo_dominio.tld». Puoi anche specificare un nome di dominio completo, ma assicurati di configurare correttamente il tuo DNS. </li> <li>Usa solo caratteri alfanumerici per la passphrase segreta (usa almeno 15 caratteri). </li> </ul>","Web":"Web","Connect using XMPP":"Connessione con un client XMPP","You can connect to the room using an external XMPP account, and your favorite XMPP client.":"Puoi collegarti alla stanza usando un account XMPP esterno, e il tuo client XMPP preferito.","Certificates folder":"Cartella dei certificati","If this field is empty, the plugin will generate and use self-signed certificates.<br> If you want to use other certificates, just specify here the folder where Prosody can find them. Note: the \"peertube\" user must have read access to this folder.":"Se questo campo è vuoto, il plugin genererà e utilizzerà certificati autofirmati.<br> Se si desidera utilizzare altri certificati, è sufficiente specificare la cartella in cui Prosody può trovarli. Nota: l'utente \"peertube\" deve avere accesso in lettura a questa cartella.","Chat for live stream:":"Chat per la diretta:","_language":"it"}