{"Open chat":"チャットを開く","Open chat in a new window":"新規ウィンドウでチャットを開く","Close chat":"チャットを閉じる","Use chat":"チャットを使用する","If enabled, there will be a chat next to the video.":"有効にしている場合、動画の横にチャットを表示します。","Share chat link":"チャットリンクを共有","Read-only":"読み取り専用にする","Show the scrollbar":"スクロールバーを表示する","Transparent background (for stream integration, with OBS for example)":"透過型背景にする (OBSなどを使用したストリーミング連携に最適)","Tips for streamers: To embed the chat in your video stream using OBS for example, generate a read-only link and use it as a browser source.":"ストリーマーの方へ: OBSなどを使用して動画ストリームにチャットを埋め込む場合は、 読み取り専用のチャットリンクを生成し、ブラウザソースで読み込んでください。","Copy":"コピー","Link copied":"リンクをコピーしました","Error":"エラー","Open":"開く","Use current theme colors":"現在のテーマカラーを使用する","You can connect to the room using an external XMPP account, and your favorite XMPP client.":"外部のXMPPアカウントとお気に入りのXMPPクライアントを使用してチャットルームに接続できます。","By checking this setting, your instance will never display chats from remote videos.":"この設定を有効にすると、あなたのインスタンスはリモート動画のチャットを表示しないようになります。","You can find the plugin documentation here: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Peertube Plugin Livechat documentation </a>.":"プラグインのドキュメントはこちらから確認頂けます: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> PeerTube ライブチャットプラグイン ドキュメント </a>.","<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">List rooms</a>":"<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">ルームリスト</a>","Generate an iframe to embed the chat in a website":"Webサイトへのチャット埋め込みのためのiframeを生成","Channel":"チャンネル","Chat for live stream:":"ライブ配信向けチャット:","Room name":"ルーム名","Room description":"ルームの説明","Not found":"見つかりません","Video":"動画","Last activity":"最終アクティビティ","Web":"Web","Connect using XMPP":"XMPPを使用して接続","<h3>Important notes</h3>":"<h3>重要なお知らせ</h3>","Before asking for help, please use the diagnostic tool: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Launch diagnostic</a> (if this button is not opening a new window, please try to refresh the page).":"ヘルプを要請する前に、診断ツールをご利用ください: <a class=\"peertube-plugin-livechat-launch-diagnostic\">診断ツールを起動</a> (このボタンを押して、新規ウィンドウで開かれない場合はページを再読み込みしてください)","<h3>Chat</h3>":"<h3>チャット</h3>","List existing rooms":"既に存在するルームリスト","<h3>Federation</h3> Following settings concern the federation with other Peertube instances, and other fediverse softwares.":"<h3>連合</h3> 次の設定は、他のPeerTubeインスタンスや Fediverseソフトウェアとの連合に影響がある可能性があります。","Don't display remote chats":"外部チャットを表示しない","Don't publish chat information":"チャット情報を公開しない","<h3>Chat behaviour</h3>":"<h3>チャットのふるまい</h3>","Room type":"ルームタイプ","You can choose here to have separate rooms for each video, or to group them by channel.":"動画ごとにチャットルームを分けるか、チャンネルで1つのチャットルームにするかを選択できます。","Each video has its own webchat room":"動画ごとにそれぞれのチャットルームを用意する","Webchat rooms are grouped by channel":"チャンネルで1つのチャットルームを用意する","Automatically open the chat":"自動的にチャットを開く","When watching a video, the chatbox will automatically open.":"動画を視聴している際に、チャットボックスが自動的に開かれます。","Show the «open in new window» button":"«新規ウィンドウで開く»ボタンを表示する","There will be a button for opening the web chat in a new window.":"新規ウィンドウでチャットを開くボタンを表示します。","Show the «share chat link» button":"«チャットリンクを共有»ボタンを表示する","There will be a button for sharing a chat url (could be used for OBS integration, for example).":"OBSにチャットボックスを表示する場合など、チャットURLを共有するためのボタンを表示します。","Show for nobody":"誰にも表示しない","Show for everyone":"全員に表示する","Show for the video owner and instance's moderators":"動画の管理者とインスタンスのモデレーターにのみ表示する","Users can activate the chat for their lives":"ユーザー自身でライブ配信のチャットを有効できるようにする","Show for the video owner":"動画の管理者にのみ表示する","If checked, all live videos will have a checkbox in their properties for enabling the web chat.":"チェックを入れると、すべてのライブ配信に対して、チャットを有効にするためのチェックボックスが表示されるようになります。","<span class=\"peertube-plugin-livechat-warning\"> You have enabled the setting «Users can activate the chat for their lives». It is redundant with the «Activate chat for all lives» setting. </span>":"<span class=\"peertube-plugin-livechat-warning\"> «ユーザー自身でライブ配信のチャットを有効できるようにする»設定を有効にしました。 «すべてのライブ配信でチャットを有効にする»設定と競合しています。 </span>","Activate chat for all lives":"すべてのライブ配信でチャットを有効にする","If checked, the chat will be enabled for all lives.":"チェックを入れると、すべてのライブ配信でチャットが有効になります。","Activate chat for all non-lives":"全ての非ライブ配信でチャットを有効にする","If checked, the chat will be enabled for all video that are not lives.":"チェックを入れると、ライブ配信以外のすべての動画でチャットが有効になります。","Activate chat for these videos":"次の動画でチャットを有効にする","Hide the chat for anonymous users":"匿名ユーザーにチャットを非表示にする","If checked, anonymous Peertube users won't see the chat. This feature is still experimental. If you enabled it, it is highly recommended to also check \"Don't publish chat information\". Otherwise, some third party tools could try to open the chat, and have unpredictable behaviours.":"チェックを入れると、匿名のPeerTubeユーザーはチャットが見えなくなります。 この機能はまだ試験中ものです。 有効にする場合、\"チャット情報を公開しない\"にもチェックを入れることを推奨します。 チェックがない場合、一部のサードパーティーツールがチャットを開こうとし、予期しない挙動をする可能性があります。","<h3>Theming</h3>":"<h3>テーマ設定</h3>","ConverseJS theme":"ConverseJSのテーマ","Please choose the converseJS theme you want to use.":"使用したいconverseJSのテーマを選択してください。","Peertube theme":"PeerTubeのテーマ","Default ConverseJS theme":"デフォルトのConverseJSテーマ","ConverseJS Cyberpunk theme":"ConverseJS cyberpunkテーマ","Automatic color detection":"色を自動検出","Webchat iframe style attribute":"チャットのiframeスタイル属性","Additional styles to be added on the iframe style attribute. <br> Example: height:400px;":"追加のスタイル設定をiframeスタイルの属性に追加します。<br> 例）height:400px;","<h3>Chat server advanced settings</h3>":"<h3>チャットサーバーの詳細設定</h3>","Prosody server":"Prosodyサーバー","This plugin uses the Prosody XMPP server to handle chat rooms.<br> This plugin comes with a Prosody AppImage, that will be used to run the service.":"本プラグインは、チャットルームの処理にProsody XMPPサーバーを使用します。<br> 本プラグインには、サービスで使用されるProsody AppImageが同梱されています。","Use system Prosody":"システムのProsodyを使用する","Disable Websocket":"Websocketを無効にする","Prosody port":"Prosodyポート番号","The port that will be used by the Prosody server.<br> Change it if this port is already in use on your server.<br> You can close this port on your firewall, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"Prosodyサーバーによって使用されるポート番号です。<br> このポートを既にサーバーが使用している場合に変更してください。<br> このポートをファイアウォールなどで封じることで、外部からアクセスを禁止できます。<br> 注: 外部接続を有効にする機能の追加が予定されている為、この設定は近い将来変更される可能性があります。","Peertube url for API calls":"API呼び出しのためのPeerTube URL","Please let this setting empty if you don't know what you are doing.<br> In some rare cases, Prosody can't call Peertube's API from its public URI. You can use this field to customize Peertube's URI for Prosody modules (for example, with «http://localhost:9000» or «http://127.0.0.1:9000»).":"この設定が何を意味するのか分からない場合は、空欄のままにしてください。<br> 一部の特殊なケースで、公開URIからProsodyを呼び出せない場合があります。 Prosodyモジュールを呼び出すPeerTubeのURIをここでカスタマイズできます。 (たとえば、«http://localhost:9000»または«http://127.0.0.1:9000»など)。","Log rooms content by default":"デフォルトでルームの内容を残す","If checked, room contents will be saved by default. Any user who joins a room will see what was written before they joins.<br> Please note that it is always possible to enable/disable the content archiving for a specific room, by editing its properties.":"チェックを入れると、ルームの内容がデフォルトで保存されるようになります。 ユーザーがルームに入る前に交わされていたチャットの内容などが確認できるようになります。<br> プロパティを編集することで、特定のルームのコンテンツのみをアーカイブするなどの変更が いつでもできることを覚えておいてください。","Room logs expiration":"ルームログの有効期限","Enable connection to room using external XMPP accounts":"外部のXMPPアカウントを使用してのルーム接続を有効にする","Prosody server to server port":"Prosodyサーバー間のポート番号","The port that will be used for XMPP s2s (server to server) connections.<br> You should use the standard 5269 port. Otherwise you should <a href=\"https://prosody.im/doc/s2s\"> setup a specific DNS record </a>.":"XMPP s2s(サーバー間)接続で使用されるポート番号です。<br> 通常は、ポート5269を使用します。 それ以外にしたい場合は <a href=\"https://prosody.im/doc/s2s\"> 特定のDNSレコードを設定する </a>必要があります。","Server to server network interfaces":"サーバー間ネットワークインターフェイス","Certificates folder":"証明書フォルダー","If this field is empty, the plugin will generate and use self-signed certificates.<br> If you want to use other certificates, just specify here the folder where Prosody can find them. Note: the \"peertube\" user must have read access to this folder.":"この欄が空欄の場合、プラグインは自己証明書を生成し、使用するようになります。<br> 他の証明書を使用したい場合は、ここに証明書が入ったProsodyがアクセス可能な フォルダを指定します。 注意: \"peertube\"というユーザーがこのフォルダーにアクセス可能である必要があります。","Enable client to server connections":"クライアントからサーバー接続を有効にする","Enable XMPP clients to connect to the built-in Prosody server.<br> This option alone only allows connections from localhost clients.":"XMPPクライアントから内蔵のProsodyサーバーへの接続を有効にします。<br> この設定のみにすると、localhostクライアントからの接続のみ許可されます。","Prosody client to server port":"Prosodyクライアントからサーバーへの接続ポート番号","Enable custom Prosody external components":"カスタムProsody外部コンポーネントを有効にする","Enable the use of external XMPP components.<br> This option alone only allows connections from localhost. You have to setup the listening interfaces and open the port on your firewall to make it available from remote servers.<br> This feature can, for example, be used to connect some bots to the chatting rooms.":"外部XMPPコンポーネントの使用を有効にします。<br> この設定のみでは、localhostからの接続のみが許可されます。 リッスン用のインタフェースの準備とリモートサーバーからの接続を受け付けるように、ファイアウォールとポートの開放を行う必要があります。<br> この機能により、例えばbotなどがチャットルームに接続できるようにすることができます。","Prosody external components port":"Prosody外部コンポーネントポート番号","External components":"外部コンポーネント","By checking this setting, your instance will not publish chat information on the fediverse. Remote Peertube instances will not be aware that they are chat rooms associated to your videos.<br> <b>Please note</b>: if you already had chats in progress, it is possible that the information has already been published. You will have to wait for the next video update before the information is unpublished. Also, if you disable this setting, you'll have to wait for the videos to be updated before the information are published again. This update happens among others when a live event resumes or stops.<br> <b>Please note</b>: this setting only affects the publication of information via the ActivityPub protocol. It will not prevent a remote application from otherwise detecting the presence of chats, and trying to connect to it.":"この設定を有効にすると、あなたのインスタンスはFediverse上にチャット情報を公開しないようになります。 リモートのPeerTubeインスタンスは、チャットルームがあなたの動画に関連付いていることを認識しなくなります。<br> <b>注意</b>: 進行中のチャットが既に存在する場合、既にチャット情報が公開されている可能性があります。 チャット情報が非公開になるまで、次の動画の更新を待つ必要があります。 また、この設定を無効にすると、再度チャット情報が公開されるようになるまで、次の動画の更新を待つ必要があります。 この更新は、主にライブ配信が再開したり、停止したときに発生します。<br> <b>注意</b>: この設定は、ActivityPubプロトコルを経由した情報の公開のみ影響します。 リモート アプリケーションがチャットの存在を検出し、それに接続しようとすることを妨げるものではありません。","Videos UUIDs for which we want a web chat. Can be non-live videos. One per line. <br /> You can add comments: everything after the # character will be stripped off, and empty lines ignored.<br /> Don't add private videos, the UUIDs will be sent to the frontend.":"チャットを有効にしたい動画のUUIDを入力してください。 非ライブ配信の動画が指定可能です。1つにつき1行で入力してください。 <br /> コメントを記載可能: #以降の文字は全てコメント扱いとなります。空行は無視されます。<br /> UUIDがフロントエンドに送信されてしまう為、非公開動画は追加しないでください。","Try to autodetect colors from user's current theme.<br> When this setting is enabled, the plugin tries to auto-detect colors to apply to the chat theme.<br> If this is not correctly working for some of your Peertube theme, you can disable this option. You can report the bug on the official <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> issue tracker </a>. Don't forget to specify which theme is not working.":"ユーザーの現在のテーマから色を自動検出します。<br> この設定が有効の場合、プラグインは色を自動検出し、チャットのテーマに適用します。<br> この設定がお使いのPeerTubeテーマでうまく動作しない場合は、この設定を無効にできます。 発見したバグは、公式の <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> issue トラッカー </a>から報告をお願いします。 どのテーマで動作しなかったかも合わせて報告をお願いします。","Warning: don't check this setting if you are not sure of what you are doing.<br> By checking this setting, your Peertube will use the Prosody server that comes with your system, and not the embedded AppImage.<br> Only use this if you encounter problems with the embedded Prosody.":"警告: この設定を理解していない場合は、チェックを入れないでください。<br> この設定を有効にすると、あなたのPeerTubeインスタンスは、システムで動作しているProsodyサーバーを使用するようになり、 同梱のAppImageは使用しなくなります。<br> 同梱されたProsodyで問題が発生した場合にのみ、この設定を有効にしてください。","With Peertube &gt;= 5.0.0, this plugin try to use Websocket connection for chatting. If the user's browser or connection is incompatible, the browser will automatically fall back on the BOSH protocol. <br> But in rare case, this can fail. For example, if you have a reverse proxy in front of Peertube that does not allow Websocket connection for plugins. In this case, you can check this setting to disable Websocket connections.":"PeerTube v5.0.0以降をお使いの場合、本プラグインはチャットの接続にWebsocketを使用するようになります。 ユーザーのブラウザーにWebsocketとの互換性がない場合は、ブラウザーは自動的にBOSHプロトコルに切り替えます。 <br> ただし希に、プロトコルの切替に失敗することがあります。例えば、PeerTubeの前に、プラグインに対してWebsocketを許可していないリバースプロキシを使用している場合などが、これに該当します。 この場合、この設定を有効にすることでWebsocket接続を使用しないようになります。","You can choose here how long the chatting room's content is kept by the server. The value can be: <ul> <li><b>60</b>: the content will be saved for 60 <b>seconds</b>. You can replace 60 by any integer value.</li> <li><b>1d</b>: the content will be saved for 1 <b>day</b>. You can replace 1 by any integer value.</li> <li><b>1w</b>: the content will be saved for 1 <b>week</b>. You can replace 1 by any integer value.</li> <li><b>1m</b>: the content will be saved for 1 <b>month</b>. You can replace 1 by any integer value.</li> <li><b>1y</b>: the content will be saved for 1 <b>year</b>. You can replace 1 by any integer value.</li> <li><b>never</b>: the content will never expire, and will be kept forever.</li> </ul>":"チャットルームの内容をいつまでサーバーに保管しておくかを選択できます。 値によって次のようになります: <ul> <li><b>60</b>: 内容は、60 <b>秒</b>保存されます。 60をお好みの数字に変更できます。</li> <li><b>1d</b>: 内容は、1<b>日</b>保存されます。1をお好みの数字に変更できます。</li> <li><b>1w</b>: 内容は、1<b>週間</b>保存されます。1をお好みの数字に変更できます。</li> <li><b>1m</b>: 内容は、1<b>ヶ月</b>保存されます。1をお好みの数字に変更できます。</li> <li><b>1y</b>: 内容は、1<b>年</b>保存されます。1をお好みの数字に変更できます。</li> <li><b>永久</b>: 内容に有効期限はなく、永久保管されます。</li> </ul>","By enabling this option, it will be possible to connect to rooms using external XMPP accounts and XMPP clients.<br> <span class=\"peertube-plugin-livechat-warning\"> <b>Warning</b>, enabling this option can request extra server and DNS configuration. </span> Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/advanced/xmpp_clients/\" target=\"_blank\"> Enable external XMPP account connections. </a>":"この設定を有効にすると、外部のXMPPアカウントとXMPPクライアントを利用してチャットルームに接続できるようになります。<br> <span class=\"peertube-plugin-livechat-warning\">注意しなければならないのは、この設定は追加のサーバーとDNS設定をリクエストできるようになることです。</span> 次のドキュメントを参照してください: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/ja/documentation/admin/advanced/xmpp_clients/\" target=\"_blank\"> 外部のXMPPアカウント接続を有効にする。 </a>","The network interfaces to listen on for server to server connections.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>":"サーバー間接続のためにリッスンするネットワークインターフェイスです。<br> リッスンするIPのリストをコンマ区切り(スペースは削除されます)で指定してください。<br> «*»を指定することで全てのIPv4アドレス、«::»を指定することで全てのIPv6アドレスをリッスンします。<br> 例: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>","The port that will be used by the c2s module of the built-in Prosody server.<br> XMPP clients shall use this port to connect.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall for now, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"内蔵のProsodyサーバーのc2sモジュールで使用されるポート番号です。<br> XMPPクライアントは、このポート番号を使用して接続します。<br> このポートが既にサーバー上で使用されている場合に変更してください。<br> 現時点では、このポートをファイアウォールにより閉じておくことができます。外部からアクセスされることはありません。<br> 注: 外部接続を有効にする機能の追加が予定されている為、この設定は近い将来変更される可能性があります。","The port that will be used by XMPP components to connect to the Prosody server.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall if you don't allow access on interfaces other than localhost.":"XMPPコンポーネントがProsodyサーバーに接続する際に使用されるポート番号です。<br> このポートが既にサーバー上で使用されている場合に変更してください。<br> localhost以外からのアクセスを許可しない場合は、引き続きファイアウォールでこのポートを閉じておくことができます。","The external components to declare: <ul> <li>One per line.</li> <li>Use the format «component_name:component_secret» (spaces will be trimmed).</li> <li>You can add comments: everything after the # character will be stripped off, and empty lines ignored.</li> <li>The name can only contain latin alphanumeric characters and dots.</li> <li> If the name contains only alphanumeric characters, it will be suffixed with the XMPP domain. For example, «bridge» will become «bridge.your_domain.tld». You can also specify a full domain name, but you have to make sure to configure your DNS correctly. </li> <li>Only use alphanumeric characters in the secret passphrase (use at least 15 characters).</li> </ul>":"外部コンポーネントを宣言するには: <ul> <li>コンポーネント1つにつき1行</li> <li>«component_name:component_secret»のフォーマットを使用します。(スペースは取り除かれます)</li> <li>コメントを記載可能: #移行の文字は全てコメントと扱われます。空行は無視されます。</li> <li>名前には、ラテン英数字とドット(.)のみが使用できます。</li> <li> 名前に英数字のみ使用されている場合、接頭辞にXMPPドメインが追加されます。 例えば、«bridge»という名前をつけた場合、«bridge.your_domain.tld»となります。 完全なドメイン名を指定することもできますが、DNSが正しく設定されていることを確認してください。 </li> <li>秘密のパスフレーズには、英数字のみ使用してください。(最低15文字)</li> </ul>","Online help":"オンラインヘルプ","Prosody external components network interfaces":"Prosody外部コンポーネントネットワークインタフェース","Ban anonymous user's IP when user is banned from a chatroom":"ユーザーがチャットルームから追放された場合に匿名ユーザーのIPを凍結する","By enabling this option, each time an anonymous user is banned from a chatroom, it's IP will also be banned from the chat server. Warning: if your instance is open to registration, any user could create a trapped-room, invite users to join, and automatically ban all anonymous user's IPs. The banned IP list is not stored, it will be cleared on server restart, or when you change some plugin's settings. The banned IP are logged in the Prosody server log files, so server's administrators can eventually use some external tools (like fail2ban) to ban IPs more widely.":"このオプションを有効にすると、匿名のユーザーがチャットルームから追放されるたびに、そのユーザーのIPもチャットサーバーから追放されます。 警告: あなたのインスタンスが登録を受け付けている場合、どんなユーザーでも罠のルームを作成し、他のユーザーを招待し、自動的にすべての匿名ユーザーのIPを追放できます。 追放されたIPリストは保存されず、サーバー再起動時やプラグインの設定を変更した場合にクリアされます。 追放されたIPはProsodyサーバーログファイルに記録されるため、サーバーの管理者は外部ツール（fail2banなど）を使用してIPを広範囲に追放することができます。","You can setup here some options for this channel (moderation policies, ...).":"このチャンネルの設定を開始できます（モデレートポリシーなど）。","You can configure some words that will be automatically moderated by the bot (messages containing such words will be instantly deleted). You can also add an optional reason that will be displayed at the place of deleted messages. Several examples are provided on the documentation page.":"Botにより自動的にモデレーションする単語を設定できます（単語が含まれるメッセージは即座に削除されます）。 削除されたメッセージの箇所に表示する、削除された理由を設定することもできます。 いくつかの例をドキュメントで提供していますので、必要があれば確認してください。","Save":"保存","The network interfaces to listen on for external components connections.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>":"外部コンポーネント接続のためにリッスンするネットワークインターフェイスです。<br> リッスンするIPのリストをコンマ区切りで入力してください。（スペースは除かれます）<br> 全IPv4インタフェースでリッスンする場合は、 «*»、IPv6の場合は、«::» が使用できます。<br> 例: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>","<b class=\"peertube-plugin-livechat-experimental\">Experimental feature:</b> this feature is still experimental.":"<b class=\"peertube-plugin-livechat-experimental\">試験的な機能:</b> この機能は試験段階です。","<h3>Channel advanced configuration</h3> Following settings concern the advanced channel options: users will be able to add some customization on their channels, activate the moderation bot, ...":"<h3>チャンネルの高度な設定</h3> 以下の設定は、高度なチャネル設定に関するものです: ユーザーは、自身のチャンネルにおいてモデレーターBotの有効化など 高度なカスタマイズを可能とします。","Disable the advanced channel configuration and the chatbot":"高度なチャンネル設定とチャットボットを無効にする","Cancel":"キャンセル","Successfully saved":"保存に成功しました","Chatrooms":"チャットルーム","Configure your live's chatrooms":"ライブ配信のチャットルームを構成","Here you can configure some advanced options for chatrooms associated to your live streams.":"あなたのライブ配信のチャットルームに関する高度なオプションを構成できます。","Please select bellow one of your channel, to setup its chatting options.":"以下から、チャット設定を開始するチャンネルを選択してください。","Channel options":"チャンネル設定","Enable moderation bot":"モデレーターBotを有効にする","Moderation bot options":"モデレーターBotの設定","Forbidden words or expressions":"禁止単語または語句","One word or expression per line. If you put multiple words on one line, it will only match messages containing the whole sequence.":"単語または語句を1行ごとに記載してください。複数の単語を1行に記載した場合、記載したすべての内容を含むメッセージのみが一致するようになります。","Reason":"理由","Reason to display besides deleted messages":"削除理由","Consider as regular expressions":"正規表現","By checking this option, you can use regular expressions.":"このオプションを有効にすると、正規表現として処理します。","Also moderate messages from moderators":"モデレーターからのメッセージも対象にする","Timer":"タイマー","One message per line. If multiple messages, it will pick one randomly every X minutes.":"メッセージ1つに対して1行で入力してください。 複数のメッセージが入力されている場合、X分おきにランダムに選択されます。","Message":"メッセージ","The message to send.":"送信するメッセージ。","Invalid value.":"無効な値です。","Send every X minutes":"X分おきに送信する","Comments":"コメント","You can add here some comments about this rule, to remember how and why you created it. These comments are purely indicative, and have no influence on the bot's behavior.":"このルールに関するコメントを追加できます。作成した方法や理由を覚えておくために役立ちます。 これらのコメントは単なる参考情報であり、Botの動作には影響しません。","The bot will post the message every X minutes.":"BotはメッセージをX分おきに送信します。","Bot command":"Botコマンド","You can configure the bot to respond to commands. A command is a message starting with a \"!\", like for example \"!help\" that calls the \"help\" command.":"Botが応答するコマンドを設定できます。 コマンドは、メッセージの先頭に\"!\"をつけて使用します。たとえば、\"!help\"と入力することで、\"help\"コマンドが呼び出されます。","Command":"コマンド","The command, without the starting \"!\". For example \"help\", \"sponsor\", ...":"先頭の\"!\"を除いたコマンドを入力してください。たとえば、\"help\"、\"sponsor\"など…","For more information about how to configure this feature, please refer to the documentation by clicking on the help button.":"この機能の設定方法に関するより詳しい情報は、ヘルプボタンをクリックし、ドキュメントを参照してください。","Banned users and patterns":"追放するユーザーとパターン","Bot nickname":"Botのニックネーム","You can configure several timers that will send messages at regular interval. These messages will be sent by the bot every X minutes. You can for example make the bot sent some sponsoring information every 5 minutes.":"一定間隔でメッセージを送信するための複数のタイマーを設定できます。 これらのメッセージは、BotによってX分ごとに送信されます。 たとえば、Botからスポンサー情報を5分ごとに送信させることができます。","Messages":"メッセージ","Slow mode default value: <ul> <li>0: slow mode disabled</li> <li>Any positive integer: users can send a message every X seconds (moderators are not limited)</li> </ul>":"新しいチャットに適用される低速モードのデフォルト値: <ul> <li>0: 低速モード無効</li> <li>任意の整数: ユーザーはX秒毎にメッセージを送信可能 (モデレーターは無制限)</li> </ul>","You can choose from several different sets the default avatars that will be used for chat users. Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Settings</a>.":"チャットユーザーに使用するデフォルトのアバターをいくつかのセットから選択できます。 詳細はドキュメントを参照してください: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/ja/documentation/admin/settings/\" target=\"_blank\">設定</a>","Abstract":"抽象","Avatar set":"アバターセット","Cats":"猫","Sepia (Peertube mascot)":"Sepia (Peertubeのマスコットキャラクター)","Birds":"鳥","Fenecs (Mobilizon mascot)":"Fenecs (Mobilizonのマスコットキャラクター)","Legacy Sepia avatars (those included in previous plugin versions)":"以前のSepia アバター(以前のプラグインバージョンに含まれていたもの)","Slow mode":"低速モード","Slow mode is enabled, users can send a message every %1$s seconds.":"低速モードが有効になっているため、メッセージは%1$s秒ごとに送信できます。","<h3>External authentication</h3> For users that have no Peertube account, you can enable various authentication modes based on remote authentication providers.":"<h3>外部認証</h3> PeerTubeのアカウントをお持ちでないユーザー向けに、外部認証プロバイダーを使用した認証を有効にできます。","<h4>OpenID Connect</h4>":"<h4>OpenID Connect</h4>","Use an OpenID Connect provider":"Open ID Connectプロバイダーを使用する","Label for the connection button":"接続ボタンのラベル名","Discovery URL":"ディスカバリーURL","Client ID":"クライアントID","Client secret":"クライアントシークレット","You can configure an external OpenID Connect provider that could be used to log in to the chat. Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Settings</a>.":"チャットへのログインに、外部のOpenID Connectプロバイダーを設定できます。 次のドキュメントを参照してください: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/ja/documentation/admin/settings/\" target=\"_blank\">設定</a>ページ","This label will be displayed to users, as the button label to authenticate with this OIDC provider.":"このラベルは、OIDCプロバイダーを使用して認証するボタン名としてユーザーに表示されます。","Copied":"コピーしました","Terms & Conditions":"利用規約","Tasks":"タスク","Create new task list:":"新規タスクリストを作成:","Task list name":"タスクリスト名","Error when saving the task list":"タスクリストを保存中にエラーが発生しました","Are you sure you want to delete this task?":"このタスクを削除してもよろしいですか？","Delete task":"タスクを削除","<strong>Callback/Redirect URI:</strong> If you want to configure authorized redirection URI on the external Application, please add this url:":"<strong>Callback/Redirect URI:</strong> 外部アプリケーション上に認証されたリダイレクションURIを設定したい場合は、このURLを追加してください:","Use Google":"Googleを使用","Log in using an external account":"外部アカウントを使用してログイン","Log in using an account on another Peertube instance:":"ほかのPeerTubeインスタンスのアカウントを使用してログイン:","Your Peertube instance URL":"あなたのPeerTubeインスタンスURL","Invalid Peertube URL.":"無効なPeerTube URLです。","The livechat plugin is not installed on this Peertube instance.":"このPeerTubeインスタンスには、ライブチャットプラグインがインストールされていません。","Try anyway to open the video on the Peertube instance":"PeerTubeインスタンスで動画を開く","Anonymize moderation actions":"モデレーション操作を匿名化","Error when saving the note":"ノートを保存中にエラーが発生しました","Create a new note":"新規ノートを作成","Description":"概要","Delete note":"ノートを削除","Are you sure you want to delete this note?":"このノートを削除してもよろしいですか？","Search filters":"フィルタ検索","Nickname of the participant at the time of the note creation":"ノート作成時の参加者のニックネーム","Client to server network interfaces":"クライアントとサーバー間のネットワークインタフェース","This video is not available on this Peertube instance.":"この動画はこのPeerTubeインスタンス上では利用できません。","None":"なし","There was an error during validation.":"検証中にエラーが発生しました。","This value is required.":"この項目は必須です。","Value is of the wrong type.":"誤った形式の値です。","Too many entries":"エントリーが多すぎます","This chatroom does not exist, or is not accessible to you.":"このチャットルームは存在しないか、アクセス権限がありません。","Searching the video on the Peertube instance...":"PeerTubeインスタンス上の動画を検索中...","Your browser has blocked the opening on the remote instance, please try to open manually this link:":"お使いのブラウザーはリモートインスタンスを開くことがブロックされています。このリンクを手動で開いてください:","Delete task list":"タスクリストを削除","Are you sure you want to delete this task list?":"このタスクリストを削除してもよろしいですか？","Create a new task":"新規タスクを作成","Task name":"タスク名","Please choose a task list":"タスクリストを選択してください","Short name":"短縮名","You can use emojis in the chat using \":shortname:\". The short name can start and/or end by a colon (:), and only contain alphanumerical characters, underscores and hyphens. It is strongly recommended to start them by a colon, so that users can use autocompletion (by typing \":\" then press TAB).":"チャット上で、絵文字を\":shortname:\"で使用できます。 短縮名は、先頭と末尾にコロン(:)があり、英数字、アンダーバー、ハイフンのみが含まれている必要があります。 自動補完(\":\"を入力後、Tabキーを押下)を利用できるようコロンから入力することを強くお勧めします。","File":"ファイル","Become moderator":"モデレーターにする","The emoji file.":"絵文字に使用するファイルです。","Import":"インポート","Export":"エクスポート","If imported data are okay, don't forgot to save the form.":"インポートしたデータが問題ない場合、フォームを保存することを忘れないでください。","Remove this entry":"このエントリーを削除","Are you sure you want to remove this entry?":"このエントリーを削除してもよろしいですか？","An error occured while loading data.":"データの読み込み中にエラーが発生しました。","Embed":"埋め込み","This link will open the chat within the Peertube interface.":"このリンクで、PeerTubeインスタンス内でチャットが開きます。","Password token":"パスワードトークン","Date":"日付","Create a new token":"新規トークンを作成","Revoke the token":"トークンを無効化","Token generated from the web interface":"Web UIから生成されたトークン","Users can generate long term tokens to connect to the chat. These tokens can for example be used to include the chat in OBS web docks. Check <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/user/obs\" target=\"_blank\">the documentation</a> for more information. You can disable this feature by checking this setting.":"ユーザーはチャットに接続するための長期的なトークンを生成できます。 これらのトークンは、OBSのカスタムブラウザドックなどで使用できます。 詳細は、<a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/user/obs\" target=\"_blank\">ドキュメント</a>をご確認ください。 この設定にチェックをつけることで、この機能を無効にできます。","Only registered users can send messages.":"登録済みユーザーのみがメッセージを送信できます。","Mute anonymous users":"匿名ユーザーをミュート","Default value for new chatrooms. For existing chatrooms, you can change the feature in the room configuration form. When this feature is enabled, anonymous users can only read the chat, and not send messages.":"新規チャットルームのデフォルト値です。 既存のチャットルームは、ルーム設定フォーム内の機能で変更できます。 この設定が有効の場合、匿名ユーザーはチャットは閲覧のみ可能で、メッセージの送信はできません。","Channel's chat terms & conditions":"チャンネルのチャットルームの利用規約","You can configure a \"terms & conditions\" message that will be shown to users joining your chatrooms.":"ユーザーがチャットルームに参加する際に表示される\"利用規約\"メッセージを設定します。","Create a new poll":"新規投票を作成","Poll":"投票","New poll":"新規投票","Complete and submit this form to create a new poll. This will end and replace any existing poll.":"投票を作成するには、内容を設定して送信してください。既存の投票は終了し、この投票で置き換えられます。","Question":"質問","Poll duration (in minutes)":"投票期間 (分)","Anonymous results":"匿名の結果","Choice {{N}}:":"選択肢 {{N}}:","Poll ends at:":"投票は次で終了:","To vote, click on your choice or send a message with an exclamation mark followed by your choice number (Example: !1).":"投票するには、選択肢をクリックするか、感嘆符(!)を付与した後に選択肢番号を入力してメッセージを送信してください（例: !1）。","Send a message with an exclamation mark followed by your choice number to vote. Example: !1":"投票するには、感嘆符(!)を付与した後に選択肢番号を入力してメッセージを送信してください。例: !1","This poll is now over.":"この投票は終了しました。","Your vote has been taking into account, the counters will be updated in a moment.":"あなたの投票は受け付けられ、まもなくカウンターが更新されます。","Moderation delay":"モデレーションの遅延時間","Moderation delay default value: <ul> <li>0: moderation delay disabled</li> <li>Any positive integer: messages will be delayed for X seconds for non-moderator participants, allowing moderators to delete message before any user can read it.</li> </ul>":"モデレーションの遅延時間のデフォルト値: <ul> <li>0: モデレーション遅延無効</li> <li>任意の整数値n: モデレーター以外の参加者からのメッセージはn秒後に表示されるようになり、モデレーターはメッセージが他の参加者に読まれる前に削除することができます。</li> </ul>","Label":"ラベル","Label for this forbidden words rule":"この禁止語規則のラベル","In some cases, the video can still be retrieved if you connect to the remote instance.":"場合によっては、外部インスタンスに接続できれば動画を取得できることがあります。","Authentication failed":"認証に失敗しました","Value is not in authorized range.":"値が許可された範囲にありません。","Search all messages":"全てのメッセージを検索","Message search":"メッセージ検索","These terms & conditions will be shown to all users when then join chatrooms. Streamers can also configure terms & conditions for their channels, that will be shown right after these global terms & conditions.":"この利用規約はチャットルームに参加する際に全てのユーザーに表示されます。 配信者はこの利用規約に加えて、チャンネル独自の利用規約を設定できます。チャンネル独自の利用規約は全てのユーザー向けの利用規約の右側に表示されます。","Value too long":"値が大きすぎます","Moderation notes":"モデレーションノート","Search notes":"ノートを検索","Nickname of the participant when the message was sent":"メッセージ送信時の参加者のニックネーム","Enable Prosody mod_firewall":"Prosody mod_firewallを有効にする","<a class=\"peertube-button-link orange-button secondary-button\" href=\"/p/livechat/admin/firewall\" target=\"_blank\">Configure mod_firewall</a>":"<a class=\"peertube-button-link orange-button secondary-button\" href=\"/p/livechat/admin/firewall\" target=\"_blank\">mod_firewallを設定</a>","Enabled":"有効","Name":"名前","Can only contain: alphanumerical characters, underscores and hyphens. Scripts will be loaded in alphabetical order.":"次の値のみ利用可能: 英数字、アンダーバー、ハイフン。 スクリプトは、英字順で読み込まれます。","File content":"ファイルコンテンツ","Channel emojis":"チャンネルの絵文字","File size is too big (max size: %s).":"ファイルサイズが大きすぎます(最大ファイルサイズ: %s)。","Add an entry":"エントリーを追加","Dock":"ドック","Disable livechat tokens":"ライブチャットトークンを無効化","Are you sure you want to revoke this token?":"子のトークンを無効化してよろしいですか？","<h3>Authentication</h3>":"<h3>認証</h3>","This choice is not valid.":"この選択肢は無効です。","Your vote is taken into account. Votes are anonymous, they will not be shown to other participants.":"あなたの投票を受け付けました。投票は匿名で行われ、他の参加者には表示されません。","Once you have chosen a task list, a new task will be created. To see the task, open the task application using the top menu. More information in the livechat plugin documentation.":"タスクリストを選択すると、新しいタスクが作成されます。 タスクを確認するには、トップメニューからタスクアプリケーションを開いてください。 詳細については、ライブチャットプラグインのドキュメントを参照してください。","You can generate a link that will open the chat in full page, logged in with your Peertube account. This can be use, for example, to have a web dock in your OBS, so you can read and interact with the chat directly from OBS. Don't share this link to anyone, as it would allow them to connect as yourself. Please find bellow the list of authentication token you have already generated. You can create a new one, or revoke any previous token. Please note that these tokens have no expiration date.":"チャットページを新規ページかつPeerTubeアカウントにログインした状態で開くリンクを生成できます。 例えばこのリンクをOBSのカスタムブラウザドックに設定し、OBS上から直接チャットを読んだり、反応することができるようになります。 このリンクは、あなた自身として接続するため、外部には絶対に公開しないでください。 既に生成した認証トークンのリストを以下から見つけてください。 新しいトークンを生成したり、既に生成済みのトークンを無効化できます。 これらのトークンには有効期限はありません。","Anonymize moderation actions default value for new rooms. When this is enabled, moderation actions will be anonymized, to avoid disclosing who is banning/kicking/… occupants.":"新しいルームに対するモデレーションアクションの匿名化をデフォルトにします。 これを有効にすると、誰がユーザーを追放、キックなどのモデレーションアクションを実施したのかを匿名化します。","You can enable <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a> on your Prosody server. For more information, please check <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/mod_firewall/\" target=\"_blank\">the documentation</a>.":"お使いのProsodyサーバーの<a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a>を有効にできます。 詳しくは、<a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/mod_firewall/\" target=\"_blank\">ドキュメント</a>をご確認ください。","Prosody mod_firewall configuration":"Prosody mod_firewallの設定","Here you can configure Prosody <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a> module. You can create multiple configuration files bellow, and change their order. Don't hesitate to share your configurations with the community (for example by adding some examples in the plugin documentation).":"ここでProsody <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a>モジュールの設定が可能です。 複数の設定ファイルを作成し、以下から順番を変更できます。 最適な設定が出来たら、コミュニティメンバーと設定を共有してみてください（プラグインドキュメントに掲載させていただくこともあります）。","Warning: mod_firewall is disabled in the livechat <a href=\"/admin/plugins/show/peertube-plugin-livechat\" target=\"_blank\">plugin settings</a>, you have to enable it if you want this configuration to be taken into account.":"警告: mod_firewallは、ライブチャットの<a href=\"/admin/plugins/show/peertube-plugin-livechat\" target=\"_blank\">プラグイン設定</a>で無効になっており、この設定を反映するには、機能を有効にする必要があります。","There is no task list for now, please first create one":"タスクリストが存在しません。新規作成してください","Use Facebook":"Facebookを使用","Enabling this adds a \"login with Facebook\" button. You have to configure a Facebook OAuth application.":"有効にすると\"Facebookでログイン\"ボタンを追加します。 Facebook OAuthアプリケーションの設定が必要です。","Enabling this adds a \"login with Google\" button. You have to configure a Google OAuth application.":"有効にすると\"Googleでログイン\"ボタンを追加します。 Google OAuthアプリケーションの設定が必要です。","The network interfaces to listen on for client to server connections.<br> This setting is provided for advanced users. Don't change this setting if you don't fully understand what it means.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>127.0.0.1, ::1, 172.18.0.42</li> </ul>":"クライアントとサーバー間接続のためにリッスンするネットワークインターフェイスです。<br> この設定は、より高度な設定が可能なユーザー向けに提供されています。設定内容を完全に理解できていない場合は変更しないでください。<br> リッスンするIPのリストをコンマ区切り(スペースは削除されます)で指定してください。<br> «*»を指定することで全てのIPv4アドレス、«::»を指定することで全てのIPv6アドレスをリッスンします。<br> 例: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>127.0.0.1, ::1, 172.18.0.42</li> </ul>","Value is in the wrong format.":"誤ったフォーマットの値です。","Duplicate value":"重複した値です","You can configure custom emojis for your channel. These emojis will be available in the emoji picker. Users can also use them by with their short name (for example by writing \":shortname:\").":"チャンネルのカスタム絵文字を設定できます。 これらの絵文字は、絵文字ピッカーから利用できます。 絵文字は、短縮名でも使用できます。（例えば\":shortname:\"）","Chat":"チャット","Emojis only mode":"絵文字のみモード","You can enable an \"Emojy only mode\" in your chatrooms. When this mode is enabled, participants can only send emojis (standard, or channel custom emojis). Moderators are not affected by this limitation.":"チャットルームで\"絵文字のみモード\"を有効にできます。 このモードが有効な時は、参加者は絵文字（標準またはチャンネル専用のカスタム絵文字）のみを送信できます。 モデレーターはこの制限の影響を受けません。","Enable the emoji only mode on all channel's chatrooms":"絵文字のみモードを全てのチャンネルのチャットルームに適用する","Emoji only mode is enabled, you can only use emoji in your messages.":"絵文字のみモードが有効な場合、メッセージ内で絵文字のみ使用できます。","This mode can be usefull for example: <ul> <li>To avoid spam or offensive message when you are not here to moderate.</li> <li>When there are too many speaking participants, and you can't no more moderate correctly.</li> </ul>":"このモードは次のような場合に効果があります: <ul> <li>スパムまたはモデレーターがいない場合に攻撃的なメッセージを抑止するため。</li> <li>多数の参加者が存在し、正確なモデレーションが実施できない場合のため。</li> </ul>","Tolerance":"許容範囲","To enable or disable this mode, you can use the room configuration form. If you want to enable it for all your chatrooms at once, you can use the button bellow.":"この機能の設定切り替えは、ルーム設定フォームから可能です。 一度にあなたの全てのチャットルームにこの設定を適用する場合は、以下のボタンをクリックしてください。","By enabling this option, the moderation bot will automatically delete messages containing more than X special characters. Special characters are those that don't fit into one of these categories: letters, numbers, punctuation symbols, currency symbols, emojis.":"このオプションを有効にすると、モデレーションBotは、X文字以上の特殊文字が含まれるメッセージを自動的に削除します。 特殊文字は、文字、数字、句読点記号、通貨記号、絵文字のいずれにも当てはまらないものを指します。","By default, moderator messages will not be affected by this feature. By checking this option, messages from moderators will also be deleted.":"初期状態では、モデレーターメッセージはこの機能の影響を受けません。 このオプションを有効にすると、モデレーターからのメッセージも削除されるようになります。","Forbid special characters":"特殊文字を禁止する","Number of special characters to accept in a message without deleting it.":"削除しない特殊文字の文字数を指定してください。","This feature comes with the livechat plugin version X.X.X.":"この機能は、livechatプラグイン バージョン X.X.Xにて登場します。","Time interval":"間隔","The interval, in seconds, during which a user can't send again the same message.":"ユーザーが同じメッセージを再度送信するために空けなければいけない時間を秒単位で指定してください。","No duplicate message":"重複したメッセージはありません","By enabling this options, the moderation bot will automatically moderate duplicate messages. That means if a user send the same message twice within X seconds, the second message will be deleted.":"このオプションを有効にすると、モデレーションBotが重複したメッセージに自動的に対応します。 これは、もしユーザーが同じメッセージX秒以内に2回送信した場合に、2回目のメッセージを削除します。","Message type":"メッセージタイプ","Standard":"標準","Announcement":"アナウンス","Highlight":"ハイライト","Warning":"警告","_language":"ja"}