{"You can find the plugin documentation here: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Peertube Plugin Livechat documentation </a>.":"Hier vind je de documentatie van de plugin: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/nl\" target=\"_blank\"> Peertube Plugin Livechat documentatie </a>.","<h3>Federation</h3> Following settings concern the federation with other Peertube instances, and other fediverse softwares.":"<h3>Federatie</h3> De volgende instellingen gaan over het federeren met andere PeerTube-exemplaren en andere fediverse-software.","Open chat":"Chat openen","Open chat in a new window":"Chat openen in nieuw venster","Close chat":"Chat sluiten","Use chat":"Chat activeren","If enabled, there will be a chat next to the video.":"Indien geactiveerd zal er naast de video een chat zijn.","Share chat link":"Link naar deze chat delen","Read-only":"Alleen leesbaar","Show the scrollbar":"Toon de schuifbalk","Transparent background (for stream integration, with OBS for example)":"Doorzichtige achtergrond (bijvoorbeeld voor stream-integratie met OBS)","Tips for streamers: To embed the chat in your video stream using OBS for example, generate a read-only link and use it as a browser source.":"Tips voor streamers: Om de chat aan je OBS toe te voegen genereer je een alleen-leesbare link en gebruik je die als een “browser source”.","Copy":"Kopiëren","Link copied":"Link gekopieerd","Error":"Fout","Open":"Openen","Use current theme colors":"Gebruik kleuren van huidige thema","Generate an iframe to embed the chat in a website":"Genereer een iframe-element om de chat in een webpagina te integreren","Chat for live stream:":"Chat voor de livestream:","Room name":"Naam van chatroom","Room description":"Beschrijving van chatroom","Not found":"Niet gevonden","Video":"Video","Channel":"Kanaal","Last activity":"Laatste activiteit","Web":"Web","Connect using XMPP":"Via XMPP verbinden","You can connect to the room using an external XMPP account, and your favorite XMPP client.":"Je kan de chatroom betreden via een extern XMPP-account en je favoriete XMPP-app.","<h3>Important notes</h3>":"<h3>Belangrijke opmerkingen</h3>","Before asking for help, please use the diagnostic tool: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Launch diagnostic</a> (if this button is not opening a new window, please try to refresh the page).":"Gebruik a.u.b. de diagnostische tool voordat je om hulp vraagt: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Diagnose starten</a> (als deze knop geen nieuw venster opent, probeer dan de pagina te verversen).","<h3>Chat</h3>":"<h3>Chat</h3>","List existing rooms":"Lijst van bestaande chatrooms weergeven","<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">List rooms</a>":"<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">Toon chatrooms</a>","By checking this setting, your instance will never display chats from remote videos.":"Met deze instelling toont jouw exemplaar geen chats bij videos van elders.","Don't display remote chats":"Geen chats van andere exemplaren tonen","Don't publish chat information":"Chat-informatie niet openbaren","By checking this setting, your instance will not publish chat information on the fediverse. Remote Peertube instances will not be aware that they are chat rooms associated to your videos.<br> <b>Please note</b>: if you already had chats in progress, it is possible that the information has already been published. You will have to wait for the next video update before the information is unpublished. Also, if you disable this setting, you'll have to wait for the videos to be updated before the information are published again. This update happens among others when a live event resumes or stops.<br> <b>Please note</b>: this setting only affects the publication of information via the ActivityPub protocol. It will not prevent a remote application from otherwise detecting the presence of chats, and trying to connect to it.":"Door deze instelling te activeren zal jouw exemplaar geen informatie over chats delen met de rest van de fediverse. Andere PeerTube-exemplaren zullen niet weten dat er chatrooms bij jouw videos zijn.<br> <b>Pas op</b>: Als je al chats hebt lopen, dan kan het zijn dat informatie daarover al gedeeld is. Je moet wachten op de volgende video-update voor het delen ongedaan wordt gemaakt. Bovendien, als je deze instelling de-activeert, zal je moeten wachten tot de volgende video-update voor de informatie weer wordt gedeeld. Deze update gebeurt onder andere wanneer een live-evenement verdergaat of stopt.<br> <b>Pas op</b>: Deze instelling betreft enkel het delen van informatie via het ActivityPub-protocol. Het voorkomt niet dat een applicatie op een andere manier de chats ontdekt, en ermee probeert te verbinden.","<h3>Chat behaviour</h3>":"<h3>Chatgedrag</h3>","Room type":"Kamertype","Show the «open in new window» button":"Laat de «Open in een nieuw venster» knop zien","When watching a video, the chatbox will automatically open.":"Bij het kijken van een video zal de chat automatisch geopend worden.","There will be a button for opening the web chat in a new window.":"Er zal een knop komen om de chat in een nieuw venster te openen.","Online help":"Online hulp","You can choose here to have separate rooms for each video, or to group them by channel.":"Je kunt er hier voor kiezen om aparte kamers te hebben voor elk video, of om ze per kanaal te groeperen.","Each video has its own webchat room":"Elk video heeft zijn eigen gespreksruimte","Webchat rooms are grouped by channel":"Gesprekskamers zijn gegroepeerd per kanaal","Automatically open the chat":"Automatisch de chat openen","Show the «share chat link» button":"Laat de «deel chat-link» knop zien","_language":"nl"}