{"Chat":"Chat","Online help":"Ajuda Online","Open chat":"Abrir chat","Open chat in a new window":"Abrir chat em nova janela","Close chat":"Fechar chat","Use chat":"Usar chat","If enabled, there will be a chat next to the video.":"Se habilitado, haverá um chat próximo ao vídeo","Share chat link":"Compartilhar link do chat","Read-only":"Somente leitura","Show the scrollbar":"Exibir barra de rolagem","Transparent background (for stream integration, with OBS for example)":"Fundo transparente (para integração com sistemas de transmissão, como por exemplo OBS)","Tips for streamers: To embed the chat in your video stream using OBS for example, generate a read-only link and use it as a browser source.":"Dica para streamers: Para embutir o chat na sua transmissão de vídeo, usando OBS por exemplo, gere um link somente-leitura e o utiliza como a fonte no navegador.","Copy":"Copiar","Copied":"Copiado","Link copied":"Link copiado","Error":"Erro","Open":"Abrir","Use current theme colors":"Utilizar cores do tema atual","Generate an iframe to embed the chat in a website":"Gerar um iframe para embutir o chat em uma página","Chat for live stream:":"Chat para transmissão ao vivo:","Room name":"Nome da sala","Room description":"Descrição da sala","Not found":"Não encontrado","Video":"Vídeo","Channel":"Canal","Last activity":"Última atividade","Web":"Web","Connect using XMPP":"Conectar usando XMPP","You can connect to the room using an external XMPP account, and your favorite XMPP client.":"Você pode se conectar a sala utilizando uma conta externa XMPP e o seu cliente XMPP favorito.","<h3>Important notes</h3>":"<h3>Notas importantes</h3>","You can find the plugin documentation here: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Peertube Plugin Livechat documentation </a>.":"Você pode encontrar a documentação do plugin em: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Documentação do Peertube Plugin Livechat </a>.","Before asking for help, please use the diagnostic tool: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Launch diagnostic</a> (if this button is not opening a new window, please try to refresh the page).":"Antes de solicitar ajuda, por favor utilize a ferramenta de diagnóstico: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Abrir diagnóstico</a> (se este botão não estiver abrindo uma nova janela, tente por favor recarregar a página).","<h3>Chat</h3>":"<h3>Chat</h3>","Terms & Conditions":"Termos e Condições","These terms & conditions will be shown to all users when then join chatrooms. Streamers can also configure terms & conditions for their channels, that will be shown right after these global terms & conditions.":"Estes termos e condições serão exibidos para todos usuários ao entrarem nas salas de chat. Streamers podem configurar termos e condições para os seus canais, que serão exibidos logo em seguida aos termos e condições globais.","List existing rooms":"Listar salas existentes","<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">List rooms</a>":"<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">Listar salas</a>","<h3>Federation</h3> Following settings concern the federation with other Peertube instances, and other fediverse softwares.":"","Don't display remote chats":"Não exibir chats remotos","By checking this setting, your instance will never display chats from remote videos.":"Ao selecionar esta configuração, sua instância nunca irá exibir chats de vídeos remotos.","Don't publish chat information":"Não publicar informações do chat","By checking this setting, your instance will not publish chat information on the fediverse. Remote Peertube instances will not be aware that they are chat rooms associated to your videos.<br> <b>Please note</b>: if you already had chats in progress, it is possible that the information has already been published. You will have to wait for the next video update before the information is unpublished. Also, if you disable this setting, you'll have to wait for the videos to be updated before the information are published again. This update happens among others when a live event resumes or stops.<br> <b>Please note</b>: this setting only affects the publication of information via the ActivityPub protocol. It will not prevent a remote application from otherwise detecting the presence of chats, and trying to connect to it.":"Ao selecionar esta configuração, sua instância não irá publicar informação de chat no fediverso. Instâncias remotas do Peertube não estarão cientes de que elas são salas de chat associadas aos seus vídeos.<br> <b>Atenção</b>: se você já possui chats em andamento, é possível que esta informação já tenha sido publicada. Você deverá aguardar até a próxima atualização do vídeo antes que a informação seja despublicada. Também, se você desabilitar esta configuração, você deverá aguardar os vídeos serem atualizados antes que a informação seja publicada novamente. Esta atualização acontece sobre as outras quando um evento ao vivo retorna ou se encerra.<br> <b>Atenção</b>: esta configuração apenas afeta a publicação de informação via protocolo ActivityPub. Não irá impedir uma aplicação remota de detectar a presenção de chats de outra maneira, e de tentar conectar-se a ele.","<h3>External authentication</h3> For users that have no Peertube account, you can enable various authentication modes based on remote authentication providers.":"<h3>Autenticação externa</h3> Para usuários que não possui uma conta no Peertube, você pode habilitar vários modos de autenticação baseados em provedores de autenticação remotos.","<h4>OpenID Connect</h4>":"<h4>OpenID Connect</h4>","Use an OpenID Connect provider":"Usar um provedor OpenID Connect","You can configure an external OpenID Connect provider that could be used to log in to the chat. Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Settings</a>.":"Você pode configurar um provedor externo de OpenID Connect que poderá ser utilizado para autenticar-se ao chat. Por favor, consulte a documentação: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Configurações</a>.","Label for the connection button":"Etiqueta para o botão de conexão","This label will be displayed to users, as the button label to authenticate with this OIDC provider.":"Esta etiqueta será exibida aos usuários, como o etiqueta do botão a ser autenticado com esse provedor OIDC.","Discovery URL":"","Client ID":"","Client secret":"","<strong>Callback/Redirect URI:</strong> If you want to configure authorized redirection URI on the external Application, please add this url:":"","Use Google":"Usar Google","Enabling this adds a \"login with Google\" button. You have to configure a Google OAuth application.":"","Use Facebook":"Usar Facebook","Enabling this adds a \"login with Facebook\" button. You have to configure a Facebook OAuth application.":"","<h3>Chat behaviour</h3>":"<h3>Comportamento do chat</h3>","Room type":"Tipo de sala","You can choose here to have separate rooms for each video, or to group them by channel.":"Você pode escolher aqui ter salas separadas para cada vídeo ou agrupá-las por canal.","Each video has its own webchat room":"Cada vídeo tem sua própria sala de chat","Webchat rooms are grouped by channel":"Salas de chat são agrupadas por canal","Automatically open the chat":"Abrir chat automaticamente","When watching a video, the chatbox will automatically open.":"","Show the «open in new window» button":"Exibir o botão «abrir em nova janela»","There will be a button for opening the web chat in a new window.":"","Show the «share chat link» button":"Exibir o botão «compartilhar link do chat»","There will be a button for sharing a chat url (could be used for OBS integration, for example).":"","Show for nobody":"Exibir para ninguém","Show for everyone":"Exibir para todos","Show for the video owner":"Exibir para o proprietário do vídeo","Show for the video owner and instance's moderators":"Exibir para o proprietário do vídeo e moderadores da instância","Users can activate the chat for their lives":"Usuários podem ativar o chat para suas transmissões ao vivo","If checked, all live videos will have a checkbox in their properties for enabling the web chat.":"","<span class=\"peertube-plugin-livechat-warning\"> You have enabled the setting «Users can activate the chat for their lives». It is redundant with the «Activate chat for all lives» setting. </span>":"","Activate chat for all lives":"Ativar chat para todas as transmissões","If checked, the chat will be enabled for all lives.":"","Activate chat for all non-lives":"","If checked, the chat will be enabled for all video that are not lives.":"","Activate chat for these videos":"Ativar chat para estes vídeos","Videos UUIDs for which we want a web chat. Can be non-live videos. One per line. <br /> You can add comments: everything after the # character will be stripped off, and empty lines ignored.<br /> Don't add private videos, the UUIDs will be sent to the frontend.":"","Hide the chat for anonymous users":"Ocultar chat para usuários anônimos","If checked, anonymous Peertube users won't see the chat. This feature is still experimental. If you enabled it, it is highly recommended to also check \"Don't publish chat information\". Otherwise, some third party tools could try to open the chat, and have unpredictable behaviours.":"","Ban anonymous user's IP when user is banned from a chatroom":"","By enabling this option, each time an anonymous user is banned from a chatroom, it's IP will also be banned from the chat server. Warning: if your instance is open to registration, any user could create a trapped-room, invite users to join, and automatically ban all anonymous user's IPs. The banned IP list is not stored, it will be cleared on server restart, or when you change some plugin's settings. The banned IP are logged in the Prosody server log files, so server's administrators can eventually use some external tools (like fail2ban) to ban IPs more widely.":"","<h3>Theming</h3>":"<h3>Temas</h3>","Avatar set":"","You can choose from several different sets the default avatars that will be used for chat users. Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Settings</a>.":"","Sepia (Peertube mascot)":"Sepia (mascote do Peertube)","Cats":"Gatos","Birds":"Pássaros","Fenecs (Mobilizon mascot)":"Fenecs (mascote do Mobilizon)","Abstract":"Abstrato","Legacy Sepia avatars (those included in previous plugin versions)":"","None":"Nenhum","ConverseJS theme":"Tema do ConverseJS","Please choose the converseJS theme you want to use.":"Por favor, escolha o tema do ConverseJS que você deseja utilizar.","Peertube theme":"Tema do Peertube","Default ConverseJS theme":"Tema padrão do ConverseJS","ConverseJS Cyberpunk theme":"Tema Cyberpunk do ConverseJS","Automatic color detection":"Detecção automática de cor","Try to autodetect colors from user's current theme.<br> When this setting is enabled, the plugin tries to auto-detect colors to apply to the chat theme.<br> If this is not correctly working for some of your Peertube theme, you can disable this option. You can report the bug on the official <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> issue tracker </a>. Don't forget to specify which theme is not working.":"","Webchat iframe style attribute":"","Additional styles to be added on the iframe style attribute. <br> Example: height:400px;":"","<h3>Chat server advanced settings</h3>":"","Prosody server":"Servidor Prosody","This plugin uses the Prosody XMPP server to handle chat rooms.<br> This plugin comes with a Prosody AppImage, that will be used to run the service.":"","Use system Prosody":"Usar Prosody do sistema","Warning: don't check this setting if you are not sure of what you are doing.<br> By checking this setting, your Peertube will use the Prosody server that comes with your system, and not the embedded AppImage.<br> Only use this if you encounter problems with the embedded Prosody.":"","Disable Websocket":"Desabilitar Websocket","With Peertube &gt;= 5.0.0, this plugin try to use Websocket connection for chatting. If the user's browser or connection is incompatible, the browser will automatically fall back on the BOSH protocol. <br> But in rare case, this can fail. For example, if you have a reverse proxy in front of Peertube that does not allow Websocket connection for plugins. In this case, you can check this setting to disable Websocket connections.":"","Prosody port":"Porta do Prosody","The port that will be used by the Prosody server.<br> Change it if this port is already in use on your server.<br> You can close this port on your firewall, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"","Peertube url for API calls":"URL do Peertube para chamada de API","Please let this setting empty if you don't know what you are doing.<br> In some rare cases, Prosody can't call Peertube's API from its public URI. You can use this field to customize Peertube's URI for Prosody modules (for example, with «http://localhost:9000» or «http://127.0.0.1:9000»).":"","Log rooms content by default":"Logar conteúdo das salas por padrão","If checked, room contents will be saved by default. Any user who joins a room will see what was written before they joins.<br> Please note that it is always possible to enable/disable the content archiving for a specific room, by editing its properties.":"","Room logs expiration":"Expiração dos logs de sala","You can choose here how long the chatting room's content is kept by the server. The value can be: <ul> <li><b>60</b>: the content will be saved for 60 <b>seconds</b>. You can replace 60 by any integer value.</li> <li><b>1d</b>: the content will be saved for 1 <b>day</b>. You can replace 1 by any integer value.</li> <li><b>1w</b>: the content will be saved for 1 <b>week</b>. You can replace 1 by any integer value.</li> <li><b>1m</b>: the content will be saved for 1 <b>month</b>. You can replace 1 by any integer value.</li> <li><b>1y</b>: the content will be saved for 1 <b>year</b>. You can replace 1 by any integer value.</li> <li><b>never</b>: the content will never expire, and will be kept forever.</li> </ul>":"","Enable connection to room using external XMPP accounts":"","By enabling this option, it will be possible to connect to rooms using external XMPP accounts and XMPP clients.<br> <span class=\"peertube-plugin-livechat-warning\"> <b>Warning</b>, enabling this option can request extra server and DNS configuration. </span> Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/advanced/xmpp_clients/\" target=\"_blank\"> Enable external XMPP account connections. </a>":"","Prosody server to server port":"","The port that will be used for XMPP s2s (server to server) connections.<br> You should use the standard 5269 port. Otherwise you should <a href=\"https://prosody.im/doc/s2s\"> setup a specific DNS record </a>.":"","Server to server network interfaces":"","The network interfaces to listen on for server to server connections.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>":"","Certificates folder":"Pasta dos certificados","If this field is empty, the plugin will generate and use self-signed certificates.<br> If you want to use other certificates, just specify here the folder where Prosody can find them. Note: the \"peertube\" user must have read access to this folder.":"","Enable client to server connections":"Habilitar conexões de cliente para servidor","Enable XMPP clients to connect to the built-in Prosody server.<br> This option alone only allows connections from localhost clients.":"Habilite os clientes XMPP para se conectarem ao servidor Prosody integrado.<br> Esta opção sozinha permite apenas conexões em localhost.","Prosody client to server port":"","The port that will be used by the c2s module of the built-in Prosody server.<br> XMPP clients shall use this port to connect.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall for now, it will not be accessed from the outer world.<br> Note: this might change in a near future, as it is planned to add a feature to activate external connections.":"A porta que será usada pelo módulo c2s do servidor Prosody integrado.<br> Os clientes XMPP devem usar essa porta para se conectar.<br> Altere-o se esta porta já estiver em uso em seu servidor.<br> Você pode manter esta porta fechada em seu firewall por enquanto, ela não será acessada do mundo exterior.<br> Nota: isso pode mudar em um futuro próximo, pois está planejado adicionar um recurso para ativar conexões externas.","Client to server network interfaces":"","The network interfaces to listen on for client to server connections.<br> This setting is provided for advanced users. Don't change this setting if you don't fully understand what it means.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>127.0.0.1, ::1, 172.18.0.42</li> </ul>":"As interfaces de rede para escutar conexões de cliente para servidor.<br> Esta configuração é fornecida para usuários avançados. Não altere essa configuração se você não entender completamente o que ela significa.<br> Lista de IP para ouvir, separados por vírgula (os espaços serão removidos).<br> Você pode usar «*» para escutar em todas as interfaces IPv4 e «::» para todas as interfaces Ipv6.<br> Exemplos: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>127.0.0.1, ::1, 172.18.0.42</li> </ul>","Enable custom Prosody external components":"","Enable the use of external XMPP components.<br> This option alone only allows connections from localhost. You have to setup the listening interfaces and open the port on your firewall to make it available from remote servers.<br> This feature can, for example, be used to connect some bots to the chatting rooms.":"","Prosody external components port":"","The port that will be used by XMPP components to connect to the Prosody server.<br> Change it if this port is already in use on your server.<br> You can keep this port closed on your firewall if you don't allow access on interfaces other than localhost.":"","Prosody external components network interfaces":"","The network interfaces to listen on for external components connections.<br> List of IP to listen on, coma separated (spaces will be stripped).<br> You can use «*» to listen on all IPv4 interfaces, and «::» for all IPv6.<br> Examples: <ul> <li>*, ::</li> <li>*</li> <li>127.0.0.1, ::1</li> <li>172.18.0.42</li> </ul>":"","External components":"Componentes externos","The external components to declare: <ul> <li>One per line.</li> <li>Use the format «component_name:component_secret» (spaces will be trimmed).</li> <li>You can add comments: everything after the # character will be stripped off, and empty lines ignored.</li> <li>The name can only contain latin alphanumeric characters and dots.</li> <li> If the name contains only alphanumeric characters, it will be suffixed with the XMPP domain. For example, «bridge» will become «bridge.your_domain.tld». You can also specify a full domain name, but you have to make sure to configure your DNS correctly. </li> <li>Only use alphanumeric characters in the secret passphrase (use at least 15 characters).</li> </ul>":"","<b class=\"peertube-plugin-livechat-experimental\">Experimental feature:</b> this feature is still experimental.":"","<h3>Channel advanced configuration</h3> Following settings concern the advanced channel options: users will be able to add some customization on their channels, activate the moderation bot, ...":"","Disable the advanced channel configuration and the chatbot":"","Save":"Salvar","Cancel":"Cancelar","Successfully saved":"","Chatrooms":"Salas de chat","Configure your live's chatrooms":"","Here you can configure some advanced options for chatrooms associated to your live streams.":"","Please select bellow one of your channel, to setup its chatting options.":"","Channel options":"Opções de canal","You can setup here some options for this channel (moderation policies, ...).":"","Slow mode":"Modo lento","Slow mode default value: <ul> <li>0: slow mode disabled</li> <li>Any positive integer: users can send a message every X seconds (moderators are not limited)</li> </ul>":"","Enable moderation bot":"Ativar bot de moderação","Moderation bot options":"Opções do bot de moderação","Forbidden words or expressions":"Expressões ou palavras proibidas","You can configure some words that will be automatically moderated by the bot (messages containing such words will be instantly deleted). You can also add an optional reason that will be displayed at the place of deleted messages. Several examples are provided on the documentation page.":"","One word or expression per line. If you put multiple words on one line, it will only match messages containing the whole sequence.":"","Reason":"Motivo","Reason to display besides deleted messages":"","Consider as regular expressions":"Considerar como expressões regulares","By checking this option, you can use regular expressions.":"","Label":"","Label for this forbidden words rule":"","Also moderate messages from moderators":"","By default, moderator messages will not be affected by this feature. By checking this option, messages from moderators will also be deleted.":"","Comments":"Comentários","You can add here some comments about this rule, to remember how and why you created it. These comments are purely indicative, and have no influence on the bot's behavior.":"","Timer":"Temporizador","You can configure several timers that will send messages at regular interval. These messages will be sent by the bot every X minutes. You can for example make the bot sent some sponsoring information every 5 minutes.":"Você pode configurar vários temporizadores que irão enviar mensagens em um intervalo de tempo regular. Estas mensagens serão enviadas pelo bot a cada X minutos. Você pode por exemplo, fazer com que o bot envie alguma informação de patrocínio a cada 5 minutos.","Messages":"Mensagens","One message per line. If multiple messages, it will pick one randomly every X minutes.":"","Send every X minutes":"Enviar a cada X minutos","The bot will post the message every X minutes.":"O bot irá enviar a mensagem a cada X minutos.","Bot command":"Comando de bot","You can configure the bot to respond to commands. A command is a message starting with a \"!\", like for example \"!help\" that calls the \"help\" command.":"","Command":"Comando","The command, without the starting \"!\". For example \"help\", \"sponsor\", ...":"O comando, sem iniciar com “!”. Por exemplo \"ajuda\", \"financie\", …","Message":"Mensagem","The message to send.":"","For more information about how to configure this feature, please refer to the documentation by clicking on the help button.":"","Banned users and patterns":"","Bot nickname":"Nickname do bot","There was an error during validation.":"Ocorreu um erro durante a validação.","Invalid value.":"Valor inválido.","This value is required.":"Este valor é requerido.","Value is of the wrong type.":"Valor está com o tipo errado.","Value is in the wrong format.":"Valor está com o formato errado.","Value is not in authorized range.":"","File size is too big (max size: %s).":"Tamanho do arquivo está muito grande (tamanho máximo: %s).","Duplicate value":"Valor duplicado","Value too long":"Valor muito longo","Too many entries":"","Slow mode is enabled, users can send a message every %1$s seconds.":"Modo lento está habilitado. Usuários podem enviar uma mensagem a cada %1$s segundos.","This chatroom does not exist, or is not accessible to you.":"Esta sala de chat não existe, ou está inacessível para você.","Log in using an external account":"Autenticar-se usando uma conta externa","Log in using an account on another Peertube instance:":"Autenticarse usando uma conta em outra instância do Peertube:","Your Peertube instance URL":"URL da sua instância do Peertube","Searching the video on the Peertube instance...":"Buscando o vídeo na instância do Peertube…","Invalid Peertube URL.":"URL do Peertube inválida","The livechat plugin is not installed on this Peertube instance.":"","This video is not available on this Peertube instance.":"Este vídeo não está disponível nesta instância de Peertube","In some cases, the video can still be retrieved if you connect to the remote instance.":"","Try anyway to open the video on the Peertube instance":"","Your browser has blocked the opening on the remote instance, please try to open manually this link:":"","Authentication failed":"Autenticação falhou","Tasks":"Tarefas","Create new task list:":"Criar uma nova lista de tarefas:","Error when saving the task list":"Erro ao salvar a lista de tarefas","Task list name":"Nome da lista de tarefas","Delete task list":"Apagar lista de tarefas","Are you sure you want to delete this task list?":"Você está certo que quer excluir esta lista de tarefas?","Create a new task":"Criar nova tarefa","Task name":"Nome da tarefa","Description":"Descrição","Delete task":"Excluir tarefa","Are you sure you want to delete this task?":"Você está certo que quer excluir esta tarefa?","Please choose a task list":"Por favor, escolha uma lista de tarefas","There is no task list for now, please first create one":"Ainda não existe uma lista de tarefas. Por favor, crie a primeira","Once you have chosen a task list, a new task will be created. To see the task, open the task application using the top menu. More information in the livechat plugin documentation.":"Depois de escolher uma lista de tarefas, uma nova tarefa será criada. Para ver a tarefa, abra o aplicativo de tarefas usando o menu superior. Mais informações na documentação do plugin livechat.","Become moderator":"Tornar-se moderador","Channel emojis":"Emojis do canal","You can configure custom emojis for your channel. These emojis will be available in the emoji picker. Users can also use them by with their short name (for example by writing \":shortname:\").":"","Short name":"Nome curto","You can use emojis in the chat using \":shortname:\". The short name can start and/or end by a colon (:), and only contain alphanumerical characters, underscores and hyphens. It is strongly recommended to start them by a colon, so that users can use autocompletion (by typing \":\" then press TAB).":"","File":"Arquivo","The emoji file.":"Arquivo do emoji","Import":"Importar","Export":"Exportar","If imported data are okay, don't forgot to save the form.":"Se os dados importados estiverem corretos, não se esqueça de salvar o formulário.","Add an entry":"Adicionar uma entrada","Remove this entry":"Remover esta entrada","Are you sure you want to remove this entry?":"Você está certo de que deseja remover esta entrada?","An error occured while loading data.":"","Embed":"Embutido","This link will open the chat within the Peertube interface.":"","Dock":"","You can generate a link that will open the chat in full page, logged in with your Peertube account. This can be use, for example, to have a web dock in your OBS, so you can read and interact with the chat directly from OBS. Don't share this link to anyone, as it would allow them to connect as yourself. Please find bellow the list of authentication token you have already generated. You can create a new one, or revoke any previous token. Please note that these tokens have no expiration date.":"","Password token":"","Date":"Data","Create a new token":"","Revoke the token":"","Token generated from the web interface":"","Are you sure you want to revoke this token?":"","<h3>Authentication</h3>":"<h3>Autenticação</h3>","Disable livechat tokens":"","Users can generate long term tokens to connect to the chat. These tokens can for example be used to include the chat in OBS web docks. Check <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/user/obs\" target=\"_blank\">the documentation</a> for more information. You can disable this feature by checking this setting.":"","Only registered users can send messages.":"Apenas usuários registrados podem enviar mensagens","Mute anonymous users":"Mutar usuários anônimos","Default value for new chatrooms. For existing chatrooms, you can change the feature in the room configuration form. When this feature is enabled, anonymous users can only read the chat, and not send messages.":"","Channel's chat terms & conditions":"","You can configure a \"terms & conditions\" message that will be shown to users joining your chatrooms.":"","Create a new poll":"Criar uma nova enquete","Poll":"Enquete","New poll":"Nova enquete","Complete and submit this form to create a new poll. This will end and replace any existing poll.":"","Question":"Questão","Poll duration (in minutes)":"Duração da enquete (em minutos)","Anonymous results":"Resultados anônimos","Choice {{N}}:":"Escolha {{N}}:","Poll ends at:":"Enquete termina em:","To vote, click on your choice or send a message with an exclamation mark followed by your choice number (Example: !1).":"","Send a message with an exclamation mark followed by your choice number to vote. Example: !1":"","This poll is now over.":"","This choice is not valid.":"","Your vote is taken into account. Votes are anonymous, they will not be shown to other participants.":"","Your vote has been taking into account, the counters will be updated in a moment.":"","Moderation delay":"","Moderation delay default value: <ul> <li>0: moderation delay disabled</li> <li>Any positive integer: messages will be delayed for X seconds for non-moderator participants, allowing moderators to delete message before any user can read it.</li> </ul>":"","Anonymize moderation actions":"","Anonymize moderation actions default value for new rooms. When this is enabled, moderation actions will be anonymized, to avoid disclosing who is banning/kicking/… occupants.":"","Moderation notes":"Notas de moderação","Error when saving the note":"Erro ao salvar nota","Create a new note":"Criar uma nova nota","Delete note":"Apagar nota","Are you sure you want to delete this note?":"Você está certo que quer excluir esta nota?","Search notes":"Buscar notas","Search filters":"Filtros de busca","Nickname of the participant at the time of the note creation":"","Search all messages":"Buscar todas as mensagens","Message search":"Busca de mensagens","Nickname of the participant when the message was sent":"","Enable Prosody mod_firewall":"","You can enable <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a> on your Prosody server. For more information, please check <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/mod_firewall/\" target=\"_blank\">the documentation</a>.":"","<a class=\"peertube-button-link orange-button secondary-button\" href=\"/p/livechat/admin/firewall\" target=\"_blank\">Configure mod_firewall</a>":"","Prosody mod_firewall configuration":"","Here you can configure Prosody <a href=\"https://modules.prosody.im/mod_firewall\" target=\"_blank\">mod_firewall</a> module. You can create multiple configuration files bellow, and change their order. Don't hesitate to share your configurations with the community (for example by adding some examples in the plugin documentation).":"","Warning: mod_firewall is disabled in the livechat <a href=\"/admin/plugins/show/peertube-plugin-livechat\" target=\"_blank\">plugin settings</a>, you have to enable it if you want this configuration to be taken into account.":"","Enabled":"Habilitado","Name":"Nome","Can only contain: alphanumerical characters, underscores and hyphens. Scripts will be loaded in alphabetical order.":"Pode conter apenas: caracteres alfanuméricos, sublinhaso e hífens. Scripts serão carregados em order alfabética.","File content":"Conteúdo do arquivo","Emoji only mode is enabled, you can only use emoji in your messages.":"Modo apenas emoji está habilitado. Você pode apenas utilizar emojis em suas mensagens.","Emojis only mode":"Modo apenas emoji","You can enable an \"Emojy only mode\" in your chatrooms. When this mode is enabled, participants can only send emojis (standard, or channel custom emojis). Moderators are not affected by this limitation.":"Você pode habilitar o \"Modo apenas amoji\" em suas slas de chat. Quando este modo está habilitado, os participantes podem apenas enviar amojis (padrões, ou cusomizados do canal). Moderadores não são afetados por esta limitação.","This mode can be usefull for example: <ul> <li>To avoid spam or offensive message when you are not here to moderate.</li> <li>When there are too many speaking participants, and you can't no more moderate correctly.</li> </ul>":"Este modo pode ser útil por exemplo: <ul> <li>Para evitar spam ou mensagens ofensiva, quando você não está disponível para moderar.</li> <li>Quando existem muitos participantes conversando, e você não consegue mais moderá-los corretamente.</li> </ul>","To enable or disable this mode, you can use the room configuration form. If you want to enable it for all your chatrooms at once, you can use the button bellow.":"Para habilitar ou desabilitar este modo, você pode usar o formulário de configuração da sala. Se você quer habilitar este modo em todas as salas de chat de uma vez, você pode utilizar o botão abaixo.","Enable the emoji only mode on all channel's chatrooms":"Habilitar o modo apenas emoji em todas as salas de chat dos canais","Forbid special characters":"Proibir caracteres especiais","By enabling this option, the moderation bot will automatically delete messages containing more than X special characters. Special characters are those that don't fit into one of these categories: letters, numbers, punctuation symbols, currency symbols, emojis.":"Ao habilitar esta opção, o bot de moderação irá excluir automaticamente mensagens que contenham mais do que X caracteres especiais. Caracteres especiais são aqueles que não se enquadram em nenhuma dessas categorias: letras, números, símbolos de pontuação, símbolos de moeda, emojis.","Tolerance":"Tolerância","Number of special characters to accept in a message without deleting it.":"Número de caracteres especiais que podem ser aceitos em uma mensagem, sem excluí-la.","This feature comes with the livechat plugin version X.X.X.":"Esta funcionalidade está disponível com o plugin livechat versão X.X.X.","No duplicate message":"Sem mensagens duplicadas","By enabling this options, the moderation bot will automatically moderate duplicate messages. That means if a user send the same message twice within X seconds, the second message will be deleted.":"Ao habilitar esta opção, o bot de moderação irá moderar automaticamente mensagens duplicadas. Isso significa que, se um usuário enviar a mesma mensagem duas vezes no período de X segundos, a segunda mensagem será excluída.","Time interval":"Intervalo de tempo","The interval, in seconds, during which a user can't send again the same message.":"O intervalo, em segundos, em que o usuário não pode enviar novamente a mesma mensagem.","Message type":"Tipo de mensagem","Standard":"Padrão","Announcement":"Anúncio","Highlight":"Destaque","Warning":"Aviso","_language":"pt-BR"}