{"You can find the plugin documentation here: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Peertube Plugin Livechat documentation </a>.":"Документацию по плагину вы можете найти здесь: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/ru/\" target=\"_blank\"> Документация по плагину Livechat для Peertube </a>.","Before asking for help, please use the diagnostic tool: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Launch diagnostic</a> (if this button is not opening a new window, please try to refresh the page).":"Перед тем, как попросить о помощи, пожалуйста, воспользуйтесь диагностикой: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Запустить диагностику</a> (если эта кнопка не открывает новое окно, просим вас обновить страницу).","You can choose here to have separate rooms for each video, or to group them by channel.":"Здесь вы можете выбрать, чтобы каждое видео имело отдельную комнату или чтобы чат-комната распротранялась на канал.","When watching a video, the chatbox will automatically open.":"При просмотре видео чат будет открываться автоматически.","Cancel":"Отмена","Successfully saved":"Успешно сохранено","Chatrooms":"Чат-комнаты","Configure your live's chatrooms":"Настройте чат-комнаты на своих трансляциях","Here you can configure some advanced options for chatrooms associated to your live streams.":"Здесь мы можете настроить некоторые продвинутые опии для чат-комнат, привязанных к вашим трансляциям.","Please select bellow one of your channel, to setup its chatting options.":"Пожалуйста, выберите ниже один из каналов, чтобы начать настройку.","Channel options":"Опции канала","You can setup here some options for this channel (moderation policies, ...).":"Здесь вы можете настроить некоторые опции для этого канала (политика модерации, ...).","Enable moderation bot":"Активировать бота-модератора","Moderation bot options":"Опции бота-модератора","Open chat":"Открыть чат","Room name":"Имя комнаты","You can connect to the room using an external XMPP account, and your favorite XMPP client.":"Вы можете подключиться к комнате, пользуясь внешней учётной записью XMPP и вашим любимым клиентом.","<h3>Important notes</h3>":"<h3>Важные примечания</h3>","<h3>Chat behaviour</h3>":"<h3>Поведение чата</h3>","Online help":"Онлайн-помощь","Save":"Сохранить","Open chat in a new window":"Открыть чат в новом вкладке","Close chat":"Закрыть чат","Use chat":"Использовать чат","If enabled, there will be a chat next to the video.":"Если включено, рядом с видео будет открыт чат.","Share chat link":"Поделиться ссылкой на чат","Read-only":"Только для чтения","Show the scrollbar":"Показывать полосу прокрутки","Transparent background (for stream integration, with OBS for example)":"Прозрачный фон (для интеграции в эфир, например, через OBS)","Tips for streamers: To embed the chat in your video stream using OBS for example, generate a read-only link and use it as a browser source.":"Для стримеров: чтобы добавить чат в OBS, создайте ссылку только для чтения и используйте её в источнике «Браузер».","Copy":"Копировать","Link copied":"Ссылка скопирована","Error":"Ошибка","Open":"Открыть","Use current theme colors":"Использовать цвета из текущей темы","Generate an iframe to embed the chat in a website":"Создать iframe для интеграци чата в веб-сайт","Chat for live stream:":"Чат живого эфира:","Room description":"Описание комнаты","Not found":"Не найдено","Video":"Видео","Channel":"Канал","Last activity":"Последняя активность","Web":"Веб","Connect using XMPP":"Подключиться по XMPP","<h3>Chat</h3>":"<h3>Чат</h3>","List existing rooms":"Показать существующие комнаты","<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">List rooms</a>":"<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">Показать комнаты</a>","<h3>Federation</h3> Following settings concern the federation with other Peertube instances, and other fediverse softwares.":"<h3>Федерирование</h3> Данные настройки касаются федерирования с другими серверами Peertube и прочим федиверс-софтом.","Don't display remote chats":"Не показывать внешние чаты","By checking this setting, your instance will never display chats from remote videos.":"Имея эту настройку, ваш сервер никогда не будет отображать чаты на видео с внешних серверов.","Don't publish chat information":"Не публиковать информацию чата","Room type":"Тип комнаты","Each video has its own webchat room":"Каждое видео имеет свою собственную чат-комнату","Webchat rooms are grouped by channel":"Чат-комната общая для канала","Automatically open the chat":"Автоматически открывать чат","_language":"ru"}