{"If checked, anonymous Peertube users won't see the chat. This feature is still experimental. If you enabled it, it is highly recommended to also check \"Don't publish chat information\". Otherwise, some third party tools could try to open the chat, and have unpredictable behaviours.":"若勾選，匿名 Peertube 用戶將看不到聊天資訊。 此功能仍處於實驗階段。 如果您啟用了它，強烈建議您也勾選「不發布聊天訊息」。 否則，某些第三方工具可能會嘗試開啟聊天，並出現不可預測的行為。","You can configure an external OpenID Connect provider that could be used to log in to the chat. Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Settings</a>.":"您可以設定可用於登入聊天的外部 OpenID Connect 提供者。 請參考檔案： <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">設定</a>。","Each video has its own webchat room":"每個影片都有自己的網路聊天室","Authentication failed":"驗證失敗","There is no task list for now, please first create one":"現在沒有任何任務，請創建第一個","Once you have chosen a task list, a new task will be created. To see the task, open the task application using the top menu. More information in the livechat plugin documentation.":"選擇任務清單後，將建立新任務。 若要查看任務，請使用頂部選單開啟任務應用程式。 即時聊天外掛檔案中的更多資訊。","Enable moderation bot":"啟用審核機器人","This video is not available on this Peertube instance.":"該影片在此 Peertube 實例上不可用。","Chatrooms":"聊天室","Configure your live's chatrooms":"您的直播聊天室設定","Here you can configure some advanced options for chatrooms associated to your live streams.":"您可以在此處為與直播相關的聊天室設定一些進階選項。","Warning: don't check this setting if you are not sure of what you are doing.<br> By checking this setting, your Peertube will use the Prosody server that comes with your system, and not the embedded AppImage.<br> Only use this if you encounter problems with the embedded Prosody.":"警告：如果您不確定自己在做什麼，請不要檢查此設定。 透過檢查此設置，您的 Peertube 將使用系統附帶的 Prosody 伺服器， 而不是嵌入的 AppImage。 僅當您遇到嵌入式 Prosody 問題時才使用此選項。","<h3>Channel advanced configuration</h3> Following settings concern the advanced channel options: users will be able to add some customization on their channels, activate the moderation bot, ...":"<h3>頻道進階組態</h3> 以下設定涉及進階頻道選項： 使用者將能夠在他們的頻道上新增客製化， 啟動審核機器人，...","Disable Websocket":"停用 Websocket","Save":"儲存","Successfully saved":"存檔成功","Please select bellow one of your channel, to setup its chatting options.":"請在下面選擇您的頻道之一，以設定其聊天選項。","Channel options":"頻道選項","You can setup here some options for this channel (moderation policies, ...).":"您可以在此處為此頻道設定一些選項（審核策略，...）。","Forbidden words or expressions":"禁止使用的單字或句子","You can configure some words that will be automatically moderated by the bot (messages containing such words will be instantly deleted). You can also add an optional reason that will be displayed at the place of deleted messages. Several examples are provided on the documentation page.":"您可以組態一些由機器人自動審核的單字（包含此類單字的訊息將立即刪除）。 您也可以新增一個可選原因，該原因將顯示在已刪除郵件的位置。 檔案頁面上提供了幾個範例。","One word or expression per line. If you put multiple words on one line, it will only match messages containing the whole sequence.":"每行只能一個單字或句子。如果將多個單字放在一行上，它將只配取到包含整行的訊息。","Command":"命令","For more information about how to configure this feature, please refer to the documentation by clicking on the help button.":"有關如何設定此功能的更多資訊，請按一下幫助按鈕參考檔案。","Banned users and patterns":"禁止的使用者和模式","There was an error during validation.":"驗證時出現錯誤。","Invalid value.":"無效的值。","This value is required.":"該欄必填。","Value is of the wrong type.":"該欄不接受這種型別。","Value is in the wrong format.":"錯誤的格式。","Value is not in authorized range.":"值不在符合範圍內。","File size is too big (max size: %s).":"檔案太大(max size: %s).","Duplicate value":"重覆值","Too many entries":"太多項目","This chatroom does not exist, or is not accessible to you.":"這個聊天室不存在或者您無法訪問。","Log in using an external account":"使用外部帳戶登入","Log in using an account on another Peertube instance:":"使用另一個 Peertube 實例上的帳號登入：","Your Peertube instance URL":"您的Peertube實例網址","Searching the video on the Peertube instance...":"在 Peertube 實例上搜尋影片...","In some cases, the video can still be retrieved if you connect to the remote instance.":"在某些情況下，如果您連接到遠端實例，仍然可以檢索視訊。","Try anyway to open the video on the Peertube instance":"無論如何嘗試在 Peertube 實例上打開影片","Your browser has blocked the opening on the remote instance, please try to open manually this link:":"您的瀏覽器阻止了遠端實例的啟動，請嘗試手動開啟此連結：","Tasks":"任務","Create new task list:":"創建新任務清單:","Error when saving the task list":"儲存任務清單時發生錯誤","Task list name":"任務清單名稱","Create a new task":"創建新任務","Task name":"任務名稱","Description":"任務用途","Delete task":"刪除任務","Are you sure you want to delete this task?":"您確定要刪除此任務?","Please choose a task list":"請選擇任務清單","Become moderator":"成為版主","Channel emojis":"頻道emojis","Moderation bot options":"審核機器人選項","Reason":"原因","The message to send.":"發送訊息。","Slow mode is enabled, users can send a message every %1$s seconds.":"限速模式已啟用，使用者可以每 %1$s 秒發送一則訊息。","Disable the advanced channel configuration and the chatbot":"停用進階頻道設定和聊天機器人","Cancel":"取消","Reason to display besides deleted messages":"除已刪除訊息外還顯示的原因","Error":"錯誤","Use current theme colors":"使用當前主題顏色","<h3>Chat</h3>":"<h3>聊天</h3>","By checking this setting, your instance will never display chats from remote videos.":"透過檢查此設置，您的實例將永遠不會顯示來自遠端視訊的聊天。","Don't publish chat information":"不公開聊天資訊","Activate chat for all lives":"所有直播啟動聊天室","Hide the chat for anonymous users":"隱藏匿名使用者的聊天","ConverseJS theme":"ConverseJS 主題","Please choose the converseJS theme you want to use.":"請選擇您要使用的 converseJS 主題。","Default ConverseJS theme":"預設ConverseJS主題","Webchat iframe style attribute":"聊天 iframe 風格屬性","Peertube url for API calls":"Peertube API呼叫網址","Delete task list":"刪除任務清單","Are you sure you want to delete this task list?":"您確定要刪除此任務清單?","<h3>Federation</h3> Following settings concern the federation with other Peertube instances, and other fediverse softwares.":"<h3>聯盟</h3> 以下設定涉及與其他 Peertube 實例的聯合， 和其他聯邦多元化軟體。","Terms & Conditions":"條款及條件","List existing rooms":"列出現有聊天室","Don't display remote chats":"不顯示遠端聊天","<h3>External authentication</h3> For users that have no Peertube account, you can enable various authentication modes based on remote authentication providers.":"<h3>外部身份驗證</h3> 對於沒有 Peertube 帳戶的用戶，您可以基於遠端身份驗證提供者啟用各種身份驗證模式。","<h3>Chat server advanced settings</h3>":"<h3>聊天伺服器進階設定</h3>","Value too long":"值超出範圍","The livechat plugin is not installed on this Peertube instance.":"此 Peertube 實例上未安裝即時聊天外掛程式。","Invalid Peertube URL.":"無效的Peertube網址。","<h3>Theming</h3>":"<h3>主題</h3>","Link copied":"連結已複製","Show the scrollbar":"顯示聊天捲軸","Transparent background (for stream integration, with OBS for example)":"透明背景（用於串流媒體整合，例如OBS）","Webchat rooms are grouped by channel":"網路聊天室按頻道分組","Automatically open the chat":"自動開啟聊天","Show for everyone":"任何人皆可看到","Show for the video owner":"只對影片擁有者顯示","Slow mode":"限速模式","Slow mode default value: <ul> <li>0: slow mode disabled</li> <li>Any positive integer: users can send a message every X seconds (moderators are not limited)</li> </ul>":"限速模式預設值： <ul> <li>0：停用限速模式</li> <li>任何正整數：使用者可以每 X 秒發送一條訊息（審核者不受限制）</li> </ul>","Name":"名字","Enabled":"啟用","You can configure custom emojis for your channel. These emojis will be available in the emoji picker. Users can also use them by with their short name (for example by writing \":shortname:\").":"您可以為您的頻道組態自訂表情符號。 這些表情符號將在表情符號選擇器中提供。 使用者也可以透過其短名稱來使用它們（例如透過編寫“:shortname:”）。","Short name":"簡稱","File":"檔案","Import":"匯入","Export":"匯出","<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">List rooms</a>":"<a class=\"peertube-plugin-livechat-prosody-list-rooms-btn\">列出聊天室</a>","Try to autodetect colors from user's current theme.<br> When this setting is enabled, the plugin tries to auto-detect colors to apply to the chat theme.<br> If this is not correctly working for some of your Peertube theme, you can disable this option. You can report the bug on the official <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> issue tracker </a>. Don't forget to specify which theme is not working.":"嘗試自動偵測使用者目前主題的顏色。 啟用此設定後，外掛程式會嘗試自動偵測顏色以套用至聊天主題。 如果這對於您的某些 Peertube 主題無法正常運作，您可以停用此選項。 您可以向官方報告該錯誤 <a href=\"https://github.com/JohnXLivingston/peertube-plugin-livechat/issues\" target=\"_blank\"> 問題追蹤器 </a>。不要忘記指定哪個主題不起作用。","File content":"檔案內容","Warning: mod_firewall is disabled in the livechat <a href=\"/admin/plugins/show/peertube-plugin-livechat\" target=\"_blank\">plugin settings</a>, you have to enable it if you want this configuration to be taken into account.":"警告：mod_firewall 在即時聊天<a href=\"/admin/plugins/show/peertube-plugin-livechat\" target=\"_blank\">外掛設定</a>中被停用，如果您希望此組態生效，則必須啟用它予以考慮。","With Peertube &gt;= 5.0.0, this plugin try to use Websocket connection for chatting. If the user's browser or connection is incompatible, the browser will automatically fall back on the BOSH protocol. <br> But in rare case, this can fail. For example, if you have a reverse proxy in front of Peertube that does not allow Websocket connection for plugins. In this case, you can check this setting to disable Websocket connections.":"當 Peertube >= 5.0.0 時，外掛嘗試使用 Websocket 連線進行聊天。 如果使用者的瀏覽器或連線不相容，瀏覽器將自動轉而使用 BOSH 協定。 <br> 但在極少數情況下，這可能會失敗。例如，如果您在 Peertube 前面有一個反向代理，但它不 允許外掛的 Websocket 連線。 在這種情況下，您可以檢查此設定以停用 Websocket 連線。","Can only contain: alphanumerical characters, underscores and hyphens. Scripts will be loaded in alphabetical order.":"只能包含：字母數字字元、底線和連字元。 指令將按字母順序讀取。","Open chat":"開始聊天","Copy":"複製","By checking this setting, your instance will not publish chat information on the fediverse. Remote Peertube instances will not be aware that they are chat rooms associated to your videos.<br> <b>Please note</b>: if you already had chats in progress, it is possible that the information has already been published. You will have to wait for the next video update before the information is unpublished. Also, if you disable this setting, you'll have to wait for the videos to be updated before the information are published again. This update happens among others when a live event resumes or stops.<br> <b>Please note</b>: this setting only affects the publication of information via the ActivityPub protocol. It will not prevent a remote application from otherwise detecting the presence of chats, and trying to connect to it.":"透過檢查此設置，您的實例將不會在 fediverse 上發布聊天訊息。 遠端 Peertube 實例不會意識到它們是與您的視訊關聯的聊天室。 <b>請注意</b>：如果您已經進行過聊天，則該資訊可能已經發布。 您必須等待下一次視訊更新，訊息才會取消發布。 此外，如果您停用此設置，則必須等待視訊更新後才能顯示資訊。 再次發布。當現場活動恢復或停止時，會發生此更新。 <b>請注意</b>：此設定僅影響透過 ActivityPub 協定發布資訊。 它不會阻止遠端應用程式檢測聊天的存在並嘗試連接到它。","By enabling this option, each time an anonymous user is banned from a chatroom, it's IP will also be banned from the chat server. Warning: if your instance is open to registration, any user could create a trapped-room, invite users to join, and automatically ban all anonymous user's IPs. The banned IP list is not stored, it will be cleared on server restart, or when you change some plugin's settings. The banned IP are logged in the Prosody server log files, so server's administrators can eventually use some external tools (like fail2ban) to ban IPs more widely.":"透過啟用此選項，每次匿名用戶被禁止進入聊天室時，其 IP 也將被聊天伺服器禁止。 警告：如果您的執行個體開放註冊，任何使用者都可以建立陷阱房間、邀請使用者加入，並自動禁止所有匿名使用者的 IP。 禁止的IP清單不會被存儲，它會在伺服器重新啟動或更改某些外掛的設定時被清除。 被禁止的IP會記錄在Prosody伺服器日誌檔案中，因此伺服器管理員最終可以使用一些外部工具（如fail2ban）來更廣泛地禁止IP。","You can choose from several different sets the default avatars that will be used for chat users. Please refer to the documentation: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">Settings</a>.":"您可以從多個不同的設定中選擇將用於聊天使用者的預設頭像。 請參考檔案： <a href=\"https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/settings/\" target=\"_blank\">設定</a>。","Sepia (Peertube mascot)":"棕褐色（Peertube 吉祥物）","Peertube theme":"Peertube主題","Automatic color detection":"自動色彩檢測","Open chat in a new window":"在新視窗開啟聊天","Close chat":"關閉聯天","Tips for streamers: To embed the chat in your video stream using OBS for example, generate a read-only link and use it as a browser source.":"給直播主的提示：例如，要使用 OBS 將聊天嵌入到視訊直播中， 產生唯讀連結並將其供瀏覽器使用。","These terms & conditions will be shown to all users when then join chatrooms. Streamers can also configure terms & conditions for their channels, that will be shown right after these global terms & conditions.":"這些條款和條件將在所有使用者加入聊天室時顯示。 直播主還可以為其頻道配置條款和條件，這些條款和條件將立即顯示在這些全域條款和條件之後。","When watching a video, the chatbox will automatically open.":"觀看影片時，聊天視窗會自動開啟。","Show the «open in new window» button":"顯示“在新視窗中開啟”按鈕","There will be a button for opening the web chat in a new window.":"此按鈕可在新視窗中開啟網路聊天。","Show the «share chat link» button":"顯示「共享聊天連結」按鈕","There will be a button for sharing a chat url (could be used for OBS integration, for example).":"用於共享聊天 URL 的按鈕（例如，可用於 OBS 整合）。","Show for nobody":"無人可見","Show for the video owner and instance's moderators":"只有影片擁有者與管理者可見","Ban anonymous user's IP when user is banned from a chatroom":"當用戶被禁止進入聊天室時，禁止匿名用戶的 IP","Copied":"已複製","Generate an iframe to embed the chat in a website":"產生 iframe 以將聊天嵌入到網站中","Chat for live stream:":"直播聊天:","Use chat":"使用聊天功能","If enabled, there will be a chat next to the video.":"如果啟用，影片旁邊將會出現聊天視窗。","Share chat link":"分享聊天連結","Read-only":"唯讀","Label for the connection button":"連接按鈕的標籤","This label will be displayed to users, as the button label to authenticate with this OIDC provider.":"此標籤將作為向該 OIDC 提供者進行身份驗證的按鈕標籤顯示給使用者。","Discovery URL":"OIDC_custom_dicovery_url","Room type":"聊天室類型","You can choose here to have separate rooms for each video, or to group them by channel.":"您可以在此處選擇為每個影片設定單獨的聊天室，或按頻道對它們進行分組。","Video":"影片","Channel":"頻道","Last activity":"最後異動","<h3>Important notes</h3>":"<h3>注意事項</h3>","Online help":"線上幫助","Not found":"未找到","You can find the plugin documentation here: <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Peertube Plugin Livechat documentation </a>.":"您可以在這裡找到外掛文件： <a href=\"https://livingston.frama.io/peertube-plugin-livechat/\" target=\"_blank\"> Peertube 外掛即時聊天檔案 </a>。","Before asking for help, please use the diagnostic tool: <a class=\"peertube-plugin-livechat-launch-diagnostic\">Launch diagnostic</a> (if this button is not opening a new window, please try to refresh the page).":"在尋求協助之前，請使用診斷工具： <a class=\"peertube-plugin-livechat-launch-diagnostic\">啟動診斷</a> （如果此按鈕沒有開啟新視窗，請嘗試重新整理頁面）。","Room description":"聊天室說明","Room name":"聊天室名稱","Users can activate the chat for their lives":"使用者在直播時可啟用聊天","<span class=\"peertube-plugin-livechat-warning\"> You have enabled the setting «Users can activate the chat for their lives». It is redundant with the «Activate chat for all lives» setting. </span>":"<span class=\"peertube-plugin-livechat-warning\"> 您已啟用「使用者可以自已啟用聊天室」設定。 它與“啟動所有直播都有聊天室”設定是互斥的。 </span>","If checked, the chat will be enabled for all lives.":"若勾選，則所有直播都啟用聊天室。","_language":"zh-Hant"}